[{"text": ">> Todd: ELON MUSK VISITING CIA  WITH JOHN RATCLIFFE TO DISCUSS  HOW DOGE CAN MAKE THE AGENCY  MORE EFFICIENT. HE DROPPED BY THE FIVE. >> EVERYTHING DOGE DOES IS AN  OPEN BOOK. MOST TRANSPARENT ACTION  ORGANIZATION IN GOVERNMENT EVER. EVER DOGE ACTION IS LISTED ON  THE DOGE WEBSITE. IF ANYONE HAS A CONCERN ABOUT  ANY ACTION, BRING THAT UP. >> Todd: MUSK TALKING ABOUT  ATTACKS ON TESLA, CALLING THEM  WIDE- SCALE DO MEFTECK MEFT  ICTERRISM AND ASKING TO CRACK  DOWN. >> THEY ARE THROWING MOLOTOV  COCKTAILS. THEY ARE FOOT SOLDIERS, WE NEED  TO GO AFTER THE GENERALS THAT  ARE PAYING AND ORGANIZE NOOZING  VIOLENT ATTACKS. ATTORNEY GENERAL BONDI SAID THE  SAME THING. >> DO YOU KNOW WHO THEY ARE? >> WE ARE COMING FOR THEM. >> DO YOU KNOW WHO THOSE  GENERALS ARE? >> WE DO. >> Todd: SPECIAL AGENT NICOLE  PARKER JOINS ME NOW. IF WE KNOW WHO THE GENERALS ARE, HOW DO WE TRACK THEM DOWN AND                                PROSECUTE THEM? >> YOU HAVE FBI DIRECTOR KASH  PATEL AND ATTORNEY GENERAL PAM  BONDI, ABOUT ENFORCING THE LAW. THIS VIOLENCE IS UNACCEPTABLE. WHAT IS SHOCKING TO MANY PEOPLE, MANY OF THEM WERE LIKELY  INVOLVED IN 2020 AND NO  CONSEQUENCE. THEY WERE DOING SIMILAR ACTIONS  AND SIMILAR GROUPS, THIS TIME IT IS NOT HAPPENING. FBI DIRECTOR PATEL WILL CONDUCT  INVESTIGATIONS AND FBI AGENTS  WILL GET IN THERE, SEE CRIME AND DO FULL INVESTIGATIONS. YOU FOLLOW THE MONEY. THE MONEY DOES NOT LIE. I THINK ELON MUSK IS CORRECT, IF THIS IS FUNDED, THEY WILL GET TO THE BOTTOM OF IT. THERE MIGHT BE INDIVIDUALS THAT  ARE EXECUTIVING THE PLAN, THEY   ARE GOING AFTER WHO IS FUNDING  IT. THAT IS WHAT CORRUPTION IS  ABOUT, GETTING TO THE ROOT OF  THE PROBLEM. NOT ENOUGH GOING AFTER THE  PERSON THROWING THE MOVE TOF  COCKTAIL. WHO IS THE FUNER? >> Todd: GOOD LUCK TO THE FBI  SOLVING IT. ATTORNEY GENERAL BONDI DIRECTING FEDERAL PROSECUTORS TO SEEK THE  DEATH PENALTY FOR LUIGI  MANGIONI, SAYINGS IT WAS A  COLD-BLOODED ASSASSINATION. HOW BIG IS THIS MOVE AS \n     DETERRENT, ESPECIALLY AFTER JOE  BIDEN COMMUTED DEATH SENTENCES  OF 37 KILLERS? >> IT IS HUGE. IF THERE IS NO SERIOUS  CONSEQUENCE OR PEOPLE BELIEVE  THEY CAN GET AWAY WITH MURDER IT CONTINUES THE CYCLE OF VIOLENCE. PAM BONDISPAZ IS GOING FOR THE  DEATH PENALTY, IT IS A BIG DEAL. THERE HAS NOT BEEN A FEDERAL  EXECUTION IN NEW YORK FOR 70  YEARS. THIS WAS A COLD-BLOODED,A  ASSASSINATION. HE WENT AND TOOK THE LIFE OF AN  INNOCENT MAN WHO HAD CHILDREN. I UNDERSTAND HE HAD A BEEF WITH  THE INDUSTRY OF INSURANCE, THAT  IS UNACCEPTABLE, NOT THE WAYS  YOU DEAL WITH GRIEVANCES BY  MURDERING SOMEBODY. FOR HER TO STEP IN AND SAY THIS, YOU ARE RIGHT. JOE BIDEN DID COMMUTE 37  INDIVIDUALS, FEDERAL PRISONERS  ON DEATH ROW AND HE SAID, WE'LL  CHANGE THAT TO LIFE SENTENCE,  THAT IS SLAP IN THE FACE TO THE  FAMILY MEMBERS. FOR BONDI TO DO THIS, IT IS A  HUGE DETERRENCE. >> Todd: EVEN DEMOCRATS PUSHED  BACK ON THOSE COMMUTATIONS. YOU ARE TESTIFYING AT THE  SUB-COMMITTEE HEARING TODAY TO  EXAMINE FBI WASTE, FRAUD AND  ABUSE DURING THE BIDEN ERA. WHAT ARE YOU GOING TO TELL  CONGRESS IN A FEW HOURS? >> I LOVE BEING A SPECIAL AGENT  WITH THE FBI. IT GOT TO THE POINT I WALKED  AWAY. WHEN YOU SIGN UP FOR ONE MISSION AND IT TURNS INTO ANOTHER, IT IS UNACCEPTABLE. THE FBI BECAME POLITICALLY AND  SOCIALLY POLITICIZED. MY FRIEND IN THE FBI, SHOT AND  KILLED ISSUING A SEARCH WARRANT, THEY SENT SWAT RESOURCES ACROSS  THE NATION TO GO AFTER  NONVIOLENT CRIMINALS. THAT IS UNACCEPTABLE. THE FBI DID NOT EVEN PAY FOR HER FUNERAL SERVICES OR ANOTHER THAT WAS SHOT AND KILLD THAT MORNING. THEY WENT TO A PRIVATE DONOR. EFFORTS THEY PUT TOWARD DEI IS  EXAMPLE OF WASTE, FRAUD AND  ABUSE. >> YOU HAVE BEEN A TIREL"}, {"text": "All right. Elon Musk himself was interviewed on \nFox News and he was extraordinarily triggered by   Tim Walls simply laughing about Tesla \nstock price going down. Are you so   threatened that you feel the need to go on the \noffensive? Because Tim Walls just said, look,   Tesla's I'm holding my phone up. Tesla stock is \ngoing down and Elon can't handle it. As you know,   the things that Trump and Elon Musk \nreally have in common are that they are   some of the most triggly billionaires \nI've ever seen. Does that help Tesla?  I mean, you had Tom Waltz was a huge \njerk. He's a jerk, right? You know,   running around on stage with a Tesla stock price, \nhaving with a stock price had gone in half. Right.   And he was overjoyed. But what an evil thing to \ndo. What a creep, what a jerk. Like who derives   joy from from that? and I'll see you again.\nWhat a jerk. Now, if you want to really dig   into moral compass and the deriving of joy, Elon \nMusk now has been celebrating the firings of what   number I at this point, I couldn't even tell \nyou the real number of people that have been   fired through Doge by Elon Musk. And it seems to \nme extraordinarily hypocritical to celebrate those   firings and the losses financially for these \npeople who don't have the financial support   that Elon Musk has based on his wealth. And he \nsays it's evil that Tim Walz laughed at Tesla   stock price going down. What a backward situation. \nWhat a backwards situation. Brett Baier also asked   Elon what's keeping you up at night. Now, the \nyou're going to hear a pause as Elon is thinking.   This pause is not exaggerated in any way. OK, \nthis is just the natural pause. Take a listen.  Finally, what's the biggest thing \nfor you that keeps you up at night?   Well, there's a lot of things, I suppose, that I \nworry about. And some of these things will seem   esoteric to people. The birth rate is very low \nin almost every country. And unless that changes,   civilization will disappear. America had the \nlowest birth rate, I believe, ever. That was   last year. Places like Korea, the birth rate \nis one third replacement rate. So that means   in three generations, Korea will be 3% or 4% of \nits current size. And nothing seems to be turning   that around. Humanity is dying. And people, \nit's just not something we evolved to react to.  Now, of course, this is a much bigger story, \nthe issue of declining birth rates. And one   of the things that I've read a couple of books \non this issue, it is absolutely the case that   birth rates are declining. And it seems as though \nglobally, the richer and more developed countries   get the more the birth rate declines for a \nbunch of different reasons. It also relates   to women being in the workforce. delaying the age \nat which you have your first kid, which generally   reduces the number of kids you have total people \nwho can't afford to have as many kids as maybe   once people could. Uh, there's a whole bunch of \nstuff that goes into it, but something about Elon   Musk's obsession with it combined with the fact \nthat he's got, I think more than a dozen kids,   some under circumstances that, I mean, listen, \nyes, you're populating the earth, But are you   actually providing what children need? beyond \njust money, if he's even providing the money,   you know, sort of like raises questions as to the \nway in which we want to deal with this issue. Elon   Musk seems fixated on this issue in a way that's \nstarting to get a little weird. So there's Elon,   people are being mean to him and he's really, \nreally upset. A while back I used to have this   giant leather brick of a wallet in my back pocket \nand I would feel it when I would sit down, I would   be off kilter. And one day I said enough. I need \nsomething slim and light and minimal. So I got a   Ridge wallet and I've been using it and loving \nit for years now before they became a sponsor.   I was already using a Ridge Wallet. I love the \ndesign. It's narrow. It holds up to 12 cards plus   my cash and Ridge wallets are made with premium \nmaterials, aluminum, titanium, carbon fiber,   more than 50 colors and styles with RFID blocking \ntechnology for extra peace of mind. Rich products   have a lifetime warranty. You literally get \nthe last wallet you'll ever have to buy and   they guarantee it for life. And with a 99 day risk \nfree trial, if you change your mind, it's no big   deal. Ridge isn't just about wallets. They've also \ncreated premium everyday convenience essentials,   key cases, suitcases, rings, all built with the \nsame sleek, durable design. And right now, Ridge   is having their once a year anniversary sale. get \nup to 40% off at ridge.com slash Pacman after you   purchase. They'll ask you where you heard about \nRidge. Please show your support. Tell them I sent   you that's ridge. Dot com slash Pacmen for up to \nforty percent off. The link is in the description."}, {"text": "\" >> Jeanine: I  -- ELON MUSK IS   CALLED THE BOOGIE MAN OF  TONIGHT'S SPECIAL ELECTIONS. ONE OF THOSE RACES MUSK SAYS  COULD AFFECT THE DESTINY OF  HUMANITY. THE BILLIONAIRE HAS BEEN  RALLYING VOTERS IN WISCONSIN TO  GET BEHIND CONSERVATIVE BRAD  SHEMMEL. IN TODAY'S HIGH STAKES SUPREME  COURT RACE. ELON MUSK JOINS US NOW FOR AN  EXCLUSIVE INTERVIEW. THANK YOU SO MUCH FOR JOINING  US, ELON. WE'RE THRILLED TO HAVE YOU ON  \"THE FIVE.\" >> THANK YOU FOR HAVING ME. >> Jeanine: WE'RE DELIGHTED TO  HAVE YOU. WHY IS THIS RACE IN WISCONSIN SO IMPORTANT AND WHAT IS YOUR  RESPONSE DEMOCRATS WHO HAVE  TRIED TO MAKE THIS A REFERENDUM  ON YOU? >> THE REASON TONIGHT'S  ELECTIONS ARE SO IMPORTANT, THE  JUDGE RACE WILL DECIDE WHETHER  THE WISCONSIN DIRECTS WILL GET  REDRAWN AND TO BELIEVE TWO  REPUBLICAN SEATS. THE HOUSE IS CURRENTLY  REPUBLICAN BY A RAZOR THIN  MARGIN, WHICH MEANS THAT LOSING  THIS JUDGE RACE HAS GOOD CHANCE  OF CAUSING REPUBLICANS TO LOSE  CONTROL OF THE HOUSE. YOU LOSE CONTROL OF THE HOUSE,  THERE'S NONSTOP HEARINGS AND  SUBPOENAS. IT'S GOING -- THEY'LL DO  EVERYTHING POSSIBLE TO STOP THE  AGENDA THAT THE AMERICAN PEOPLE  VOTED FOR WHEN THEY VOTED FOR  PRESIDENT TRUMP WITH THE POPULAR VOTE, AND THE HOUSE AND THE  SENATE IN NOVEMBER. THEY'RE GOING TO DO EVERYTHING  POSSIBLE TO STOP THE PRESIDENT'S AGENDA. SO IT'S INCREDIBLY IMPORTANT  THAT PEOPLE IN WISCONSIN GO OUT  AND VOTE RIGHT NOW, CONTACT  THEIR FRIENDS AND FAMILY,  CONTACT THEIR NEIGHBORS AND TAKE THEM TO THE POLLING STATIONS,  WHICH CLOSE AT 8:00 P.M.  TONIGHT. YOU CAN REGISTER TO VOTE AND  VOTE TODAY. IT'S AN EXTREMELY TIGHT RACE. THIS IS A RACE THAT WILL BE  DECIDED BY MAYBE HALF A PERCENT  OR A PERCENT. IT'S REALLY NECK AND NECK. SO THIS COULD BE DECIDED BY A  SINGLE VOTER POTENTIALLY. THAT'S HOW CLOSE IT IS. SO IF YOU KNOW PEOPLE IN  WISCONSIN, CALL THEM RIGHT NOW  AND ASK THEM TO GO AND VOTE AND  AGAIN, ASK THEM TO BRING THEIR  FRIENDS, FAMILY AND NEIGHBORS. THIS IS A CRUCIAL ELECTION. THERE'S ALSO A BALLOT INITIATIVE TO ENSHRINE VOTER I.D. IN THE  WISCONSIN CONSTITUTION, WHICH IS ESSENTIAL FOR ELECTION  INTEGRITY.  >> Jeanine: OKAY. THE INTERESTING PART OF THAT IS  FOR YEARS PEOPLE HAVE NEVER  REALLY UNDERSTOOD, ELON, THE  SIGNIFICANCE OF THIS WISCONSIN  STATE SUPREME COURT RACE. YOU MAKE IT VERY CLEAR IN TERMS  OF GERRYMANDERING AND THE  ATTEMPT THEN OBVIOUSLY TO CHANGE THE NUMBER OF PEOPLE,  CONGRESSIONAL SEATS IN  WISCONSIN. SO THANK YOU FOR THAT. SO WE'RE GOING TO GO AROUND THE  TABLE. CONTINUE TO ASK SOME QUESTIONS. SO I'LL STEM WITH YOU, GREG  GUTFELD.  >> Greg: ALL RIGHT. ELON, GREAT TO SEE YOU AS  ALWAYS. I HAVE TWO QUESTIONS.  >> YEAH.  >> Greg: ONE, I HAVE NOTICED IN  THE PAST, YOU SEEM INCAPABLE OF  BEING RISK AVERSE. IF YOU SEE SOMETHING, YOU WANT  TO TRY. YOU TRY IT. SO I'M WONDERING, WHAT KIND OF  ADVICE WOULD YOU GIVE TO A YOUNG PERSON WHOSE FEAR OF FAILURE  KEEPS THEM FROM TAKING RISKS  THAT WOULD ACTUALLY ENRICH THEIR LIVES, WHETHER IT'S CAREER,  PERSONAL LIFE. MY NEXT QUESTION IS WHEN THE  HELL ARE YOU DOING MY SHOW? I LEFT VOICE MAIL MESSAGES, I'VE SENT CARRIER PIGEONS. I GET NO RESPONSE. >> WELL, I'LL BE HAPPY TO DO  YOUR SHOW. I ACTUALLY -- I'VE SEEN PIECES  OF YOUR SHOW. IT'S VERY FUNNY. IT'S MY STYLE OF HUMOR. SO I LOOK FORWARD TO DOING YOUR  SHOW.  >> Greg: AWESOME. >> WITH RESPECT TO WHAT TO TELL  YOUNG PEOPLE, I THINK IT'S  ALWAYS GOOD WHEN WE'RE THINKING  ABOUT SOMETHING THAT YOU'RE  AFRAID OF, WHEN THINKING ABOUT  FEAR, LOOK FEAR STRAIGHT IN THE  EYE AND IT WILL DISAPPEAR. >> Jeanine: OKAY. ALL RIGHT. >> THE NATURE OF FEAR IS THAT  PEOPLE DON'T LOOK AT IT. LOOK AT IT DIRECTLY. IT WILL BE GONE. >> Jeanine: ALL RIGHT. THANK YOU. >> Greg: YEAH. >> Jeanine: GOOD ADVICE. JESSE? >> Jesse: JESSICA, LOOK AT ME. LOOK AT ME. FACE YOUR FEARS, JESSICA. ELON, HOW ARE YOU? I'M JESSE WATTERS. I'M NOT GOING TO BEG FOR YOU TO  COME ON MY SHOW. I KNOW IT WILL HAPPEN  EVENTUALLY. YOU SAID THE --  >> ABSOLUTELY.  >> Jesse: -- YOU UNCOVERED  EVIDENCE THAT THERE WAS MASSIVE  SOCIAL SECURITY FRAUD AND                        ARRESTS WERE IMMINENT. WHAT CAN YOU TELL US ABOUT THAT  AND WHAT HAVE YOU SEEN  POLITICIAN DOS TO MAKE MASSIVE  AMOUNTS OF MONEY OFF OF THE  FEDERAL GOVERNMENT LIKE NANCY  PELOSI, PLEASE? >> YES. SO WE'VE -- THERE'S REALLY SO  MUCH -- IT'S DECIDING WHAT  SHOULD WE PROSECUTE AT FIRST. YOU HAVE A LONG LIST. YOU HAVE TO PRIORITIZE THE LIST. WE CAN GIVE IT TO DEPARTMENT OF  JUSTICE. THEY HAVE A PROCESS THAT THEY GO THROUGH TO REVIEW AND THINK  ABOUT IT. THE WHEELS OF JUSTICE TURN  SLOWLY. I HAVE A SENSE OF URGENCY. SO TO ME WHEN I SEE TERRIBLE  FRAUD HAS HAPPENED, WHY HAVEN'T  WE ARRESTED SOMEONE ALREADY? BUT AS THE SAYING GOES, THE  WHEELS OF JUSTICE TURN SLOWLY  BUT SURELY. AND I THINK PROBABLY THE PERSON  THAT STOLE $400,000 SOCIAL  SECURITY NUMBERS AT LEAST, MAYBE MORE, WILL BE ARRESTED HOPEFULLY THIS WEEK. YOU KNOW, WITH RESPECT TO THE  NONGOVERNMENTAL ORGANIZATIONS,  THESE FAKE NGOs, I THINK THERE  NEEDS TO BE A NUMBER OF ARRESTS  IN THAT REGARD AS WELL. THESE ARE FAKE CHARITIES WHERE  MOSTLY DEMOCRATS -- I WANT TO BE CLEAR. SOMETIMES LITTLE BIT OF  REPUBLICANS IN THERE. THEY SOMETIMES THROW THE  REPUBLICANS A BONE TO SAY HEY,  BE QUIET ABOUT THIS. SO IT'S -- THAT'S WHERE YOU  START GETTING THE UNI-PARTY  THING GOING ON. IT'S OVERWHELMINGLY TO  DEMOCRATS. AND THEY GIVE THESE -- BILLIONS  OF NGOs RUN BY DEMOCRATS THAT GO THROUGH A NETWORK OF ADDITIONAL  NGOs. IT'S A GIANTS MONEY LAUNDERING  SCHEME. AT THIS POINT, I THINK THE WORD  NGO AND MONEY LAUNDERING ARE  ALMOST SYNONYMOUS. >> Jeanine: OKAY. >> Jesse: THANK YOU. >> Jeanine: MAKES SENSE TO ME. KENNEDY? >> Kennedy: HELLO, JUDGE. HELLO, ELON.  >> HI. THANK YOU. >> Kennedy: LET'S TALK A LITTLE  BIT ABOUT SOME OF THE ANTI-TESLA VIOLENCE. YOUR CAR COMPANY WAS --  >> IT'S UNBELIEVABLE.  >> Kennedy: YEAH. IT WAS A LEFTIST DREAM COME  TRUE. IT WAS TECHNOLOGICALLY ADVANCED. IT WAS THE WORD OF MOUTH WAS  BETTER THAN ANY CAR COMPANY  ARGUABLY ON THE MARKET. AND NOW THE LEFT IS TRYING TO  MAKE IT A PARIAH BY TYING THEIR  ANTI-ELON POLITICS TO VIOLENCE. HOW DO YOU TALK THE UNHINGED OFF OF THE LEDGE AND HOW DO YOU  COUNTER THAT VIOLENCE THAT  YOU'RE SEEING AT TESLA  DEALERSHIPS? >> YES. IT IS REMARKABLE THAT THERE IS  SO MUCH VIOLENCE. PEOPLE HAVE BURNT CARS, THEY  FIRED BULLETS IN TO DEALERSHIPS. THEY HAVE SCRATCHED SWASTIKAS IN TO TESLA OF INNOCENT THAT --  THAT ARE JUST GOING ABOUT THEIR  LIVES. THEY'RE DOING NOTHING WRONG. TESLA HAS DONE NOTHING WRONG AS  A COMPANY. I FIND IT HYPOCRITICAL THAT THE  SAME DEMOCRAT POLITICIANS THAT  WOULD WANT TO THROW SOMEONE IN  PRISON FOR 20 YEARS SIMPLY FOR  WATCHING THINGS AT JANUARY 6th,  BUT NOT DOING VIOLENCE HAVE --  YOU DON'T HEAR A SINGLE WORD  FROM THEM ABOUT THE ACTUAL  VIOLENCE HAPPENING ABOUT TESLA. WHAT INCREDIBLE HYPOCRITES THEY  ARE. IT'S OUTRAGEOUS. I MEAN, REALLY, THIS IS  FUNDAMENTALLY A CASE OF  TERRORISM. IT'S WIDE SCALE DOMESTIC  TERRORISM AND IT'S HARMING  INNOCENT PEOPLE. IT'S REALLY TERRIBLE. WHAT WE HAVE TO GET TO ARE THE  PEOPLE THAT ARE ORGANIZING AND  PAYING FOR THESE ATTACKS AND  PROTESTS. THAT'S WHO WE REALLY NEED TO GO  AFTER. BECAUSE THE PEOPLE THAT ARE  ACTUALLY THROWING THE MOLOTOV  COCKTAILS, THEY'RE THE FOOT \n   GENERALS.  >> WE HAVE TO GOES AGAINST THOSE AGAINST PAYING FOR THESE VIOLENT ATTACKS. ATTORNEY GENERAL BONDI WILL DO  THAT  >> Kennedy: DO YOU KNOW WHO THE  GENERALS ARE? >> WE DO. >> Jeanine: AND HOPEFULLY THE  PROSECUTION WILL BE FOR RICO AND AN ORGANIZED CRIMINAL  ENTERPRISE, WHICH MAKES THE  PENALTY MORE SERIOUS.  >> YES, THESE -- ABSOLUTELY  THESE ARE SERIOUS CRIMES WHERE  THE ORGANIZERS AND PUSHERS OF  MASS VIOLENCE WILL GO TO PRISON  FOR A VERY LONG TIME. >> Jeanine: THAT'S RIGHT.  >> I HOPE THEY SEE THIS SEGMENT. >> Jeanine: WELL, WE'LL PLAY IT  AGAIN. JESSICA IN.  >> Jessica: LIBERAL TESLA LOVER. MY SISTER HAS TWO IN HER FAMILY. I HAVE NOT THROWN ANY MOLOTOV  COCKTAILS RECENTLY.  >> THANKS.  >> Jessica: I WANTED TO TALK TO  YOU ABOUT WHAT DOGE HAS BEEN  DOING. SO YOU'VE BEEN MAKING CUTS TO A  LOT OF THE AGENCIES THAT HAVE  OPEN INVESTIGATIONS AND  REGULATORY BATTLES WITH YOUR  COMPANIES. AT THE SAME TIME YOU CONTINUE TO GET BILLIONS IN GOVERNMENT  CONTRACTS. TESLA GET BILLIONS IN SUBSIDIES. HOW DO YOU EXPLAIN THAT TO THE  AMERICAN PEOPLE? >> WELL, EVERYTHING THAT DOGE  DOES IS AN OPEN BOOK. SO WE'RE -- I THINK THE MOST  TRANSPARENT ACTION THAT -- MOST  TRANSPARENT ORGANIZATION IN  GOVERNMENT EVER. EVERY DOGE AGAINST IS LISTED ON  THE WEBSITE, ALSO LISTED ON THE  X HANDLE. SO IF ANYONE HAS A CONCERN ABOUT ANY ONE OF THOSE ACTIONS, THEY  CAN BRING THAT UP, RAISE THAT. I DO WANT TO SAY SOMETIMES WE  MAKE A MISTAKE. NOBODY BATS 1,000. AT TIMES WE'LL MAKE A MISTAKE. WE'LL ACT VERY QUICKLY TO  CORRECT IT. I AM UNDER SUCH AN EXTREME  SPOTLIGHT, SO MUCH SCRUTINY. IT'S IMPOSSIBLE FOR ME TO GET  AWAY WITH ANYTHING NEFARIOUS. OBVIOUSLY FOR DO I WISH TO. SO THIS IS A CASE WHERE WE HAVE  RADICAL TRANSPARENCY. WE'RE ACTUALLY WILLING TO ADMIT  THAT WE DO MAKE MISTAKES. PEOPLE ARE OFTEN NOT WILLING TO  ADMIT THEY MAKE MISTAKES. WE ARE. WE QUICK THEM FIXLY AND TRY TO  DO THE RIGHT THING FOR THE  AMERICAN PEOPLE AND THE AMERICAN TAXPAYER. HISTORY WILL BE A JUDGE THAT  WHAT WE'VE DONE HERE AND WHAT  WE'RE DOING IS A VERY GOOD THING FOR THE STRENGTH AND FUTURE OF  AMERICA. >> Jessica: OKAY.  >> Jeanine: OKAY. SO ELON, FOR ONE LAST TIME,  REMIND THE VIEWERS WHY THE  ELECTION IN WISCONSIN IS SO  IMPORTANT TO AMERICA AS WELL AS  THE TRUMP AGENDA. >> ABSOLUTELY. THE REASON THAT -- BECAUSE IT  SEEMS LIKE WHY ISN'T THIS WRATH  AREA SMALL THING. IT'S HAPPENING IRONICALLY ON  APRIL FOOLS DAY. THIS IS NOT A JOKE. IT'S VERY REAL. SO A JUDGE RACE ELECTION IN  WISCONSIN WILL DECIDE WHETHER OR NOT THE DEMOCRATS CAN  GERRYMANDER WISCONSIN IN ORDER  TO REMOVE TWO HOUSE SEATS FROM  REPUBLICAN TO DEMOCRAT. BECAUSE OF THE RAZOR THIN  MARGIN, THAT COULD MEAN A FLIP  OF THE HOUSE FROM REPUBLICAN TO  DEMOCRAT. THAT MEANS AT THE NEXT ELECTION, LESS THAN TWO YEARS FROM NOW,  THE HOUSE WILL THEN IMMEDIATELY  TAKE ACTION TO STOP THE  PRESIDENT'S AGENDA. IT'S WORTH REMINDING PEOPLE, THE PRESIDENT WAS ELECTED WITH THE  MAJORITY OF THE PEOPLE OF  AMERICA. A MEANINGFUL MAJORITY OF THE  POPULAR VOTE. SO ALL THE PRESIDENT IS TRYING  TO DO IS IMPLEMENT THE WILL OF  THE PEOPLE. THEY'RE TRYING TO STOP THE WILL  OF THE PEOPLE THROUGH JUDICIAL  TRICKERY. IN FACT, IN GENERAL, THERE'S A  HUGE PROBLEM WITH ACTIISTS THAT  ARE POLITICIANS IN JUDGE'S  ROBES. THAT NEEDS TO STOP. IT'S UNDERMINING THE REALITY AND PERCEPTION OF THE INTEGRITY OF  THE LEGAL SYSTEM OF THE UNITED  STATES. AND THESE FAKE JUDGES SHOULD BE  A ASHAMED OF THEMSELVES. THEY'RE JUST PRETENDING TO BE  JUDGES. BUT THEY'RE NOT. THEY'RE MAKING THE LAW INSTEAD  OF IMPLEMENTING THE LAW. IT'S WRONG. >> Jeanine: YES. THEY'RE ACTIVISTS. YOU SAY YOU CAN REGISTER AND  VOTE TODAY? >> YES. YOU CAN REGISTER AND VOTE TODAY. AND THE VOTING STATIONS CLOSE AT 8:00 P.M. LOCAL TIME. >> Jeanine: ALL RIGHT."}, {"text": "T NOW. ♪ MUSK SAT DOWN ALONG SEVEN MEMBERS OF THE DOGE TEAM GIVING A BEHIND THE SCENES LOOK. A LIFT OF THE CURTAIN UP OF PRESIDENT TRUMP'S COST CUTTING DEPARTMENT. >> Rachel: THE TEAM CONSISTS OF THE WIDE RANGE OF EXPERTS, INCLUDING A FORMER ROCKET SCIENTIST. AND ONE OF THE CO-FOUNDERS OF THE RENTAL SITE ARAB. >> Lawrence: THE FOLLOW TO SLASH GOVERNMENT SPENDING. >> THE GOAL IS TO REDUCE THE DEFICIT BY A TRILLION DOLLARS. >> Bret: YOU TECHNICALLY ARE A SPECIAL GOVERNMENT EMPLOYEE. YOU ARE SUPPOSED TO BE 130 DAYS. ARE YOU GOING TO CONTINUE PAST THAT OR DO YOU THINK THAT'S WHAT YOU ARE GOING TO DO? >> WELL, I THINK WE WILL HAVE ACCOMPLISHED MOST OF THE WORK REQUIRED TO REUSE THE DEFICIT BY A TRILLION DOLLARS WITHIN THAT TIME FRAME. WE ACTUALLY WANT TO BE CAREFUL IN THE CUTS, SO WE WANT TO MEASURE TRIES, IF NOT TRICE, AND TO CUT ONCE. THEY MAY CHARACTERIZE IT SHOOTING FROM T. THE HIP BUT IT'S NOT THAT. >> Bret: STEVE DAVIS, YOU ARE A ROCKET SCIENTIST? >> USED TO BE. ALL OF US ARE WILLING TO KIND OF PUT OUR LIVES ON ORDER TO DO. I THINK WHAT IS SPECIAL RIGHT NOW, WE ACTUALLY BELIEVE THERE IS A CHANCE TO SUCCEED. >> WE BELIEVE THE GOVERNMENT CAN HAVE AN APPLE STORE EXPERIENCE. BEAUTIFULLY DESIGNED, GREAT EXPERIENCE MODERN SYSTEMS. >> Lawrence: THIS IS BEAUTIFUL. YOU HAVE MULTIPLE KIDS, RACHEL. YOU KNOW THE BOOGIE MAN THEORY. THEY THINK SOMETHING IS UNDER THE BED. YOU PULL IT UNDER THE BED AND THAT'S JUST A LITTLE TOY. THAT'S WHAT HAPPENED YESTERDAY. WE HADN'T SEEN THEIR FACES THE MEDIA AND THE DEMOCRATS THESE ARE THE BOOGIE MAN, TRYING TO TAKE THINGS AWAY FROM YOU. THESE ARE ACCOMPLISHED INDIVIDUALS THAT LOVE THE COUNTRY. AND WANNA MAKE LIFE BETTER FOR THE AMERICAN PEOPLE. THEY'RE TRYING TO CREATE A USER FRIENDLY GOVERNMENT, ESSENTIALLY, AND I LOVE MY FAVORITE QUOTE WAS CREATING THE APPLE EXPERIENCE FOR THESE GOVERNMENT WORKERS. >> Rachel: IMAGINE, THEY WERE TALKING ABOUT CREATING THAT APPLE EXPERIENCE IN THE CONTEXT OF THE FACT THAT THEY CAME IN AND SAID WANT TO FIX SOCIAL SECURITY. YEAH, WELL, WE CAN ONLY DO 8,000 CASES, YOU KNOW, A MONTH AND THEN THEY SAID WELL THAT'S BECAUSE THERE IS A MINE. AND THEY ARE LIKE WHAT DO YOU MEAN, WHAT DO YOU MEAN THERE IS A MINE? THEY THOUGHT IT WAS A SYMBOL FOR SOMETHING ELSE? NO, IT'S A LITERALLY MINE. THERE IS SO MUCH PAPERWORK OUR GOVERNMENT BOUGHT A MINE AND DOING EVERYTHING BY HAND. AND TO YOUR POINT, FAR FROM TAKING ANYTHING AWAY. THESE GUYS ARE GIVING OUR MONEY BACK. I MEAN, BRIAN, WE ARE REALLY CLOSE TO TAX DAY TO WHEN EVERYONE PAYS THEIR TAXES. THEY TAKE ALMOST HALF OF OUR MONEY. WHEN I SAW WHAT WAS GOING ON, THE AMOUNT OF WASTE, THE THINGS THAT THEY SAID THEY ARE FINDING A BILLION DOLLARS HERE, A BILLION DOLLARS, WE HEARD ABOUT THE $2 BILLION GOING TO STACEY ABRAMS. THIS IS SO INFURIATING. >> Brian: I THINK WHEN PEOPLE SAY THEY USING BUZZ TERMS IS HE GOING TO CUT YOUR SOCIAL SECURITY. NO, IS HE REFORMING SOCIAL SECURITY AND GET THE FRAUD OUT. I WANT TO SEE WHAT IS ACTUALLY IN OUR CUTS AND RESPOND AFTER. THE THING THAT STRUCK ME DEAD SERIOUS PEOPLE. NO INTEREST IN POLITICS. THEIR VERSION OF SERVICE. THAT RENTAL GUY AIRBNB GUY BILLIONAIRE. RUNS INTO ELON MUSK AT A PARTY. CAN YOU HELP US OUT? HE SAYS HOW. CAN YOU START REFORMING SOME EVER OUR SYSTEMS? LET ME GO TAKE A LOOK. THEY SEE SO MANY THINGS THAT ARE RIPE FOR REFORM. THE TERM THAT KEEPS ON JUMPING OUT IS CARE. IT'S ALMOST IMPOSSIBLE TO CARE ABOUT TAXPAYER MONEY LIKE YOU DO YOUR OWN. IT'S NOT REAL. WE DON'T KNOW WHAT WAS COMING IN, AND WE DON'T KNOW WHERE IT'S GOING. AND IT DOESN'T MATTER BECAUSE IT'S NOT THEIRS. LISTEN MORE OF WHAT THESE -- WHAT THE DOGE PEOPLE HAD TO SAY ABOUT THEIR APPROACH. >> THE SHEAR AMOUNT OF WASTE AND FRAUD IN THE GOVERNMENT. IT IS ASTONISHING. IT'S MIND-BLOWING. JUST WE ROUTINELY ENCOUNTER WASTE OF A BILLION DOLLARS OR MORE CASUALLY. >> FIRST THING THAT GOT ME REALLY EXCITED ABOUT DOGE WAS LEARNING, BASICALLY THE STATE OF GOVERNMENT COMPUTERS. BY SOME ESTIMATES, GOVERNMENT IT COST ABOUT $100 BILLION. AND IT'S FUNDING SYSTEMS THAT ARE OVER 50 YEARS OLD. >> THE AMOUNT OF ISSUES AT THE SOCIAL SECURITY SYSTEM ARE ENORMOUS. AS AN EXAMPLE. OVER 15 MILLION PEOPLE THAT ARE OVER THE AGE OF 120 THAT ARE MARKED AS ALIVE IN THE SOCIAL SECURITY SYSTEM. >> UNDER THE BIDEN ADMINISTRATION, THERE WAS NO DEPARTMENTAL OVERSIGHT WITHIN THE DEPARTMENT OF INTERIOR WHATSOEVER, NONE. WE ARE NOW REVIEWING EVERY SINGLE CONTRACT, EVERY SINGLE GRANT. >> THERE ARE, IN THE FEDERAL GOVERNMENT, AROUND 4.6 MILLION CREDIT CARDS FOR AROUND 2.3 TO 2.4 MILLION EMPLOYEES. THIS DOESN'T MAKE SENSE. >> Bret: RIGHT. >> SO ONE OF THE THINGS ALL OF THE TEAMS HAVE WORKED ON WE HAVE WORKED FOR THE AGENCIES AND SAID DO YOU NEED ALL OF THESE CREDIT CARDS? ARE THEY BEING USED? CAN YOU TELL US PHYSICALLY WHERE THEY ARE? >> Lawrence: SO THE MATH IS JUST NOT ADDING UP. AND YOU GOT THESE PEOPLE THAT ARE RESPECTED BUSINESS PEOPLE IN THEIR OWN RIGHT. THEY DON'T NEED THIS. I MEAN, THEY ARE NOT GETTING PAID THAT MUCH. THEY ARE SPENDING TIME AWAY FROM THEIR FAMILY AND THEIR OWN BUSINESS AND IT'S CAUSING ALL THESE ATTACKS ON TESLA AND THE CAR ITSELF DIDN'T DO ANYTHING. THE PEOPLE THAT ARE DRIVING THE CARS DIDN'T DO ANYTHING. HERE IS ELON MUSK ON THAT. >> WELL, I THINK A GREAT WRONG IS BEING DONE TO THE PEOPLE OF TESLA AND TO OUR CUSTOMERS. TESLA IS A PEACEFUL COMPANY THAT HAS MADE GREAT CARS, GREAT PRODUCTS, THAT'S WHAT IT'S DONE. IT HASN'T HARMED ANYONE. AND, YET, PEOPLE ARE COMMITTING VIOLENCE. THEY ARE FIRE BOMBING TESLA DEALERSHIPS. THEY'RE SHOOTING GUNS INTO STORES. THEY ARE THREATENING PEOPLE. YOU KNOW, THEY ARE ISSUING DEATH THREATS AGAINST ME AND OTHER TESLA PERSONNEL. WHAT ARE THEY DOING THIS FOR? WHY? WHAT'S HAPPENING, IT SEEMS TO ME IS THEY ARE BEING FED PROPAGANDA BY THE FAR LEFT. AND THEY BELIEVE IT. IT'S REALLY UNFORTUNATE. >> Brian: THEY ARE GETTING PAID TO DO IT AND MAKING ARRESTS. THE BUZZ TERM THAT DEMOCRATS HAVE BEEN SAYING THEY ARE CUTTING SOCIAL SECURITY AND MEDICARE. NO. ONE THING THAT TRULY STRUCK ME WHEN HE SAYS 40% OF THE CALLS INTO SOCIAL SECURITY. >> Lawrence: THIS IS INCREDIBLE. >> Brian: ARE PEOPLE TRYING TO CHANGE THEIR ACCOUNT TO DIRECT DEPOSIT. I THOUGHT HIS NEXT COMMENT WOULD BE BECAUSE IT'S SO COMPLICATED YOU SHOULD BE ABLE TO DO THIS ONLINE. IT'S FRAUDSTERS TRYING TO GET MR. AND MRS. JONES ACCOUNT. PRETENDING TO BE MR. AND MRS. JONES CAN YOU KEEP SIT HERE. OTHER PEOPLE FLATOUT FRAUD AND IT'S PROBABLY OTHER COUNTRIES. SO WHAT THEY ARE TRYING TO DO IS KEEP MORE MONEY IN SOCIAL SECURITY. GOING TO GO BANKRUPT IN 10 YEARS. EVERYBODY KNOWS IT. AND ALSO THE COMPUTER SYSTEM BE THAT WE'RE RUNNING ON. THE COMPUTERS CAN'T TALK TO EACH OTHER. >> Lawrence: ANCIENT. >> Brian: ALLOWED A 9-MONTH-OLD TO BE ABLE TO GET A SMALL BUSINESS LOAN. THEY USE THE I.D. BECAUSE THEY ARE FRAUDSTERS IN ORDER TO APPLY FOR A BUSINESS LOAN. IF THEY WERE HOOKED UP TO SOCIAL SECURITY THEY WOULD HAVE BEEN REGISTERED ON SOCIAL SECURITY. WOULD HAVE STOPPED IT. A 9-MONTH-OLD DOESN'T NEED A SMALL BUSINESS LOAN. GUYS COME IN PROBABLY FOR SMALL MONEY AND SIT THERE TRY TO TURN THE GHIEWRTS 2025 NOT 1932. INSTEAD OF BEING PRIDEFUL WHAT THEY'RE DOING NOT SEEING THEIR FAMILY AND FOUR KIDS. INSTEAD NOT TELL EVERYONE OR THEIR FAMILY WHAT THEY'RE DOING BECAUSE IT'S BEEN MISREPRESENTED. I DO BLAME THE ADMINISTRATION JUST A LITTLE BIT BECAUSE THESE GUYS DIDN'T WANT ANY FAME AND FORTUNE, ANY ATTENTION; THEREFORE, IT SOUNDS LIKE EVERYTHING WAS A SECRET. >> Lawrence: SECRET, YES. >> Rachel: THAT'S WHAT LAWRENCE WAS REFERRING TO. YOU SAW A COMBINATION OF BOTH FRAUD, MASSIVE, BILLIONS AND BILLIONS OF DOLLARS OF FRAUD. AND THEN INCOMPETENCE. YOU KNOW, USING SYSTEMS LIKE PUSHING PAPERWORK LIKE WE DID IN THE 1950s TO FILE CABINET AND MANILA FOLDERS. YOU SAW THAT. AGAIN, ELON MUSK TALKING ABOUT THE CARS. THERE IS NO ROOM FOR POLITICAL OR FOR POLITICAL VIOLENCE. >> Rachel: HE SAYS WE ARE A PEACEFUL COMPANY. WHAT THEY ARE MAD ABOUT FOR THE MOST PART IS THE FRAUD. THERE WAS A MONEY LAUNDERING SCHEME WHERE LIKE, FOR EXAMPLE, I'M GOING TO BRING UP THE STACEY ABRAMS. I THINK IT'S REALLY INSTRUCTIVE. >> Lawrence: $2 BILLION. >> Rachel: SHE HAD $100 AND SUDDENLY GETS INJECTION OF $2 BILLION. FOR WHAT? WHAT IS SHE DOING? HOW DID SHE DETECTIVE THAT? THIS HAS BEEN GOING ON FOR A LONG TIME. THEY'RE LAUNDERING MONEY. IF YOU WANT TO PROTEST TESLA. THERE ARE SOME REASONS TO PROTEST TESLA THAT ARE NOBLE. FOR EXAMPLE, I BELIEVE THESE ELECTRIC CARS MAKE US MORE DEPENDENT ON CHINA FOR ALL OF THESE MINERALS. YOU COULD TALK ABOUT THE COBALT MINES IN AFRICA THAT ARE NEEDED TO MAKE THESE BATTERIES WHERE 40,000 LITTLE KIDS ARE WORKING IN THESE MINES. THOSE ARE NOBLE REASONS TO OPPOSE TESLA OR THE ELECTRICIFICATION OF ALL OF THESE VEHICLES IN THIS MOVEMENT TOTALLY AMERICAN COMPANY. WE ARE FINDING OUT, TOO. WITH THE ARRESTS THAT THEY'RE HAVING LIKE THIS GUY PAUL KIM GOT HIT WITH ARSON AND DESTRUCTION OF PROPERTY, EXPLOSIVE DEVICE. THEY ARE GOING BACK TO COMMUNISTS AND PRO-PALESTINIAN MOVEMENT ALL WORKING TOGETHER. >> Lawrence: IT'S ALL WORKING TOGETHER. >> Brian: ELON MUSK KEEPS POINTING TO THE NGOs AND KEEP POINTING US SAYING THEY ARE MAKING SO MUCH MONEY THESE NGOs AND TAKING THEM DOWN. THEY ARE MAKING THEM VALIDATE THEIR EXISTENCE. THEY CAN'T DO IT. SO IT'S ALL COMING DOWN. WHEN YOU TAKE SOMETHING AWAY FROM PEOPLE THAT ARE CHEATING THE SYSTEM, THEY HAVE NOTHING TO LOSE. AND THAT'S WHAT WE'RE WITNESSING. I GOT TO GIVE MUSK SO MUCH CREDIT. HE JUST STARES STRAIGHT AHEAD AND KEEPS GOING. DOES A GREAT JOB OF MASKING HIS EMOTIONS HE ONLY OWNS 15% OF TESLA, PEOPLE. YOU ARE NOT HURTING HIM. YOU ARE HURTING DIFFERENT PENSION FUNDS AND FUNDS AROUND THE COUNTRY THAT LOOKED AT TESLA AS A SOLID INVESTMENT. NOW ALL OF A SUDDEN LOOKS LIKE NOT A SOLID INVESTMENT BECAUSE OF THE MASSIVE ATTACKS. NOW, SOME 18-YEAR-OLD WHO HAS AN ELECTRIC CAR IN A SENIOR YEAR IN HIGH SCHOOL THE PARENTS DON'T WANT TO LET HER TAKE IT TO SCHOOL BECAUSE IT COULD BE TARGETED ON THE STREETS BY SOME LUNATIC. >> Lawrence: IT'S STUPID BECAUSE TESLA HAS NOT TAKEN A POSITION. ELON. THEY KEEP COMPARING IT TO BUD LIGHT. FIRST OF ALL WE DIDN'T SAY THAT. WE DIDN'T SAY LIGHT BUD LIGHT ON FIRE. IT WAS THE COMPANY OF BUD LIGHT THAT TOOK THE POSITION. IT WASN'T THE OWNER OF IT DOING STUFF FOR THE GOVERNMENT. >> Rachel: I LOVE THAT BRIAN BROUGHT UP THE NGOs AGAIN. WHEN WE WERE ALL LOOKING AT THE BORDER, WHAT DID WE FIND AT THE BOTTOM OF IT, NGOs MAKING MONEY. >> Lawrence: THAT'S RIGHT. >> Rachel: CATHOLIC, LUTHERAN. >> Brian: CATHOLIC CHARITIES. >> Rachel: ALL OF THEM ON THE TEAM. >> Lawrence: DON'T 79 TO LET YOU IN. >> Rachel: NO TRANSPARENCY. WHETHER A THIS IS ABOUT AS YOU SAID IN THE INTRO, PULLING THE CURTAIN BACK AND LETTING PEOPLE LOOK IN AND DECIDING COME APRIL, WHEN YOU PAY YOUR TAXES, DO YOU WANT IT GOING TO THAT? I DON'T THINK SO. >> Brian: WONDERING IF THERE IS ANY REASONABLE DEMOCRATS GOING TO BE BROUGHT NO THIS PROCESS. LIKELY WHAT WE SAW WITH BRET, NO CAMERAS. GUYS, WHAT YOU ARE PROTESTING. WHAT YOU ARE SAYING ABOUT CUTTING SOCIAL SECURITY, IT'S JUST NOT TRUE. LOOK AT WHAT WE FOUND. I THINK THAT THERE IS REASONABLE PEOPLE OUT THERE. NOT CHUCK SCHUMER BECAUSE HE IS FIGHTING FOR HIS LIFE. LIKE RO KHANNA SUPPOSED TO BE ON TODAY BUT HE HAD A TRANSPORTATION ISSUE. HE HAS 20,000 PEOPLE IN HIS DISTRICT WORK FOR TESLA. AND ALSO HE KNOWS ELON MUSK FOR 30 YEARS. SO I'M CURIOUS TO SEE IF THERE IS SOMEBODY REASONABLE ON THE LEFT THAT THEY COULD START UNDERSTANDING WHAT THEY'RE PROTESTING AND WHAT THEY ARE BACK SOMETHING FRAUD. WHAT THEY'RE PROTESTING IS FINDING OUT ABOUT THAT FRAUD. I DARE YOU TO WATCH LAST NIGHT AND SEE POLITICS. AND I'M SURE WE'RE GOING -- I'M SURE IT'S ON FOXNEWS.COM. YOU CLICK "}, {"text": ". >> Bret: THANKS FOR HAVING US AND DOING THIS. I KNOW THERE'S A LOT OF INTEREST IN THIS. YOU KNOW, FIRST, LET ME START WITH YOU, ELON. WHAT ARE THE BUDGETARY SAVINGS GOALS AND HOW MUCH DO YOU THINK YOU HAVE ACHIEVED SO FAR? >> OUR GOAL IS TO REDUCE THE DEFICIT BY A TRILLION DOLLARS. SO, FROM A NOMINAL DEFICIT OF 2 TRILLION TO TRY TO CUT IT IN HALF TO 1 TRILLION. LOOKED AT IN TOTAL FEDERAL SPENDING TO DROP THE FEDERAL SPENDING FROM 7 TRILLION TO 6 TRILLION. WE WANT TO REDUCE THE SPENDING BY ELIMINATING WASTE AND FRAUD AND REDUCE THE SPENDING BY 15%. WHICH SEEMS REALLY QUITE OEA ACHIEVABLE. THE GOVERNMENT IS NOT EFFICIENT. AND THERE IS A LOT OF WASTE AND FRAUD. SO, WE FEEL CONFIDENT THAT A 15% REDUCTION CAN BE DONE WITHOUT AFFECTING ANY OF THE CRITICAL GOVERNMENT SERVICES. >> Bret: I WANT TO TALK. >> MAKING IT BETTER. >> Bret: TALK TO ALL THE GUYS HERE ABOUT SPECIFICS. BUT FOR YOU WHAT IS THE MOST ASTONISHING THING YOU FOUND OUT IN THIS PROCESS. >> THE SHEAR AMOUNT OF WASTE AND FRAUD IN THE GOVERNMENT. IT IS ASTONISHING. IT'S MIND-BLOWING. WE ROUTINELY ENCOUNTER WASTE OF A BILLION DOLLARS OR MORE. CASUALLY. YOU KNOW, FOR EXAMPLE, LIKE THE SIMPLE SURVEY THAT WAS -- LITERALLY 10-QUESTION SURVEY DO YOU U. DUE IT WITH SURVEY MONKEY $10,000. THE GOVERNMENT WAS BEING CHARGED ALMOST A BILLION DOLLARS FOR THAT. >> Bret: FOR JUST A SURVEY. >> FOR A BILLION DOLLARS FOR ONLINE SURVEY DO YOU LIKE THE NATIONAL PARK. WHAT HE WILL BE DONE WITH THAT SURVEY. SURVEY GOING TO NOTHING. >> Bret: YOU TECHNICALLY ARE A SPECIAL GOVERNMENT EMPLOYEE. YOU ARE SUPPOSED TO BE 130 DAYS. ARE YOU GOING TO CONTINUE PAST THAT OR DO YOU THINK THAT'S THE-WHAT YOU ARE GOING TO DO? >> I THINK WE WILL HAVE ACCOMPLISHED MOST OF THE WORK REQUIRED TO REDUCE THE DEFICIT BY A TRILLION DOLLARS WITHIN THAT TIME FRAME. >> Bret: SO, IN THAT TIME FRAME, 130 DAYS? >> YES. >> Bret: AND THE PROCESS IS A REPORT AT SOME POINT? 100 DAYS? >> NOT REALLY A REPORT. WE ARE CUTTING THE WASTE AND FRAUD IN REAL TIME. EVERY DAY THAT PASSES, OUR GOAL IS TO REDUCE THE WASTE AND FRAUD BY $4 BILLION A DAY EVERY DAY SEVEN DAYS A WEEK. SO FAR WE ARE SUCCEEDING. >> Bret: GOING TO TALK TO THE SPECIFICS, THERE OBVIOUSLY ARE DOGE CRITICS WHO ARE READING ALL KINDS OF STUFF, OBVIOUSLY LAWMAKERS ON THE OTHER SIDE OF THE AISLE ARE ATTACKING YOU. AND THEY CHARACTERIZE THE APPROACH AS. THIS FIRE READY AND THEN AIM. AND THEN HOW DO YOU APPROACH THAT? HOW DO YOU RESPOND TO THAT? >> WELL, I DO AGREE THAT WE ACTUALLY WANT TO BE CAREFUL IN THE CUTS. WE WANT TO MEASURE TWICE IF NOT TRIES AND CUT ONCE. AND ACTUALLY THAT IS OUR APPROACH. THEY MAY CHARACTERIZE IT AS SHOOTING FROM THE HIP, BUT IT IS ANYTHING BUT THAT. WHICH IS NOT TO SAY WE DON'T MAKE MISTAKES. IF WE WERE TO APPROACH THIS WITH THE STANDARD OF MAKING NO MISTAKES AT ALL, THAT WOULD BE LIKE SAYING SOMEONE IN BASEBALL IS GOING TO BAT 1,000. THAT'S IMPOSSIBLE. SO, WHEN WE DO MAKE MISTAKES. WE CORRECT THEM QUICKLY. AND WE MOVE ON. >> Bret: SOME PEOPLE SAY THIS SHOULDN'T TAKE A ROCKET SCIENTIST. STEVE DAVIS, YOU ARE A ROCKET SCIENTIST. >> USED TO BE. [LAUGHTER] >> Bret: NOW ESSENTIALLY YOU ARE THE CHIEF OPERATING OFFICER OF DOGE. DAY-TO-DAY OPERATIONS. FAIR TO SAY? >> YEAH. PART OF THE DOGE TEAM. >> Bret: SO HOW DID YOU END UP HERE? WHAT'S THE BIGGEST CHALLENGE YOU SEE? >> THE REASON I'M HERE, WHICH WHICH IS PROBABLY FOR MANY IS I THINK THE GOAL IS INCREDIBLY INSPIRING. I THINK MOST OF THE TAXPAYERS IN THE COUNTRY WOULD AGREE THAT IN ORDER TO HAVE AT COUNTRY GOING BANKRUPT WOULD BE VERY BAD THICK AND THEREFORE THE COUNTRY NOT GOING BANKRUPT IS A GOOD THING. THAT ALL OF US ARE WILLING TO KIND OF PUT OUR LIVES ON HOLD IN ORDER TO DO. THE THING THAT'S SPECIAL RIGHT NOW, WE ACTUALLY BELIEVE THERE IS A CHANCE TO SUCCEED. THAT THERE IS AN ADMINISTRATION THAT IS SUPPORTIVE AND A GREAT CABINET AND JUST A GREAT GROUP THAT WILL ACTUALLY MAKE SUCCESS A POSSIBLE OUTCOME. AND I THINK THAT'S GIVEN THE INSPIRING MISSION AND GIVEN THE NONZERO CHANCE OF SUCCESS IT WAS WORTH DOING. >> I WOULD LIKE TO REEMPHASIZE THAT POINT. THE SUCCESS OF DOGE IS ONLY POSSIBLE WITH PRESIDENT TRUMP AND WITH THE OUTSTANDING CABINET THAT HE SELECTED. IT WOULD BE IMPOSSIBLE WITHOUT THE SUPPORT OF THE PRESIDENT AND THE CABINET. >> Bret: BUT YOU ARE FINDING THE MONEY. I MEAN, IT'S BIG NUMBERS. RIGHT? >> YEAH. LIKE HE SAID THE MINIMUM IS OFF A BILLION DOLLARS. OVER $830 MILLION WHICH WAS THE ONLINE SURVEY. THAT'S AN ENORMOUS AMOUNT OF MONEY THAT WOULDN'T HAVE BEEN FOUND IF THE DOGE TEAM WASN'T WORKING WITH THAT IN THAT CASE THE DEPARTMENT OF INTERIOR AND TAKING IT ONE STEP FURTHER. DOGE PUBLISHES THESE THINGS ON OUR WEBSITE FOR MAXIMUM TRANSPARENCY. NOW THE GENERAL PUBLIC, IT WOULD HAVE BEEN IMPOSSIBLE FOR THE GENERAL PUBLIC TO HAVE SEEN THAT NOW ANYONE CAN JUST LOG INTO TO DOGE DOTTED GOV AND SEE THESE PAYMENTS. NOT YET IN REAL TIME, CLOSE, PROBABLY BE IN REAL TIME THE NEXT FEW WEEKS. >> Bret: THE PROCESS STILL INVOLVES CONGRESS, RIGHT? AT SOME LEVEL. >> WE TRY TO KEEP CONGRESS AS INFORMED AS POSSIBLE. THE LAW DOES SAY THAT MONEY NEEDS TO BE SPENT CORRECTLY IT. SHOULD NOT BE SPENT FRAUDULENTLY OR WASTEFULLY. IT'S NOT CONTRARY TO CONGRESS TO AVOID WASTE AND FRAUD. IT'S CONSISTENT WITH THE LAW AND CONSISTENT WITH CONGRESS. WE HAVE SEEN ACTUALLY GREAT SUPPORT, AT LEAST FROM THE REPUBLICAN SIDE OF THE HOUSE AND OCCASIONALLY SOME DEMOCRATS, TOO. YOU KNOW, IT'S NICE TO SEE PEOPLE CROSS THE AISLE ONCE IN A WHILE. BUT, USUALLY WHEN THEY ATTACK DOGE, THEY NEVER ATTACK ANY OF THE SPECIFICS. SO THEY WILL SAY WHAT WE'RE DOING IS SOMEHOW UNCONSTITUTIONAL OR ILLEGAL OR WHATEVER. WE ARE LIKE WELL, WHICH LANE LINE OF THE COST SAVINGS DO YOU DISAGREE WITH? AND THEY CAN'T POINT TO ANY. AND WE LIST THEM ALL ON DOGE.GOV. AND THE DOGE HANDLE ON X. AND YOU WILL SEE JUST OUTRAGEOUS THINGS. ONE OUTRAGEOUS THING AFTER ANOTHER. >> Bret: BESIDES ELON, YOU ARE ONE OF SEVERAL BILLIONAIRES HERE. CO-FOUNDER OF AIR B AND N AND YOU WANTED TO HELP OUT? I BUMPED INTO ANTHONY AND ELON IN FEBRUARY. A LINE DEALT WITH RETIREMENT. SOMEBODY TO HELP OUT TO FIX RETIREMENT IN THE GOVERNMENT. I LOVED THE CHALLENGE SO I JUMPED ON BOARD. IT TURNS OUT THERE IS ACTUALLY A MINE IN PENNSYLVANIA THAT HOUSES EVERY PAPER DOCUMENT FOR THE RETIREMENT PROCESS IN THE GOVERNMENT. NOW, PICTURE THIS. THIS GIANT CAVE HAS 22,000 FILING CABINETS STACKED 10 HIGH TO HOUSE 400 MILLION PIECES OF PAPER. IT'S A PROCESS THAT STARTED IN THE 1950s AND LARGELY HASN'T CHANGED IN THE LAST 70 YEARS. AND SO AS YOU DUG INTO IT, WE FOUND A RETIREMENT CASES THAT HAD SO MUCH PAPER THEY HAD TO FIT IT ON A SHIPPING PALLET. SO, THE PROCESS TAKES MANY MONTHS AND WE'RE GOING TO MAKE IT JUST MANY DAYS. >> Bret: WILL IT BE DIGITIZED? >> ONLINE DIGITAL PROCESS TAKE JUST A FEW DAYS AT MOST. IT'S AN INJUSTICE TO CIVIL SERVANTS WHO ARE SUBJECTED TO THESE PROCESSES THAT ARE OLDER THAN THE AGE OF HALF THE PEOPLE WATCHING YOUR SHOW TONIGHT. SO, WE REALLY BELIEVE THAT THE GOVERNMENT CAN HAVE AN APPLE STORE LIKE EXPERIENCE. BEAUTIFULLY DESIGNED. GREAT EASIER EXPERIENCE, MODERN SYSTEMS. >> Bret: RIGHT NOW, IT'S BY HAND? >> YES. THE RETIREMENT PROCESS A ALL BY PAPER. ESPECIALLY WITH PEOPLE CARRYING PAPER IN MANILA ENVELOPES INTO THIS GIGANTIC MINE. >> Bret: CAN'T RETIRE ABOUT A CERTAIN NUMBER EVERY MONTH. >> ABOUT 8,000 A MONTH. >> THE REASON WE DISCOVERED IT WELL, LET'S ENCOURAGE VOLUNTARY RETIREMENT. MOST THEY COULD DO IS 8,000 A MONTH. AND EVEN ALL CIRCUMSTANCES IT CAN TAKE 6 TO NINE MONTHS JUST TO HAVE YOUR RETIREMENT PAPERWORK PROCESSED AND OFTEN GET THE CALCULATIONS WRONG. WE ARE LIKE WHY WOULD IT TAKE SO LONG TO RETIRE? AND THEY'RE LIKE WELL, BECAUSE OF THE MINE. WHAT DO YOU MEAN THE MINE? WHAT'S THE MINE GOT TO DO WITH RETIRING. THAT'S WHERE WE DISCOVERED THAT ALL THE RETIREMENT STUFF IS STILL DONE BY PAPER IN A PROCESS THAT LOOKS IDENTICAL TO WHAT OCCURRED IN THE 1950s. I CAN TAKE A SNAPSHOT IN THE MINE WHEN IT FIRST STARTED IN THE 1950s TO TODAY AND IT LOOKS THE SAME. >> Bret: AMAZING. HOW LONG WILL IT TAKE TO TURN OVER. >> WE ARE WORKING AS QUICK AS WE CAN PROBABLY NEXT COUPLE MONTHS HAVE IT OVERHAULED. WHY ARE WE SUBJECTING OUR FEDERAL WORKERS TO PROCESSES THAT THEY ACTUALLY HAVE TO GO THROUGH A TRAINING JUST TO RETIRE FROM THE GOVERNMENT. WHOLE TRAINING PROGRAM THAT PEOPLE HAVE TO GO THROUGH IN ORDER TO RETIRE. I THINK WE CAN DO BETTER FOR THEM. >> Bret: AREM DOGE ENGINEER. YOU GO INTO THESE PLACES MORE THAN A DOZEN ENGINEERS. FIRST TO GO INTO THE AGENCIES AND VIEW THE COMPUTER DATA SETS. TELL ME WHAT YOU ARE FINDING AND FOR PEOPLE WHO DON'T UNDERSTAND HOW THAT PROCESS WORKS, EXPLAIN IT FOR THEM. >> YEAH. I WILL SAY THE FIRST THING THAT GOT ME REALLY EXCITED ABOUT DOGE WAS LEARNING BASICALLY THE STATE OF GOVERNMENT COMPUTERS. BY SOME ESTIMATES, GOVERNMENT IT COST ABOUT $100 BILLION. ITS FUNDING SYSTEMS THAT ARE OVER 50 YEARS OLD IN THE CASE OF SOMETHING LIKE SOCIAL SECURITY OR THE IRS. SO, REALLY CRITICAL SYSTEMS ARE OLD. THEY COST A LOT OF MONEY TO MAINTAIN. AND THEY COULD BE -- THE EFFORTS TO IMPROVE THEM ARE OFTEN VERY DELAYED. SO, I THOUGHT I'M A SOFTWARE ENGINEER. THAT MAYBE COULD MAKE A DIFFERENCE HERE. AND THAT'S REALLY WHAT INSPIRED ME AT A HIGH LEVEL. >> Bret: THERE IS A LOT OF MYSTERY ABOUT SOCIAL SECURITY AND WORDS ABOUT IT FROM -- HERE IS WHAT DEMOCRATS HAVE BEEN SAYING ABOUT IT. >> IT'S ABSURD THAT ELON MUSK IS TRYING TO ELIMINATE BILLIONS OF DOLLARS FROM SOCIAL SECURITY. >> ELON MUSK AND PRESIDENT TRUMP HAVE SET THEIR SITES ON CUTTING SOCIAL SECURITY. >> THEIR GOAL IS CLEAR. DESTROY SOCIAL SECURITY FROM WITHIN. >> Bret: YOU'RE IN THE BUILDING. I MEAN, YOU ARE IN THE COMPUTERS. WHAT IS HAPPENING THERE? WHAT ARE YOU DOING? >> YEAH. IT DOESN'T LINE UP WITH MY EXPERIENCE ON THE GROUND. AND I WILL SAY THE TWO IMPROVEMENTS THAT WE'RE TRYING TO MAKE TO SOCIAL SECURITY ARE HELPING PEOPLE THAT LEGITIMATELY GET BENEFITS, PROTECT THEM FROM FRAUD, THAT THEY EXPERIENCE EVERY DAY ON A ROUTINE BASIS, AND ALSO MAKE THE EXPERIENCE BETTER. AND I WILL GIVE YOU ONE EXAMPLE IS AT SOCIAL SECURITY, ONE OF THE FIRST THINGS WE LEARNED IS THAT THEY GET PHONE CALLS EVERY DAY OF PEOPLE TRYING TO CHANGE DIRECT DEPOSIT INFORMATION. SO, WHEN YOU WANT TO CHANGE YOUR BANK ACCOUNT, CAN YOU CALL SOCIAL SECURITY. WE LEARNED 40% OF THE PHONE CALLS THAT THEY GET ARE FROM FRAUD CENTERS. >> Bret: 40%? >> THAT'S RIGHT. ALMOST HALF. >> YES. AND THEY STEAL PEOPLE'S SOCIAL SECURITY IS WHAT HAPPENS. THEY CALL IN, THEY SAY THEY CLAIM TO BE A RETIREE. THEN THEY -- AND THEY CONVINCE THE SOCIAL SECURITY PERSON ON THE PHONE TO CHANGE WHERE THE MONEY IS FLOWING. IT ACTUALLY GOES TO SOME FRAUDSTER. AS IT IS HAPPENING ALL DAY EVERY DAY. AND THEN SOMEBODY DOESN'T RECEIVE THEIR SOCIAL SECURITY IT'S BECAUSE OF ALL THE FRAUD LOOPHOLES IN THE SOCIAL SECURITY SYSTEM. >> Bret: HOW DO YOU REASSURE PEOPLE THAT WHAT YOU ALL ARE DOING IS NOT GOING TO EFFECT THEIR BENEFITS? >> NO, IN FACT, WHAT WE'RE DOING WILL HELP THEIR BENEFITS. LEGITIMATE PEOPLE AS A RESULT OF THE WORK OF DOGE WILL RECEIVE MORE SOCIAL SECURITY, NOT LESS. I WANT TO EMPHASIZE THAT AS A RESULT OF THE WORK OF DOGE, LEGITIMATE RECIPIENTS OF SOCIAL SECURITY WILL RECEIVE MORE MONEY, NOT LESS MONEY. AND LET THE RECORD SHOW THAT I SAID THIS, AND IT CAN BE PROVEN OUT TO BE TRUE. LET'S CHECK BACK ON THIS IN THE FUTURE. >> \"THE WASHINGTON POST,\" THE SOCIAL SECURITY ADMINISTRATION WEBSITE CRASHED FOUR TIMES IN 10 DAYS THIS MONTH BECAUSE OF THE SERVERS WERE OVERLOADED BLOCKING MILLIONS OF RETIREES AND DISABLED VETERANS FROM LOGGING INTO THEIR ONLINE ACCOUNTS. FREAKED PEOPLE OUT. IS THAT GOING TO CHANGE. >> YES, WE ARE GOING TO MAKE SURE THAT THE WEBSITE STAYS ONLINE. >> Bret: BUT IS IT A RESULT OF GOING IN THERE OR SOMETHING YOU ARE DOING? >> NO. THE AMOUNT OF ISSUES THAT SOCIAL SECURITY SYSTEM ARE ENORMOUS. AS AN EXAMPLE, THERE ARE OVER 15 MILLION PEOPLE THAT ARE OVER THE AGE OF 120, THAT ARE MARKED AS ALIVE IN THE SOCIAL SECURITY SYSTEM. >> Bret: THAT'S AN ACCURATE FIGURE. >> CORRECT. CORRECT. THIS IS SOMETHING THAT HAS BEEN IDENTIFIED AS A PROBLEM. AGAIN, PRE-EXISTING PROBLEM SINCE 2008, AT LEAST, FROM AN IG REPORT. SO, THERE IS SOME GREAT PEOPLE WORKING AT THE SOCIAL SECURITY ADMINISTRATION THAT FOUND THIS, 2008, AND NOTHING WAS DONE. AND SO 15 TO 20 MILLION SOCIAL SECURITY NUMBERS THAT WERE CLEARLY FRAUDULENT WERE FLOATING AROUND, THAT CAN BE USED ONLY FOR BAD INTENTIONS. NO WAY TO USE THESE FOR GOOD INTENTIONS. ONE OF THE THINGS THE DOGE TEAM IS DOING IS CAREFULLY AND VERY METHODICALLY LOOKING AT THOSE AND MAKING SURE ANY FRAUDULENT ONES ARE ELIMINATED. >> Bret: BRAD SMITH WORKING AT HHS AND OBVIOUSLY ANOTHER ELEMENT IS MEDICARE AND MEDICAID. NIH, WHAT ARE YOU FINDING? >> YEAH. I WOULD SAY THERE IS A COUPLE THINGS WE'RE REALLY COMMITTED TO IN OUR WORK AT HHS. NUMBER ONE, MAKING SURE TO HAVE THE BEST BIOMEDICAL RESEARCH IN THE WORLD. MAKE BEING SURE THAT PRESIDENT TRUMP SAID OVER AND OVER AGAIN WE 100 PERCENT PROTECT MEDICARE AND MEDICAID. THERE IS A LOT OF OPPORTUNITY. IF I TAKE NIH AS AN EXAMPLE. TODAY IF YOU ARE NIH RESEARCHER AND GET $100 GRANT AT YOUR UNIVERSITY, TODAY YOU GET TO SPEND 60 OF THAT AND YOUR UNIVERSITY SPENDS 40 OF THAT. THE POLICY WE ARE PROPOSING TO MAKE YOU GETS TO SPEND 58 OF THAT AND YOUR UNIVERSITY SPENDS 15. THAT'S MORE MONEY GOING DIRECTLY TO THE SCIENTISTS WHO ARE DISCOVERING NEW CURES. ANOTHER EXAMPLE AT NIH IS TODAY THEY HAVE 27 DIFFERENT CENTERS. THEY GOT CREATED OVER TIME BY CONGRESS AND TYPICALLY BY DISEASE STATE OR BODY SYSTEM. THERE IS 700 DIFFERENT IT SYSTEMS TODAY AT NIH. >> Bret: 700 DIFFERENT IT SYSTEMS. >> SOFTWARE SYSTEMS THEY CAN'T SPEAK TO EACH OTHER. >> Bret: THEY DON'T TALK. >> 27 DIFFERENT C.I. Os. WHEN YOU TALK ABOUT MAKING GREAT MEDICINE CAD DISCOVERIES YOU HAVE TO CONNECT THE DATA. >> Bret: TIME-OUT YOU SAID 27 DIFFERENT CHIEF INFORMATION OFFICERS? >> CORRECT, CORRECT. >> MOST ARE NONTECHNICAL. >> Bret: THERE IS A LOT THERE. >> THERE IS A LOT OF OPPORTUNITY. IT WILL MAKE SCIENCE BETTER NOT WORSE. >> WHEN I SAY OUR JOB IS TECH SUPPORT, I REALLY MEAN IT. >> Bret: YEAH. >> WE HAVE TO FIX THE COMPUTERS. IF THE COMPUTERS CAN'T TALK TO EACH OTHER. YOU CAN'T GET RESEARCH DONE. IF THE COMPUTERS CAN'T STAY ONLINE, PEOPLE WON'T RECEIVE THEIR SOCIAL SECURITY. SO, WHAT WE HAVE HERE ARE A BUNCH OF FAILING COMPUTER SYSTEMS THAT ARE PREVENTING PEOPLE FROM RECEIVING THEIR BENEFITS THAT ARE PREVENTING PEOPLE FROM PREVENTING RESEARCH FROM HAPPENING EXTREMELY VULNERABLE TO FRAUD AND WE ARE FIXING IT. >> Bret: DOES THAT INCLUDE AI OR THE SYSTEM OVERALL? THAT'S WHAT PEOPLE ARE AFRAID OF. THEY DON'T KNOW WHAT THIS IS ALL LOOKING LIKE. IS IT GOING TO AFFECT ME IN THE LONG TERM? >> IT'S GOING TO EFFECT PEOPLE VERY POSITIVELY THE CHANGES WE ARE DOING HERE SOLVENCY OF THE GOVERNMENT OF THE UNITED STATES OF AMERICA. THIS IS WHAT WE ARE TRYING TO DO. ENSURE THAT PEOPLE DO RECEIVE THEIR BENEFITS IN THE FUTURE. AND YOU CAN ONLY RECEIVE YOUR BENEFITS IF THE COUNTRY IS OPERATING IN A HEALTHY AND COMPETENT WAY. >> Bret: UP NEXT, HOW THE DOGE TEAM PLANS TO STREAMLINE SOME FEDERAL JOBS AND AGENCIES. AND, LATER, ELON MUSK ANSWERS SOME OF YOUR QUESTIONS THAT YOU ASKED VI >> Bret: ANTHONY ARMSTRONG, DOGE OFFERS OF PERSONNEL MANAGEMENT, MORGAN STANLEY BANKER, MMA GUY. >> YEAH. >> Bret: YOU KNOW MONEY. THIS IS A LOT OF MONEY SLOSHING AROUND. >> THERE IS A LOT OF MONEY SLOSHING AROUND. IT'S A LOT OF MONEY SLOSHING OUT THE DOOR. IF YOU LOOK AT THE FEDERAL GOVERNMENT AND THE WAY THE WORKFORCE WORKS. IT'S REALLY A ONEWAY RATCHET. >> Bret: ONLY GOING UP. >> THAT LEAVES WITH YOU DUPLICATIVE FUNCTIONS AND LEADS LEAST WITH YOU OVERSTAFFING AND FUNCTIONS IN THE WRONG PLACES. A COUPLE OF EXAMPLES DUPLICATIVE FUNCTIONS BRAD MENTIONED 27 C.I. Os IF YOU KEPT GOING WITH BRAD HE WOULD TALK ABOUT THE COMMUNICATIONS OFFICE. GOT 40 DISTINCT COMMUNICATIONS OFFICES IN HHS. >> Bret: 40? >> YEAH. THAT'S NOT UNUSUAL BY THE WAY. MULTIPLE OFFICES LIKE THAT. >> DOES NOT MAKE ANYONE HEALTHY. >> MANY HARD-WORKING WELL-MEANING PEOPLE TOOK THESE JOBS. THESE JOBS WERE OUT THERE. THEY APPLIED FOR THEM, THEY TOOK THEM. THEY ARE DOING WHAT'S THERE. THEY ARE DUPLICATING THE EFFORT OF 40 OFFICES. SO YOU HAVE GOT THAT YOU HAVE OVERSTAFFING, A GOOD EXAMPLE OF OVERSTAFFING WOULD BE THE IRS HAS GOT 1400 PEOPLE WHO ARE DEDICATED TO PROVISIONING LAPTOPS AND CELL PHONES. JOIN THE IRS LAPTOP AND CELL PHONE PROVISIONED. IF EACH OF THOSE IRS OFFICERS OR EMPLOYEES PROVISIONED TWO EMPLOYEES PER DAY, YOU COULD PROVISION THE ENTIRE IRS IN A LITTLE MORE THAN A MONTH. SO 12 TIMES A YEAR. >> Bret: MAKE YOUR HEAD EXPLODE. >> ONLY JOB TO GIVE OUT LAPTOP AND A PHONE. >> WHOLE IRS COULD BE ONCE A MONTH. THAT DOESN'T MAKE ANY SENSE. AND PRESIDENT TRUMP HAS BEEN VERY CLEAR, SCALPEL AND NOT HATCHET. THAT'S THE WAY IT'S GETTING DONE. ONCE THOSE DECISIONS ARE MADE. THERE'S A VERY HEAVY FOCUS ON BEING GENEROUS, BEING CARING, BEING COMPASSIONATE, AND TREATING EVERYONE WITH DIGNITY AND RESPECT. IF YOU LOOK AT HOW PEOPLE HAVE STARTED TO LEAVE THE GOVERNMENT, IT IS LARGELY THROUGH VOLUNTARY MEANS. THERE IS VOLUNTARY EARLY RETIREMENT. VOLUNTARY SEPARATION PAYMENTS. WE PUT IN PLACE DEFERRED RESIGNATION THE 8 MONTH SEVERANCE PROGRAM. A VERY HEAVY BIAS TOWARDS PROGRAMS THAT ARE LONG-DATED THAT ARE GENEROUS THAT ALLOW PEOPLE TO EXIT AND GO GET A NEW JOB IN THE PRIVATE SECTOR. YOU HAVE HEARD A LOT OF -- A LOT OF NEWS ABOUT RIFTS. ABOUT PEOPLE GETTING FIRED. AT THIS MOMENT IN TIME, LESS THAN .15. NOT 1.5. LESS THAN 0.15 HAS BEEN GIVEN WRITTEN NOTICE. >> SELECTED. >> BASICALLY ALMOST NO ONE HAS GOTTEN FIRED IS WHAT WE'RE SAYING. >> TOM CRASS, WORKING AT TREASURY, YOU ARE HAVING ACCESS TO THE PAYMENT SYSTEM, OVERSEES ALL THE OUTGOING PAYMENTS. ESSENTIALLY THOSE PAYMENTS WERE GOING PLACES WHERE WE DIDN'T KNOW WHERE THEY WERE GOING, RIGHT? >> YEAH. UNFORTUNATELY THAT'S THE CASE, BRET. YOU KNOW, AS IN EXCFO OF A BIG PUBLIC TECH COMPANY, REALLY WHAT WE'RE DOING IS WE'RE APPLYING PUBLIC COMPANY STANDARDS TO THE FEDERAL GOVERNMENT. AND IT IS ALARMING HOW THE FINANCIAL OPERATIONS AND FINANCIAL MANAGEMENT IS SET UP TO DATED. THERE IS ACTUALLY ONLY ONE BANK ACCOUNT THAT IS USED TO DISPERSE ALL MONEY OF THE FEDERAL GOVERNMENT. >> Bret: TIME OUT ONE BANK ACCOUNT. >> IT'S A BIG ONE. A COUPLE WEEKS AGO HAD $800 BILLION IN IT. THE TREASURY WON'T COUNT. SO, WHEN YOU HEAR, YOU KNOW, SOME OF MY COLLEAGUES WHAT THEY'RE TALKING ABOUT IN TERMS OF THE FRAUD, YOU HAVE TO ASK WELL, WHY IS THIS ALLOWED TO HAPPEN AT A FINANCIAL LEVEL? WELL, IT'S ACTUALLY QUITE SIMPLE BUT ALARMING. THE TREASURY, UP UNTIL NOW AND THANKS TO PRESIDENT TRUMP, WE'RE FIXING THIS IVELGT IN FACT, THERE IS AN EXECUTIVE ORDER THAT HE JUST SIGNED THE OTHER DAY WHICH IS PROTECTING AMERICA'S BANK ACCOUNT BECAUSE IT REALLY IS THE TAXPAYERS' MONEY. ONE, WE ARE CHANGING THE CULTURE. THE CULTURE HAS BEEN NOT A LOT OF CARING AND NOT A LOT OF COMMITMENT TO DOING WHAT'S RIGHT. RELATIVE TO FINANCIAL OPERATIONS. THERE'S A $500 BILLION OF FRAUD EVERY YEAR. THERE IS HUNDREDS OF BILLIONS OF DOLLARS OF IMPROPER PAYMENTS. AND WE CAN'T PASS AN AUDIT. THE FINANCIAL REPORT IS PRODUCED BY TREASURY WE CANNOT PASS AN AUDIT. MATERIAL WEAKNESSES. IF I WAS A PUBLIC COMPANY CFO I WOULD EFFECTIVELY BE REMOVED. I COULDN'T FILE FINANCIAL STATEMENTS. I COULDN'T ISSUE SECURITIES. >> Bret: HAVE TO PASS AN AUDIT. >> THE FEDERAL GOVERNMENT CANNOT PASS AN AUDIT. IT'S IMPOSSIBLE. IN FACT, IN ORDER TO PASS AN AUDIT YOU NEED THE INFORMATION TO PASS AN AUDIT. YOU NEED TO HAVE THE PAYMENT CODES. YOU NEED HAVE THE PAYMENT EXPLANATION AND A PERSON YOU CAN CONTACT TO UNDERSTAND WHY THAT PAYMENT WAS MADE. NONE OF THOSE THINGS WERE MANDATORY UNTIL JUST RECENTLY JUST A FEW WEEKS AGO. IN FACT MAYBE LAST WEEK? >> YEAH. WE ARE SERVING 580 PLUS AGENCIES. UP UNTIL VERY RECENTLY, EFFECTIVELY THEY COULD SAY MAKE THE PAYMENT AND TREASURY JUST SENT IT OUT AS FAST AS POSSIBLE. NO VERIFICATION. AND SO WHAT WE'RE DOING IS WHAT ANY HOUSEHOLD WOULD DO. BUT, IMAGINE YOU ARE A HOUSEHOLD, YOU HAVE A BANK ACCOUNT. EVERYONE HAS AN ATM CARD CONNECTED TO THAT ACCOUNT. EVERYONE HAS A CHECKBOOK. NOT JUST YOUR CHILDREN. IT'S YOUR PARENTS, IN-LAWS, EXTENDED FAMILY. THEY CAN ALL GO TO THE ACCOUNT AND DISPERSE FUNDS NO. QUESTIONS ASKED NO. JUSTIFICATION, NO VERIFICATION. >> Bret: UP NEXT, THE DOGE TEAM TARGETS GOVERNMENT CONTRACTS AND WE'LL SHOW YOU WHAT THEY'RE FI TYLER, INTERIOR DEPARTMENT. YOU ARE A FORMER OIL COMPANY CEO. YOU ARE REVIEWING CONTRACTS BEFORE THEY'RE APPROVED FOR FUNDING. WHAT ARE YOU FINDING? >> WELL, ELON AND STEVE KIND OF STOLE MY THUNDER A LITTLE BIT. BUT I ACTUALLY FOUND THAT CUSTOMER SERVICE SURVEY CONTRACT. I ACTUALLY HAD AN EXAMPLE OF ONE RIGHT HERE. I COULD HAVE DONE THIS IN HIGH SCHOOL. [LAUGHTER] >> Bret: IS THAT RIGHT? >> IT'S THAT BAD. >> I FOUND IT ON THE WEEKENDS. BECAUSE UNDER THE BIDEN ADMINISTRATION, THERE WAS NO DEPARTMENTAL OVERSIGHT WITHIN THE DEPARTMENT OF INTERIOR WHATSOEVER, NONE. WE ARE NOW REVIEWING EVERY SINGLE CONTRACT, EVERY SINGLE GRANT AND WHEN THINGS DOM MY ATTENTION THAT DON'T MAKE SENSE. I AM BRINGING THEM TO SECRETARY ENTER GUM.  BURGUM. IS HE FANTASTIC AND WONDERFUL TO WORK WITH HIM. >> Bret: IS THE BATTLE BETWEEN GOVERNMENT OF DECADES AND DECADES OF BUILD-UP AND BUSINESS, WHICH YOU GUYS ARE, IS THAT LIKE A TRAIN HITTING EACH OTHER? I MEAN, IT SEEMS LIKE IT'S PRETTY DISRUPTIVE. >> WELL, THIS IS A REVOLUTION. AND I THINK IT MIGHT BE THE -- IT MIGHT BE THE BIGGEST REVOLUTION IN GOVERNMENT SINCE THE ORIGINAL REVOLUTION. BUT, AT THE END OF THE DAY, AMERICA IS GOING TO BE IN MUCH BETTER SHAPE, AMERICA WILL BE SOLVENT. THE CRITICAL PROGRAMS THAT PEOPLE DEPEND UPON WILL WORK. AND IT'S GOING TO BE A FANTASTIC FUTURE. AND BUT ARE WE GOING TO GET A LOT OF COMPLAINTS ALONG THE WAY? ABSOLUTELY. ONE OF THE THINGS I LEARNED AT PAYPAL, DO YOU KNOW WHO COMPLAINS THE LOUDEST AND WITH THE MOST AMOUNT OF FAKE, RIGHTEOUS INDIGNATION IN THE FRAUD CENTERS. THAT'S -- IT'S A TELL. LIKE THE $2 BILLION TO STACEY SY ABRAMS NGO DIDN'T EXIST AND $2 BILLION FROM THE FEDERAL GOVERNMENT. WHY? AND THERE ARE MANY SUCH CASES LIKE THAT. >> Bret: I THINK THAT MOST PEOPLE, COMMON SENSEWISE, WOULD SAY THE FRAUD HAS GOT TO END. >> YES. >> THEY ARE CONCERNED ABOUT THE 94-YEAR-OLD MOTHER WHO SKIPS A CHECK OR SOMEHOW DOESN'T GET WHAT SHE IS SUPPOSED TO GET. >> RIGHT. WHAT WE ARE TRYING TO SAY IS ACTUALLY THAT THE 94-YEAR-OLD GRANDMOTHER IS ACTUALLY AS A RESULT OF DOGE'S WORK GOING TO GET HER CHECK. SHE IS NOT GOING TO BE ROBBED BY FRAUDSTERS LIKE SHE IS GETTING ROBBED TODAY. AND THE SOLVE VENEZUELAY OF THE FEDERAL GOVERNMENT WILL ENSURE THAT SHE CONTINUES TO RECEIVE THOSE -- THE SOCIAL SECURITY CHECKS THAT MEDICARE CONTINUES TO WORK THE REASON WE ARE DOING THIS IF WE DON'T DO IT AMERICA IS GOING TO GO INSOLVENT. GOING TO GO BANKRUPT. AND NOBODY IS GOING TO GET ANYTHING. >> Bret: WHY ARE YOU GUYS ALL DOING IT? YOU CAN PIPE UP. YOU DON'T HAVE TO BE HERE, RIGHT? I MEAN, YOU DON'T HAVE TO BE DOING THIS. >> I BLESSED WITH FOUR BEAUTIFUL CHILDREN, MY WIFE AND I. BUT WE HAVE A REAL FISCAL CRISIS. AND, THIS IS NOT SUSTAINABLE, AND WHAT'S WORSE, BACK TO MY CHILDREN AND EVERYONE ELSE'S CHILDREN, WE ARE BURDENING THEM WITH THAT DEBT. AND IT'S ONLY GOING TO GROW. STEVE. >> Bret: THERE IS NOT A LOT OF HIERARCHY HERE. YOU ARE APPROACHING IT IN DIFFERENT SILOS, BUT WITH THE SAME KIND OF GOAL, RIGHT? I MEAN, THIS IS REALLY SILICON VALLEY PRIVATE SECTOR COLLIDING WITH GOVERNMENT. >> YEAH. EXACTLY. WE ARE HEADED IN A BAD PATH. THE CHANCE OF SUCCESS EXISTS AND THE ONE THAT IS IN OUR HEAD RIGHT NOW FAIRLY MUNDANE ONE BUT ILLUSTRATIVE IS CREDIT CARDS. THERE ARE IN THE FEDERAL GOVERNMENT AROUND 4.6 MILLION CREDIT CARDS FOR AROUND 2.3 TO 2.4 MILLION EMPLOYEES. THIS DOESN'T MAKE SENSE. >> Bret: RIGHT. >> SO ONE OF THE THINGS ALL OF THE TEAMS HAVE WORKED ON IS WE HAVE WORKED FOR THE AGENCIES AND SAID DO YOU NEED ALL OF THESE CREDIT CARDS? ARE THEY BEING USED? CAN YOU TELL US PHYSICALLY WHERE THEY ARE? >> Bret: I HOPE THEY ARE GETTING FREQUENT FLIER MILES. >> ACTUALLY, DIFFERENT NOTE, THE REWARDS PROGRAM THE FEDERAL GOVERNMENT HAS IS NOT VERY GOOD. THAT'S A WHOLE OTHER. >> Bret: THAT'S A NEGOTIATION. >> EXACTLY. SO FAR THE TEAMS HAVE WORKED TOGETHER AND THEY HAVE REDUCED IT FROM 4.6 MILLION TO 2.3 MILLION. SO,. >> WE'RE TAKING IT EASY. CLEARLY THAT SHOULD NOT BE -- SHOULD NOT BE MORE CREDIT CARDS THAN THERE ARE PEOPLE. >> Bret: MIDDLE LEVEL EMPLOYEES ARE THEY SEEING A BENEFIT TO BEING EMPOWERED BY TAKING OUT BUREAUCRACY? I MEAN. >> ABSOLUTELY, I MEAN, I THINK WHAT YOU ARE SEE SOMETHING TAKING THE BEST OF SILICON VALLEY THE BUSINESS WORLD AND BRINGING IT TO GOVERNMENT. BRINGING THE BEST PRACTICES AND BEST METHODOLOGIES AND PEOPLE ARE INSPIRED, RIGHT? ESPECIALLY ON RETIREMENT PROCESS SAYS I COULD SPEAK TO. THEY HAVE BEEN TRYING TO MODERNIZE AND GET OFF OF PAPER SINCE EARLY 22000S. VERY UNSUCCESSFULLY. EVERY ATTEMPT GONE OVER BUDGET AND BEEN CANCELED BECAUSE IT HASN'T BEEN SUCCESSFUL. I SHOWED UP AND FEEL LIKE I'M HERE IT'S AN INTERESTING PROBLEM. WE CAN USE DESIGN TO SOLVE IT AND GET ENGINEERING AND CREATE A BETTER EXPERIENCE FOR EVERYBODY. >> WE ARE TALKING ABOUT ELEMENTARY FINANCIAL CONTROLS THAT ARE NECESSARY FOR ANY COMPANY TO FUNCTION. SO, LIKE IF THESE -- IF THE FEDERAL GOVERNMENTS -- IF A COMMERCIAL COMPANY OPERATED THE WAY THE FEDERAL GOVERNMENT DOES, THEN IT WOULD BE -- IMMEDIATELY GO BANKRUPT. IT WOULD BE DELISTED. THE OFFICERS WOULD BE ARRESTED. THE CHANGES WE ARE PUTTING IN PLACE WILL ENABLE THE FEDERAL GOVERNMENT TO PASS AN AUDIT. IT WILL ENABLE TAXPAYERS TO KNOW WHERE THE MONEY IS GOING. KNOW >> THE WAYS THAT THE GOVERNMENT IS DEFRAUDED IS THAT THE COMPUTER SYSTEMS DON'T TALK TO EACH OTHER. IF THE COMPUTER SYSTEMS DON'T TALK TO EACH OTHER, THEN YOU CAN EXPLOIT THAT GAP. AND FRAUDSTERS EXPLOIT THAT GAP AND TAKE ADVANTAGE. FOR EXAMPLE THERE WERE $300 MILLION OF A SMALL BUSINESS ADMINISTRATION LOANS THAT HAS BEEN GIVEN OUT TO PEOPLE UNDER THE AGE OF 11. >> 300 MILLION UNDER THE AGE OF 11 AND OVER 300 MILLION UNDER THE AGE OF 20. >> Bret: DEFINITELY SMALL BUSINESS LOANS? >> YES. THE OLDEST AMERICAN IS 114. SAFE SO SAY IF THEIR AGE IS 115 OR ABOVE THEY ARE FAKE OR THEY SHOULD BE IN THE GUINNESS BOOK OF WORLD RECORDS. AND WE SHOULD NOT BE GIVING OUT LOANS TO BABIES. SO,. [LAUGHTER] THE YOUNGEST RECIPIENT OF A SMALL BUSINESS ADMINISTRATION LOAN IS A 9-MONTH-OLD-YEAR-OLD WHICH IS A VERY PRECOCIOUS BABY WE ARE TALKING ABOUT HERE. OBVIOUSLY JUST FRAUDULENT. AND THEY DO TERRIBLE THINGS. THEY ACTUALLY WILL SEE A KID HAS BEEN BORN. THEY WILL STEAL THAT KID'S SOCIAL SECURITY NUMBER AND TAKE OUT A LOAN AND LEAVE THAT KID WITH A BAD CREDIT RATING. LITERAL LAY BABY. TERRIBLE THINGS ARE BEING DONE IS WHAT WE'RE SEEING. WE ARE STOPPING THESE TERRIBLE THINGS. >> Bret: CAN YOU STOP IT. >> WE ARE STOPPING IT. ABSOLUTELY. >> THE REASON IT IS HAPPENING BECAUSE THE TWO SYSTEMS ARE NOT TALKING TOO EACH OTHER. >> YES. >> RIGHT? AND SO YOU DON'T KNOW AT THE SMALL BUSINESS ADMINISTRATION THAT YOU'RE GIVING A LOAN TO A 9-MONTH-OLD, WHICH HAPPENED IN ONE CASE, BECAUSE YOU ARE NOT CROSS-REFERENCING THAT WITH THE SOCIAL SECURITY ADMINISTRATION DATA THAT HAS BIRTH DATES. AND THERE WERE MULTIPLE SYSTEMS ACROSS THE GOVERNMENT WHERE THE SYSTEMS ARE NOT SPEAKING WITH ONE ANOTHER. AND IF YOU JUST SOLVE THAT SIMPLE PROBLEM, YOU WOULD SOLVE A HUGE AMOUNT OF FRAUD. >> ONE OF THE KEY TRICKS PULL THAT THEY WILL USE THE FACT THAT SOMEONE IS MARKED AS LIVE, AS LIVE AND SOCIAL SECURITY. AND THEN GET, UNEMPLOYMENT INSURANCE FOR A DEAD PERSON BECAUSE THE DATABASES DON'T TALK TO EACH OTHER. ALL THEY GOT WAS FROM SOCIAL SECURITY IS THIS PERSON ALIVE? YES. THEY ARE NOT ALIVE, THE PERSON IS POSSIBLY MARKED AS ALIVE IN SOCIAL SECURITY, BUT THAT FRAUDSTER CAN THOUGHT GET UNEMPLOYMENT AND DISABILITY FROM A DEAD PERSON. IT'S HAPPENING ALL THE TIME AT SCALE. >> Bret: ARE YOU SURPRISED AT SOME OF THE LEGAL EFFORTS AND SOME OF THE JUDGES THAT HAVE WEIGHED IN? THERE IS ABOUT 8 OR 10 NOW OF THESE CASES THAT ARE AT LEAST TEMPORARY HOLDS. THEY ARE BEING CHALLENGED BY THE DOJ. >> RIGHT. >> Bret: ARE YOU SURPRISED BY THAT PUSHBACK? >> WELL, IT'S -- THE D.C. CIRCUIT IS NOTORIOUS FOR HAVING A VERY FAR LEFT BIAS. AND WHEN YOU LOOK AT THE PEOPLE CLOSEST TO SOME OF THESE JUDGES, WHO ARE -- WHERE ARE THEY WORKING? ARE THEY WORKING AT THESE NGOs? THEY'RE THE ONES GETTING THIS MONEY. DOES THAT SEEM LIKE A SYSTEM THAT LACKS CORRUPTION? SOUNDS LIKE CORRUPTION TO ME. >> Bret: LAST THING. DO YOU GUYS ALL SEE THIS AS A PATRIOTIC DUTY? IS THAT REALLY WHAT THIS IS ABOUT? >> IT'S ESSENTIAL. >> I DO. 100 PERCENT. I WAS RUNNING FIVE BUSINESSES IN HOUSTON. AND I LEFT THAT. I LEFT GREAT PEOPLE TO DO THIS. AND MY WONDERFUL WIFE SAID GO FOR IT. AND HERE I AM. BUT I FEEL LIKE THIS IS ME GIVING BACK TO THE COUNTRY. .>> DID WE DON'T DO, THIS WE ARE SHRUNK. UNLESS THIS EXERCISE IS SUCCESSFUL, THE SHIP OF AMERICA WILL SINK. THAT'S WHY WE ARE DOING IT. >> Bret: GENTLEMEN, I REALLY APPRECIATE THE TIME TODAY. AND HOPEFULLY IT TOOK SOME OF THE MYTH AND MYSTERY OUT O. >> Bret: WE ASKED ON X YOUR PLATFORM. [LAUGHTER] HERE IS C. SPERLING, HE WRITES ARE THEY HAPPY AT THE SPEED IN WHICH THEY ARE MAKING CHANGES? ARE THERE ANY CHANGES THEY WOULD LIKE TO MAKE BUT HAVEN'T YET? >> WELL, I THINK IN THE CONTEXT OF THE GOVERNMENT WE ARE MOVING LIKE LIGHT ANY IN THE CONTEXT OF WHAT I'M USED TO MOVING IT'S SLOWER THAN WHAT I WOULD LIKE. SO, WHAT SEEMS LIKE INCREDIBLY FAST ACTION. SLOWER THAN I WOULD LIKE TO BE TOTALLY FRANK. BUT BUT WE ARE MAKING SOLID PROGRESS. VERY SORT OF PHONY PROBLEM, TOUGH -- REALLY IT'S KIND OF LIKE PAINFUL HOME WORM FRANKLY RECONCILING THE GOVERNMENT DATABASES TO ELIMINATE WASTE AND YOU FRAUD. THE DATABASES DON'T TALK TO EACH OTHER. THAT'S THE BIGGEST SOURCE FOR FRAUD IS THE FACT THAT THE DATABASES DON'T TALK TO EACH OTHER. IT'S FRANKLY PAINFUL HOMEWORK BUT IT HAS TO BE DONE AND WILL GREATLY INPROVE THE EFFICIENCY OF THE GOVERNMENT SYSTEMS. >> THE GOVERNMENT HASN'T PASSED AUDITS FOR A VERY LONG TIME. AS CRAZY IT SOUNDS THEY WILL LOSE 20 OR $30 BILLION A YEAR. THEY LITERALLY DON'T KNOW WHERE IT WENT. I MEAN, SENATOR COLLINS WAS TELLING ME ABOUT HOW SHE GAVE THE NAVY $12 BILLION FOR EXTRA SUBMARINES. GOT ZERO EXTRA SUBMARINES AND THEN WHEN SHE HELD A HEARING SAID WHERE DID THE $12 BILLION GO THEY DIDN'T KNOW. >> TALKING TO THOSE GUYS AND YOU HAVE A GREAT TEAM YOU DON'T HAVE TO BE HERE. VIOLENCE AND VANDALISM AT TESLA DEALERSHIPS. HOW DOES THAT AFFECT YOUR EMPLOYEES, YOUR CUSTOMERS? WHAT DOES IT MEAN TO YOU, LIKE HOW HAVE YOU TAKEN THAT IN? >> I THINK A GREAT WRONG IS BEING DONE TO THE PEOPLE AT TESLA AND TO YOUR CUSTOMERS. TESLA IS A PEACEFUL COMPANY THAT HAS MADE GREAT CARS, GREAT PRODUCTS. THAT'S ALL IT'S DONE. IT HASN'T HARMED ANYONE. AND YET PEOPLE ARE COMMITTING VIOLENCE. THEY ARE FIRE BOMBING TESLA DEALERSHIPS. THEY ARE SHOOTING GUNS INTO STORES. THEY ARE THREATENING PEOPLE. YOU KNOW, THEY ARE ISSUING DEATH THREATS AGAINST ME AND OTHER TESLA PERSONNEL. WHAT ARE THEY DOING THIS FOR? WHY? AND WHAT'S HAPPENING, IT SEEMS TO ME, IS THEY ARE BEING FED PROPAGANDA TO THE FAR LEFT. AND THEY BELIEVE IT. IT'S REALLY UNFORTUNATE. THE REAL PROBLEM IS NOT NOT LIKE THE CRAZY GUY THAT FIRE BOMBS A TESLA DEALERSHIP, IT'S THE PEOPLE PUSHING THE PROPAGANDA THAT CAUSE THAT GUY TO DO IT. GO AFTER THEM THE PRESIDENT IS CLEAR. ELECTRIC VEHICLES. SEE ON THE FAR LEFT SOME EFFORTS TO GO AFTER ELECTRIC VEHICLES IS QUITE SOMETHING? IT IS IRONIC. IT SEEMS LIKE THE MOST IRONIC OUTCOME IS THE MOST LIKELY. >> Bret: PERSONALLY IT'S GOT TO TAKE A TOLL. >> IT DOES. IT DOES. I THINK THERE IS SOME REAL EVIL OUT THERE. AND WE HAVE TO OVERCOME IT. >> Bret: I MEAN, YOU HAVE BEEN CALLED A NAZI, A WHITE SUPREMACIST, A FASCIST. >> I MEAN I GOT THE NORMAL PLAYBOOK. THEY I GUESS STILL NEED TO CALL ME STALIN, MUSSOLINI, YOU KNOW, WHATEVER. >> Bret: AND YOU ARE NOT. >> I MEAN, THEY CALLED THE PRESIDENT ALL THESE THINGS. I THINK AT ONE POINT, THERE WAS MAGAZINE COVER, WHICH SAID THE PRESIDENT WAS WORST THAN -- THAT PRESIDENT TRUMP WAS WORSE THAN HITLER, MUSE LENA AND STALIN COMBINED. AND THE PRESIDENT HASN'T KILLED ANYONE OWE HASN'T STARTED WARS, IS HE GOOD AT STOPPING WARS. THEY ARE PUSHING THESE LIES WHY DO THEY PUSH THESE LIES? I THINK WE NEED TO HOLD PEOPLE RESPONSIBLE FOR PUSHING THESE LIES. BECAUSE THOSE LIES ALMOST GOT THE PRESIDENT KILLED. >> Bret: WHAT'S SOMETHING THAT PEOPLE WOULDN'T KNOW ABOUT THE PRESIDENT YOU? ARE PRETTY CLOSE TO HIM NOW. YOU SPEND A LOT OF TIME WITH HIM. WHAT IS SOMETHING PEOPLE I THINK THE PRESIDENT IS A GOOD MAN, HUN NEXT MAN. AND I HAVE YET TO SEE HIM DO ANYTHING MEAN OR ANYTHING THAT IS WRONG. THAT I WOULD SAY MORALLY WRONG. NOT EVEN ONCE. >> Bret: A LOT IS COMING YOUR WAY, BUT SOMETIMES YOU SAY STUFF OR POST STUFF THAT GETS ATTENTION. YOU GIVE IT OUT, IN OTHER WORDS. DEMOCRATIC ARIZONA SENATOR MARK KELLY POSTED ON X ABOUT HIS TRIP TO UKRAINE, TO PUSH FOR CONTINUING TO SEND U.S. WEAPONS AND SUPPORT THERE. AND YOU POSTED THAT HE WAS A TRAITOR. WHY DO THAT? >> WELL, I THINK SOMEBODY SHOULD BE -- SHOULD CARE ABOUT THE INTEREST OF THE UNITED STATES ABOVE THE INTEREST OF ANOTHER COUNTRY. AND IF THEY DON'T, THEY ARE A TRAITOR. >> Bret: IS HE A DECORATED VETERAN, A FORMER ASTRONAUT A SITTING SENATOR. >> THAT DOESN'T MEAN IT'S FOR HIM TO PUT THE INTEREST OF ANOTHER COUNTRY ABOVE AMERICA. >> Bret: OBVIOUSLY THERE ARE SOME REPUBLICANS WHO THINK SUPPORTING UKRAINE IS THE RIGHT THING, STILL. BUT THERE IS A BATTLE BACK AND FORTH ABOUT HOW -- HOW DO YOU THINK IT COMES TO AN END? >> WELL, I THINK THERE WILL BE A NEGOTIATED PEACE AND THE THING THAT WE SHOULD BE CONCERNED ABOUT IS WE SHOULD THOUSANDS OF PEOPLE DYING EVERY DAY IN TRENCHES FOR NO MOVEMENT IN THE LINES. THE BORDERS HAVE REMAINED THE SAME THE PAST TWO YEARS. THOUSANDS OF PEOPLE HAVE DIED EVERY WEEK FOR NOTHING. FOR WHAT? AND I TAKE GREAT OFFENSE AT THOSE WHO -- THOSE WHO PUT THE APPEARANCE OF GOODNESS OVER THE REALITY OF IT VIRTUE SIGNAL AND CAN'T GIVE INTO RUSSIA BUT HAVE NO SOLUTION TO STOPPING THOUSANDS OF KIDS DYING EVERY DAY. THEY JUST WANT THAT TO CONTINUE FOREVER. I HAVE CONTEMPT FOR SUCH PEOPLE. I WANT TO MAKE THAT CLEAR. BECAUSE THEY ARE VIRTUE SIGNALING AND THEIR LACK OF A SOLUTION MEANS THAT KIDS DON'T HAVE A FATHER. IT MEANS THAT PARENTS LOST A SON. FOR WHAT? NOTHING. >> Bret: YOU ARE OPTIMISTIC THAT THE PRESIDENT'S PLAN MIGHT WORK?"}]