[{"text": "Hello, everybody! Welcome to Saiman Says! Almost new year and old look! Yes, I finally got rid of that yeeyee ass haircut. Maybe if you got rid of that old yeeyee ass haircut you got,\nyou'd get some b**ches on your ---- I haven't told Dark Saiman that I cut my hair yet. He used to apply gel and set his hair backwards. What about me? I used to get it in my mouth, right? So that's why I cut my hair and came here. That's enough now. Okay, let's start! Now see, I'm trying to be consistent, okay? But now, to be consistent, I have to forcefully outrage over every topic. And to be honest, I'm just chill guy. Do whatever you want with this. Go to hell! But then I have to pay rent for this studio every month. What kind of a system is this to pay rent? I don't like it. So, so basically, what I'm trying to say is that 'E-lafdas' are the most important part of our YouTube ecosystem. And that is why, on popular demand... Welcome back to Chai with Sai! Chai with Sai is my 'tea series'. In today's video, I'll be milking all the controversies, gossip,\nand 'tea' that we've had recently. And that too, with a strong and spicy tea. With the tea, today's snack is Bakharwadi. And crispy ladyfinger (bhendi)! Okay, so our first tea of the evening, Indian YouTubers sold out. Now, I know this topic is a bit old, but I have to talk about this. After all, I'm the only person who's qualified enough\nto give a professional opinion on this topic. MrBeast, Logan Paul, and KSI coming to India is a big deal for us. \"It's something to be very proud of!\" Okay, jokes aside, these three YouTubers,\nI think in my opinion, they are the OG YouTubers. They've been doing this for years. And they're an inspiration to a lot of creators. And they don't just do YouTube, they have a lot of other businesses as well. They're actually successful entrepreneurs. They say, they've broken the 'mould' of being a YouTuber. And then they added that 'mould' into their products. Opinion on lunchly? \nYeah, I only found out about it yesterday. Like, you should not feed your kids that garbage. Like, what the f**k? If I go into the list of controversies about them and their products, before it ends, they'll do two more controversies. Their business was declining in foreign countries. So, this 'Beast India Company' came to India to do business. It's okay that they met Indian YouTubers. But what was the need to promote their products for free? Bro, this is a very random picture. They said, will you hold the feastables? I said, I'll hold it. Someone will hold the Prime, someone will hold the feastables. I don't want it, bro. I don't want money for everything, bro. I respect you, I adore you, out of my love and out of my courtesy. Okay, so whatever they got, they took it. Everyone wanted MrBeast's 'feastable'. And this prime. Prime has so much caffeine that it is\nnot recommended for children below 18 years of age. So, 90% of their audience ended up there. When they came to India, KSI performed their critically acclaimed song on stage. From the street to the ring, to the pen, to the king. But all of this is still fine. I was thinking, why didn't CarryMinati sing his song in front of them? Okay, I'll not tell you anything. You'll just watch, okay? Okay. Your childish acts will drown you. T-Series company will defeat you. One day, India will rule the world. First of all, they'll teach you how to wash. They'll slap you on your fair cheeks. Then you'll understand our language. Oh, God! I'm like, yeah, I'm... Oh, my God! If you ask me, this is the real controversy. CarryMinati is collaborating with MrBeast. And MrBeast is collaborating with T-Series. And who's the traitor? Me. I'm sorry, I can never trust this MrEast. I can never trust him. His content is more processed than the processed food in Lunchlee. Every 2 seconds of his videos, there's an edit, an effect, a text. And then the worst part is that all the YouTubers will copy his style. It's not wrong to copy, bro. His editing style has spread ADED in the entire YouTube industry. Attention Deficit Editing Disorder. And his personality is more AI-generated than his thumbnail. My fans love to see me suffer. So I just do things that make me miserable. And they find it funny. Wow! So... It's crazy. So that's the video she was saying was her favorite. What did you say the hardest is, Tyler? Yeah, Solitary. And looking at his smile, I feel a little uncomfortable. I think he's dead inside after doing these Buried Alive challenges. More than this, the body Logan Paul showed in Japan was alive. Now look, our influencers do hooliganism, market, promote gambling apps. But at least they don't do scams. Very proud of you. You must have seen that there's a trend of racism on social media against Indians. They call us a lot of things. They call us scammers. But allegedly, most of the scams are done by their influencers. Especially crypto scams. And since Bitcoin is trending again, it's important to stay away from crypto scams. And that is why for your crypto investments, you need a safe and secure platform. And for that, you need Coinswitch. Coinswitch is one of the biggest crypto exchanges in India. In this, you can invest in crypto. But now you can also trade in crypto futures. With the lowest fees, 350 plus contracts. And up to 25 times leverage. And if you're new to future trading, then you'll get a 100% fee rebate for the first 15 days. So don't worry, you'll save your fees. And you have to admit that Coinswitch's smart investment feature is very smart. You just have to invest your money and it will automatically grow with assured profits. And Coinswitch is also giving 1% cashback. And zero trading fees for the first 30 days. Coinswitch is recognized by the Financial Intelligence Unit of India. More than 2 crore users trust this platform. And Coinswitch maintains its proof of reserves which shows its strong financial health. So go and download Coinswitch right now. Link is in the description. Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. And yes, before investing in any crypto, do your own research. Don't get influenced by any influencer. You should also try paneer with tea, right? Okay, moving on to the next topic. Ashneer Grover roasted by Salman Khan. Hmm. Despite being a shark, Ashneer Grover did not realize that there is always a bigger fish. And this is not a fish, this is a tiger. Now I'm not a fan of Salman Khan, but I'm enjoying his roasting track record. Ashneer Grover was offended by Ashish Solanki's roast. But this shark turned into a poplet in front of Salman Khan. But it's okay, everyone has ups and downs in life. You just have to learn from your mistakes. I'm sure Ashneer will learn something from this failure. And I genuinely tell you, failure teaches you nothing. A lot of people give knowledge that I failed, but I learned a lot. Hey, you learned an hour. In my phases of failure, I've learnt nothing, zero. Or maybe not. Ever since the people of India kicked Ashneer's ass on his phone after hearing the leaked conversation. Ever since then, Ashneer has been doing a full-time job of becoming a Sigma male on social media. But now that his duality has been exposed, I think it is safe to say that it's Grover. And to be honest, I already knew that his attitude is just a show-off. He's not a grower, he's a show-er. And talking about show-er, someone who cannot accept that his show is over is Mukesh Khanna. Oi, just keep quiet. The Shaktimaan situation is not crazy, Shaktimaan is crazy. I think this whole situation is a marketing strategy for Shaktimaan's sequel. And he's not the real Shaktimaan. He's a clone of Shaktimaan made by Dr. Jackal. Oi, just keep quiet. Now I'm not Shaktimaan, I'm Shaitaan. I think this is the only explanation that makes sense. Otherwise, why would anyone do this to their own legacy? A woman's job is to take care of the house. Which, pardon me, I do say sometimes. Where did the problem of Me Too start? When even women started working. The situation is sad, I'll just say this to Mukesh Khanna. You either die a hero, or you live long enough to see someone else become the hero. I'm not going to play Saiman forever. At some point, I'll have to recast Saiman as well. It's okay, life goes on. Just chill a little, Mukeshji. Watch TV, play video games. I think you should try getting over it. Okay, our next topic is Abhinav Arora. He's banning social media for kids in Australia. And here, we're doing child labour in content creation as well. We're giving milk to kids at the age at which they should be given milk. Obviously, it's not the kid's fault. It's his parents' fault. Abhinav's dad is an entrepreneur. These days, Dhoongi Babas are trending a lot on social media. So, taking advantage of the market, Abhinav's dad launched his product. But unfortunately, Abhinav's dad forgot to delete his history. Then what? He lost his reputation. He's such a stupid guy. I don't know what to say. I'll just agree with Shaktimaan on this one thing. Okay, today's next news. Layers Anarch, not so smart watch. Now, I'll be honest. I was looking forward to this watch. Because I liked the design of this watch. But then I saw the reviews. This is an anarch. Look, I'm not a tech YouTuber. I don't know how to read the specs written on the back of the box. What should I do? But the 2-4 good tech reviewers have put the tech burner on the burner. So, I don't need to say much. I just found it fishy that during the marketing of the product, they were trying to sell an emotional story more than its features. Yes, I understood. You worked very hard. But you weren't doing charity. You were doing all this to fill your own pockets. And the funniest thing is that his marketing strategist thinks that he has shot a big arrow. No, you played yourself. The result of playing with emotions was seen on the play store. Got insane response. The hype was unreal. We built something interesting. We built unreal hype. I think you should have just built a better watch. That would have been a better marketing strategy. I think if this watch was worth 3-4 thousand, then you wouldn't have got so much backlash. Right now, it's just overcharged in more ways than one. A reviewer had made a very harsh review on this watch. And then the tech burner sent him a legal notice. He won't even get a place in Anarch. But okay, what else should I say? It's okay, at least it's not a wallpaper app. It's time for the last Lafda of the day. Elvish Yadav vs Slaypoint. When I heard about this Lafda for the first time, I understood that Elvish is overreacting. Otherwise, who gets offended by Slaypoint's roast? Slaypoint had uploaded a 14-minute roast video last week. And in that, they only edited Elvish for a minute. And Elvish got offended by it. These people enjoy calling black a black, and fat a fat. But if they call a goon a goon, then they get offended. Now Elvish got offended, but he can't admit that he got offended. So he played the mom card. The same card he played to win Bigg Boss. He hid behind his mom like a little kid. He tried to spread the narrative that Slaypoint roasted his mom. Which is not true. Slaypoint didn't say anything about his mom. See, to stay relevant, Elvish had to do controversy every 2-3 months. Because he doesn't have any other content. He saw that his views were decreasing. And then he decided to do controversy. So then Elvish ordered his IT cell to go below the belt against Slaypoint. If he wanted to show them what below the belt looks like, then he should have uploaded his own photo. But anyway, in just a few hours, useless trends start on Twitter. As expected, Slaypoint gets abused a lot. And especially for Gautami, vulgar comments start coming. And the worst part is that Gautami's fake morphed photos start getting shared. As a professional YouTuber, Elvish got his PR done through news articles. In Elvish's support, I got a lot of news articles. But the harassment his fans did, I didn't get a single article on it. After that, he got his PR activated. He takes the entire PR team with him. He thinks he knows everything. Now all these things have a system. All these things happen in a systematic manner. It's actually an IT cell. Otherwise, in just a few hours, such trends don't get created. They have groups on Instagram and Telegram where they get orders. There they get hashtags, captions, photos, everything. And then they log in to their fake accounts and start working. So what I'm trying to say is that Slaypoint, especially Gautami, who had to face harassment, Elvish is directly responsible for that. After getting a hair transplant, promoting Adivasi hair oil, Elvish can fool his own audience. But not anyone else. It's good to see that people are trolling him in his own comment section. But unfortunately, people will forget this situation Elvish will keep getting offers from useless people. Brands will keep sponsoring him. His business will continue as it was. That's it for today. Thank you for watching. Goodnight. Shabba Khair. Khailash Khair. Wish you a happy married life."}, {"text": "\"So many lies to go.\" \"Let's talk about my connections with AAP.\" \"The favourite conspiracy of these pro-BJP YouTubers.\" \"You hate it because though you talk about Lord Ram, you harbour Nathuram in your heart.\" \"Posham Pa, brother, Posham Pa, What happened in the Red Fort? Stole a watch of ₹100, Will have to be jailed now.\" Hello, friends! In the Hisar district of Haryana,\nthere is a village called Rakhigarhi. After some excavations here, we found out about a 7,000 to 8,000\nyear old civilisation that lived here. But amazingly, that civilisation hasn't\nreached Elvish Yadav yet. Because this fool\nis still uncivilised. Using vile language,\nbeating up people, spreading hatred,\nabusing intoxicants, getting youth addicted to\nbetting, objectifying girls, these are his daily activities. And when his cringe\ncontent doesn't get views, then he makes videos on\nDhruv Rathee occasionally. This is the ninja technique\nof these shallow YouTubers. I think such YouTubers should\nbe exposed in front of the public. So that people know, that if they follow\nsuch YouTubers, they are following idiots. Although it's a\ndifferent matter that these YouTubers don't care because shameless\npeople like Elvish believe that even bad publicity is good publicity. \"It was good and bad.\" \"What was bad in it?\" \"People were making\nmemes and mocking.\" \"That's good, you\ngot some publicity.\" After the last video, some\nof you were asking me why am I wasting time by\nmaking videos on this one person. The thing is that, friends, it isn't just about\nthis one person. Every thing wrong\nin our society, I believe that one\npersonality like Elvish Yadav's, is the personification\nof those wrong things. Such people have become a\nthreat to our society and our country. And if we can bring a\npositive change to this person, we will see its effect on\nmillions of other people. So, in the first half of this video,\nlet's catch some more of his lies, and in the second half, let's start trying to make\nhim a better person. \"Use your brains a little, the video isn't over yet. There's so much left. I don't know how long this video is, but there's so much more to come, there are so many points.\" In the last video, his stupidity counter\nwas at 9, so let's continue from there. Elvish says that, in\nmy Telegram group, I shared p0rnographic content. \"Dhruv who talks about ethics, used to share p0rnographic\ncontent in his Telegram group.\" \"Because of this,\nTelegram banned his group.\" Look Elvish, every\nperson has something here, its called the Brain. Had you used\nyours even a little bit, you would ask yourself why would I want to share p0rnographic content\nin my Telegram group? What would I get by doing this? Obviously, this is a lie and I have never done this. A few years ago, there was\na common bug on Telegram. Search on Google for\n'Telegram p0rnographic bug' and you will find\nmany people on Reddit complaining about this. About what was happening, when they did\nnothing of the sort. Anyways, Elvish then\ntalks about my team. He says that there are\n3 people on my team. \"He has Vijeta Dahiya\nwrite videos for him. He is a movie director. And his team includes Rahul, Akshay, and Manav. I have talked about\nthis in many interviews. And I have said the\nsame thing every time. There are 10-15\npeople in my team. One needs basic literacy, he could have watched at least one\ninterview before making a video on me. \"How big is your team?\" \"How many people are in it? 50? 100?\" \"No, not 50 or 100, \nthere are 10 people.\" \"I'd say there are about 10-11 people.\" On top of that, do you know how to\ncount or do I need to teach that too? Because first, you said that I have a researcher, Vijeta, then, he claims that I have\nthree people in my team, Rahul, Akshay, and Manav. So, doesn't this\nbecome 3 + 1 = 4? At least, count properly. \"If you need more\nnews about your team, do let me know.\" Well, let's talk\nabout news later, first, start learning\nhow to count 1, 2, 3... You can use your fingers. 1, 2, 3, 4... Children find it easier\nto count like this. \"And the best part was the names that he sharing as my team members, they're incorrect.\" Moving forward,\nElvish claimed that I promoted a fake\ncryptocurrency coin. \"He doesn't even know\nthe C of Cryptocurrency, despite that, he\nhad people invest in a scam crypto.\" Let's clear this up as well. This is from 3 years ago, in October 2021, when I got an email from\nthis company for a promotion. As you can see on the screen this was my reply\nto this offer email. I wrote that I want to know\nabout the investors of this project. I asked for their details. And I specifically\nasked for clarification that there are no Chinese\ninvestments in this. Because I don't promote\nChinese companies. Then, I asked them to call me. And the CEO\nspoke to me directly. They showed the\ndocuments and reassured me that the product I was\nsupposed to be promoting was genuine. And as proof, they presented their\nadvertorials in newspapers like the Economic Times, Money\nControl, and NDTV Profit. Third, this promotion\noffer came from an agency whose co-founder is one of the\nmost popular YouTubers in India. It is an established agency with which all\nYouTubers work regularly. So, that increased my\nlevel of reassurance too. But the thing is, friends, that I am a human being. I am a biological human being. I don't have any divine\nenergy coursing through me, for me to be all-knowing\nand allowing me to know the future of any company. This is the same as Shahrukh Khan and Amitabh\nBachchan doing an ad for Everest spices. And later, when\nthe news breaks that these spices contain\ncancerous chemicals, you ask Shahrukh Khan\nand Amitabh Bachchan about why they did the ad. We, normal biological\nhuman beings, unfortunately, don't have\nthe ability to see the future. But when I felt that\nsomething was wrong, I removed this ad, removed the links from my videos and set a new\nstandard for myself. After this, I told myself that I will not promote any\ncryptocurrency company and I have not\ndone it since then. It's almost 3 years since then. The companies I promote and the ones I don't I can openly tell you my\nstandards regarding this. First, I have not promoted any\nbetting, gambling, or fantasy app, because I don't want\nthe youth of our country to get addicted to gambling. These betting apps waste the\ntime and money of millions of youths. But the bigger loss is their\nmental frame getting disturbed. Second, I have not promoted\nany tobacco products or cigarettes. Third, I have not promote\nany Chinese company. Fourth, I haven't promoted any\nfast food or soft drink company because they have a harmful\nimpact on people's health. I know that millions\nof people follow me. And in any sense, in any aspect, I don't want to be a bad influence\non even one person out of the millions. I want more influencers,\nactors, and YouTubers to be influenced by me\nand set the same standards so that we can have a\npositive impact on society. But people like Elvish are at the\nother extreme of this spectrum, who will promote any harmful\nsubstance if they are paid enough. \"If someone asks for your opinion\non World T20 Championship, don't share your\nopinions with them. Share them on this app. To win a lot.\" The companies that\nElvish is promoting, exactly these companies have\nrepeatedly approached me for promotions. They have offered\nme up to ₹2 million. But I can't sell my conscience. I have explained this\nin detail in this video. If you haven't seen it, the link is in the description. And Elvish, I have talked about\nthis in my YouTube course too. I noticed that you didn't\ntake the course even after giving you a\nspecial discount last time. Well, let's do this, let's give\nyou some more discount. Now instead of ELVISH40 use the coupon code ELVISH420 You will not get\n420% off with this because it's not\nmathematically possible. But I don't need\nto go into maths, because you won't get it. But you will get 42%\noff with this coupon code. This is a good\nopportunity for you and friends, if you\nare also interested, it is a good\nopportunity for you too. I would like to show you\nsome reviews of the people who have taken\nthis course so far. Their feedback\nhas been splendid. \"I finished the course today. I loved it. I learned so many things is it, like, ideas for niche topics.\" \"All the aspects that can be there for a YouTuber are there, in terms of how to grow, how to earn,\nwhat are the stresses, what are the challenges.\" \"And the best part was you have collected your life journey in this course, the examples you used were your own.\" \"You are among the best in the business. Which is why I decided to learn \nfrom a young teacher like you.\" \"I don't think that after buying this course I will need any other course.\" \"I learned one thing from this course, which confused me for years. First of all, the niche,\nsecond, how to do everything.\" \"I loved the KineMaster hack you shared.\" This is probably the first\ndetailed course in the country that teaches you step-by-step how you can make YouTube\nyour part-time job or full-time career. In this, everything from 0-100\nhas been taught about this career and you will be given\nspecific examples of 20 niches, of fields in which I think one can\ncreate a successful YouTube channel. And presently, there are no major\nYouTube channels in those fields. So, if you are interested, you can scan this QR code or you can find the link\nin the description below. And the coupon code is ELVISH420 Coming back to the topic, Elvish is trying to make a new\nconspiracy about my relationship with DW. \"There was a collab between\nDW and Dhruv Rathee. For those who don't know DW, there was a video on DW, a documentary, in which they show how the Hindus in India attack Muslims...\" \"And as many news portals do, showing only one\nside of the story, similarly, DW showed\nonly one side of the story.\" If you choose to ignore the\nother side, how will you find it? He shows the\nthumbnail of one video to show that DW always\nmakes videos criticising Modi. I can use 2\nthumbnails to show that DW always makes\nvideos in Modi's favour. \"It shows a\njournalist, Irfan Mehra, he works for DW.\" Once again, the illiterate Elvish\ncouldn't read the name properly. His name is not Irfan Mehra, it is Irfan Mehraj. There's a 'J' at the end. Throughout the entire video,\nhe keeps talking about \"Mehra.\" \"It's all the same,\nDhruv, it's all the same.\" It's not the same, Elvish. Everything cannot be the same. \"Do you know whom he works for? He works for DW, TRT, The Arab, ...The Arab...\" There is no media house \ncalled The Arab in the world. Maybe he wanted to\nsay The New Arab here. But no worries. When a person is so illiterate, there are mistakes\nin every sentence. \"To spread propaganda\nagainst India, Turkish Intelligence Agency and\nPakistan's Intelligence Agency ISI, came together and founded TRT.\" Good God! Once again this illiterate\nElvish couldn't read. I seriously doubt whether he\ngraduated high school or not. Because nowhere is this\nmentioned in the article he has shown behind him. That ISI was a founding\nmember of Turkey's TRT World. The article claims that Turkey Intelligence\nAgency and ISI together were starting a propaganda team through TRT World. They weren't forming\nthe TRT World. Of course, it's a\ndifferent issue that this article was also fake hosted by a biased and\nuntrustworthy website supporting BJP. But we will talk about\nit in another video or else this video\nwill be too long. \"To spread anti-India\npropoganda. ...propoganda...\" It's not propoganda,\nElvish, it is propaganda. \"Last year, NIA had\narrested Irfan Mehra because of his links with\nterr0rist organisations. Organisations\nlike Al-Qa*da, etc. he was working with them.\" What kind of nonsense are you\nspewing by involving Al-Qa*da? No, Irfan Mehraj was\nnever working with Al-Qa*da. In fact, Irfan Mehraj's\narrest by the NIA has been labelled\npolitically motivated by many international groups. He has been arrested under UAPA. An arrest whose conviction\nhas not been proven yet. International Human Rights\nWatch has also said that the Indian government\nshould release him immediately. And that it's a wrongful arrest. And speaking of arrests, Elvish, a few months ago you were\ncrying when you were arrested, saying that the media is\nspreading false news against you and here you are,\ndoing the same thing. I don't know about\nthis snake venom case or this pot stealing case, and how true they are. That will be\nproven in the court. But if there was a fake\ncase filed against you and the police arrest you, you won't get to cry again, because no Human Rights\nWatch might come to save you. Even the right-wing media\ndoesn't play news in your favour. \"Media isn't loyal to anyone.\" That's why, remember the saying, those living in glass houses, shouldn't throw\nstones at others. The problem is that you can't understand\nother people's problems. You just know\nhow to roast others, how to declare\nthem anti-national. But if it starts\nhappening to you, you start crying. Friends, the most weird part is the way he was trying\nto link all of it to me. He claims that since Irfan\nMehraj wrote articles for DW, and I make travel videos for DW, we are connected. Let me know if this\nmakes any sense to you. You went on Bigg Boss, Dolly Bindra went\non Bigg Boss too, by your logic, Dolly Bindra and you\nmust be best friends. Now, let's come to my Aam\nAadmi Party connections. The favourite conspiracy\nof these pro-BJP YouTubers. That's another one\nfor the stupidity counter. This person made\na video about me, but he couldn't even\nspell my name correctly. I write 'Rathee' with\ndouble Es instead of an I. \"On 21st December 2014, he made a song praising AAP, called 5 Saal Kejriwal. Elvish, from which angle\ndo I look like a singer to you? Why will I make a song for AAP? That too, 10 years ago. If you search for this\nsong on YouTube, The song 5 Saal Kejriwal is actually made by famous\nBollywood singer Vishal Dadlani. However, I made a\nre-edit of this song out of passion. I talked about this in\nthe Story of My Life video. About how in 2011-12, there was a time when\nthere were countless allegations of corruption\nagainst the UPA government. That was the time of the India\nAgainst Corruption movement in which Anna Hazare and\nArvind Kejriwal participated. And because of this movement, I got interested in politics. Some cynical people said that\nanyone can be a part of protests, but if they have the courage,\nwhy don't they get into politics? After this, the Aam\nAadmi Party was formed. People in Delhi were\nhopeful about the new party. And this is why, in the\nFebruary 2015 elections, they won 67 seats out of 70. Back then, they\nweren't supported by millions of rupees in political\ndonations given by large companies. Common people were their\nsource of political funding. Because I felt\npassionately about this, I openly supported them and volunteered for them by using my editing skills. I was a student at that time, studying engineering in Germany. So, in my free time, I used my graphic designing\nskills to make posters for them and edited a few songs. But it should be noted that neither did anyone\nask me to do this nor did anyone pay me to do this and neither was I ever an\nofficial or unofficial party member. Everything I did was\nof on my own volition and because of my passion. Even until 2017-18, you can find my Facebook\nposts and YouTube videos where I supported them so that they could\nget some recognition and a new party could\nsurvive Indian politics. Tomorrow, if a new party is\nformed in some other state and I feel that it is honest and they will have a positive\nimpact on Indian politics, there's no doubt that once again, I will openly show\nmy support for the new party. But will I get any\npersonal benefit from this? Did I get any personal\nbenefit for supporting AAP? Not even a bit. Many people have spread rumours that my 'relative' is in AAP. This is a baseless lie. I was neither a member\nof any political party, nor did I ever take money\nfrom any political party, and neither are any of my relatives\nmembers of any political party. Elvish, if you want, I can\nswear this on an affidavit. Although you won't be\nable to read the affidavit. And if I was being paid by AAP, then think about it friends, wouldn't the party expect that\nthe way the pro-BJP influencers worship the floor\nNarendra Modi walks on, I too should praise Arvind Kejriwal\nevery day on Twitter similarly? Statements like, \"Mr Kejriwal, the energetic\nmanner you speak in, I wish I could talk with\neven 1% of that energy.\" \"If we could talk with\neven 1% of your energy, we would be...\" \"Thank you, thank you so much.\" They'd want me to start calling\nArvind Kejriwal Delhi's Papa. \"Just to say, the\nfather of the country is is an analogy like\na fatherly-figure.\" They'd want me to say that I will go\nto any lengths to defend Delhi's CM. \"I will go to any lengths to\ndefend our country's PM.\" Like Arnab, they'd want\nme to make videos asking \"If not Kejriwal, then who?\" \"Modi versus Who?!?\" And add 'Kejriwal's Family'\nto my Twitter username. And ask people to vote for AAP. But over so many years, friends, have you heard me\nsay anything like this? Elvish posted a photo with BJP\nleader Smriti Irani and wrote that she is full of energy, and has a humorous mind. He wrote about PM Modi that Modi is a devoted to\nRam and our nation. In this tweet, he had once\nagain worshipped Modi. \"People call me BJP's henchman.\" But according to Elvish,\nI am paid for my content but his worshipping and flattery\naren't because he is on BJP's payroll. He further says that my\naudience is mostly from Pakistan. \"50% of his viewers\nare from Pakistan, which, according to me, makes\nno difference in our country.\" 50% of my audience\n\"is from Pakistan.\" He'll speak whatever\nhe can dream up. If we're speaking nonsense, I can say that his entire\nfamily is from Pakistan. But that won't make it true. Look at my Audience Statistics. More than 80% of the\naudience is from India. And out of the remaining 20%, at least 10% are\nIndians living abroad. Then Elvish claims that I\ncalled Aurangzeb a 'secular king.' \"According to him,\nAurangzeb was secular.\" \"But does this\nmean that Aurangzeb was a secular emperor?\" \"Did he treat all\nreligions the same?\" \"No!\" Once again, do you\nknow what the problem is? You are acting on a\npersonal grudge against me. That's why you are\nspewing such lies. In the video, I said that at times\nAurangzeb pretended to be secular, and communal at others, depending upon\nthe need of the hour. That shows that he\nwas an opportunist, just like you. First, you played cricket with Munawar\nFarooqui pretending to be secular. You were laughing,\nhugging, and clicking pictures. Just look. Oh sorry, wrong\nvideo, watch this one. \"We chose to bat first, we'll probably be\nout on the first ball.\" \"The toss hasn't happened yet, they\nwere asking about our preferences.\" \"Right, right.\" Oh no, wrong video again. Like, editor, please,\nstop wasting our time, and focus on editing. \"The main player of the\nopposite team is with us.\" A Twitter user pointed\nthis out and accused, Elvish of being an\nanti-Hindu traitor. To this, Elvish could have\nresponded by saying that, he had a conversation\nabout their differences, and that there were\nmisunderstandings between them, and the joke was\non a Bollywood song. And they happened to use\nquestionable language as a joke, and that they\napologised for it already. Elvish could have said that\nHinduism does not teach hatred, it teaches forgiveness. \"Take your hatred and your ego, keep them aside for a while, and talk to them for an hour. you won't be able to\nhate any one after that.\" But the cricket match was over and Elvish had to\nrun his shop of hatred. So what did Elvish do? He started telling white lies that it was just a cricket match and he wasn't serious\nabout attending. And that he was\nsimply teasing Munawar. You went from secular to\ncommunal based on your needs. And when there was\nanother cricket match, you became secular again. You're exactly like Aurangzeb. You're communal where you'll\nbenefit by being communal, and you're secular where\nbeing secular benefits you. The worst kind of\nopportunistic person. That's what you are. The truth is that you\ndon't have any ideology. You don't believe\nin any ideology. Everything you do, is\nfor money and fame. \"Elvish's and Munawar's campaign\nis trending on Twitter again, it's projected as 'versus'.\" \"Look guys, there's\nnothing personal, the hype on social media, it's the audience's love. I want to tell everyone\nto spread positivity.\" Then Elvish asked why I made the\ndictatorship video about PM Modi. His defence was that\nPM Modi shares memes. \"PM Modi shared his memes, because he enjoys it. I don't think a\ndictator would do this. Or someone who wants to\nbe a dictator would do this.\" It's like someone\ntelling you that drinking alcohol increases\nthe risk of heart disease. Your liver gets damaged. But you say that\nalcohol is not that harmful because drinking\nalcohol prevents fever. Does this make any sense? I showed you 10 examples of the growing\ndictatorial tendencies in the country. What about them? When 6 people are arrested for sticking\n'Modi Hatao Desh Bachao' posters, more than 140 MPs\nwere suspended, the central agencies\nlike ED were weaponised, how does he respond to these? That PM Modi shared\nmemes on himself. And what did this meme show? An animated PM Modi\ndancing on the stage. Was it worth getting\nsomeone arrested? If sharing this one meme, makes Narendra Modi\ngreat for some people, then their ability of\nhero-worshipping is on another level. \"People call me BJP's henchman.\" Just google the number of times people have been arrested\nfor criticising Narendra Modi. You will get a long list. But according to\nElvish, this is fine. Rather, the real\ndictator is Dhruv Rathee. I'm not kidding. He is trying to label\nme as a dictator. Because I blocked some vile\nand insolent trolls on Twitter. \"Let me tell you\nwho is a dictator. You are the dictator!\" If someone has\na different opinion, they are entitled to share it. But misbehaving\nis not an opinion. The screenshots of the\npeople Elvish shared, even in the screenshots, you can\nsee a sample of their foul language. I did not delete their Twitter\naccount from the platform. I merely blocked\nthem from following me. Its offline version will be if someone talks to\nyou rudely in real life, you stop talking to them. And according to this stupid\nElvish, this is my dictatorship. YouTuber Ramit Verma made an explosive video on\nANI and its editor Smita Prakash. So Smita Prakash's ANI issues three copyright strikes and Ramit's YouTube channel Official PeeingHuman\ncould barely survive this. This is the real oppression\nof freedom of opinion. Elvish was seen slapping\nsomeone in a hotel lobby and was seen beating up another\ninfluencer with his group of friends. Once he tagged a\nperson on social media, and told others to be\nabusive towards that person. Once a pro-BJP\ninfluencer had said that the media outlets whose\narticles are cited by me, should be hanged. A BJP leaders like Kapil Mishra openly supported this video. But according to\nElvish, all this is okay. But if you block some\nabusive trolls on your profile, it becomes a dictatorship. \"People say I'm BJP's hechman.\" Calls for genocide are made in\na so-called religious gathering. But Elvish has no\nobjection to this. Because his\nmentality is like that. Just look at the cover\npic on his Twitter profile. Do you know which\nfilm's screenshot is this? This is a screenshot\nof a Bollywood film. The name of the film is Shaurya, which is inspired by\nHindi drama Court Martial and Hollywood film\nA Few Good Men. The photo of the\ncharacter Elvish has put up, was not the hero of the film, he was the villain. Brigadier Pratap, whose Muslim servant Jamil k!lled his family during\nthe communal clashes. Since then he harboured\nhatred for all Muslims and wanted to k!ll all Muslims. That's what he asked his\njunior Major Rathod to do. \"Or else these people\nwill be the end of us.\" \"They will destroy hundreds\nof homes in Mayur Vihar.\" When this is revealed\nat the end of the film, the Indian Army relieves\nBrigadier Pratap from his duties. Issues an order\nto file a court case and arrests him. So basically, this film depicts the honour and\nprinciples of our Indian Army. Whichever officer goes\nagainst the principles of the army, will not be tolerated. Like this news\narticle from 2018. BJP leader and the then Chief\nMinister of Assam, Sarbananda Sonowal, welcomed a general\ncourt martial verdict. In which a major general and 7 army personnels were sentenced to life imprisonment\nfor a fake encounter in 1994. They said that it would strengthen people's\nfaith in the judiciary and the Army. Friends, our Indian\nArmy's motto is Seva Parmo Dharma [Serving\nOthers Is The Primary Duty] But how will this\nstupid Elvish's army understand the honour, ethics,\nand principles of the Indian Army? They are thirsty for the blood\nof Muslims all over the world. Even a snake is afraid that such\na venomous person might bite it. And I am not exaggerating. I would like to show\nyou another example. Last year in October,\nH*m*s attacked Is*ael. 350 Is*aelis were k!lled in it. I made this video on this. After that Is*ael\nstarted its attack. Till now, 1.7 million people\nhave been displaced in Gaza. More than 37,000\npeople have been k!lled. Things like the\ninternational rules of war were disregarded\nby Is*ael long ago. Hospitals have\nalso been attacked. Recently, a tent camp\nwas attacked in Rafah where 45 people were k!lled. More than half of them were\nwomen, children, and the elderly. This massacre\nsaw global outrage. The United Nations\nSecretary General said that there is no safe place in Gaza. And the horror needs to stop. 10,000 people held a demonstration\noutside the Is*aeli embassy in Paris. America's National Security\nCouncil spokesperson said that Is*ael should take\nprecautions to protect civilians. Egypt, Saudi Arabia, Qatar,\nIreland, Germany, France, have issued a statement and an AI image of\nAll Eyes On Rafah. Nearly 50 million\npeople circulated it. Many Indian celebrities who are not courageous enough to\nspeak out on Indian socio-political issues, but thankfully, they were\nbrave enough to speak up here. Our country's government\nissued the official statement that we support\nPalestinian statehood. And at the same time, the heartbreaking loss of\ncivilian lives in the Rafah camp was marked as a\nmatter of deep concern. After this backlash,\nthe Is*aeli military said that non-combatants,\nthose who were not fighting, the military was sorry to\ncause harm to such people. The Prime Minister of Is*ael called it a tragic accident and Is*ael talked about\ninvestigating it further. But Elvish put this\ncover pic on Twitter and openly show that he is thirsty for the blood\nof Muslims all over the world. He morphed the All Eyes\nOn Rafah image and wrote All Eyes On POK. Now it is true that in Pakistan\nOccupied Kashmir and in fact in Pakistan, there have been atrocities against\nHindus, Sikhs, Christians, and Atheists. I have talked about it\nmany times in my old videos. But what sense did it make that because there is oppression in\nPOK people d¥ing in Rafah is acceptable. It's not like the kids from Rafah\ncommitted atrocities in POK. Can't right-wing influencers\nlike Elvish say that they are against\ninjustice everywhere? These hero-worshipping YouTubers talk about selective outrage. But the cowards of\nright-wing ecosystem, there is no one more\nselective than you. When I made this\nvideo, I openly said that whether someone is a Hindu,\nMuslim, Christian or an Atheist, I am against injustice\nanywhere against any person. But I challenge these\nright-wing influencers come out and say this. The truth is that they\ndon't oppose all injustice. They hearts are\nfilled with hatred against a certain community. And against that community, they spew venom day and night. But this doesn't mean that they\ncare about their own community. Give up any hope that Elvish will ever raise his voice against\nany injustice against a Muslim woman. He won't speak up\nfor Hindu women either unless he benefits\nin some form or way. Take Manipur's example. People have been\nd¥ing there for so long. The entire country\nis shocked by this. But Elvish Yadav\ndoesn't care about this. For 250 days, Kashmiri\nPandits were sitting on a strike. Did Elvish talk about it? No. The pro-BJP ecosystem talks\nabout Kashmiri Pandits only when they want to talk\nabout Muslim brutality. Remember, friends, whenever riots\nbroke out in Noakhali, Mahatma Gandhi went\nthere to save Hindus, not Godse. Hindu or Muslim, Mahatma Gandhi was the\none trying to protect them. And Nathuram Godse\nwas the one spreading hate. Their ecosystem knows\nhow to use this hatred politics. The day BJP lost in Ayodhya, they started abusing\nHindus from Ayodhya. Ghaziabad police\narrested two such people. One of them was the person who slapped Kanhaiya\nKumar in the rally. You might ask why were they posting hateful comments\nabout the Hindus of Ayodhya? Merely because BJP lost the election there. This should show you that their only religion\nis worshipping Modi. And their only job is to flatter those in power\nand reap indirect benefits. The truth is that a\nperson like Elvish who wants to divide his own\ncountry in the name of religion, cannot be a patriot. What kind of patriotism is this where you attack the\nunity of your own nation? Where you spread\nhatred in society. In Upanishads, such people\nare said to be perverse. It is easy for the narrow-minded to group things into ours and theirs, But the earth is the home of the generous. The us versus them mentality is used by people who\naren't intellectually developed. For generous people, the\nentire world is their family. That was the theme of G20. The World is One Family. Now, considering the\nentire world as your family, this ideology will always\nbe out of Elvish's grasp. But at least he shouldn't\ntry to break up the country. Muslims aren't as\nbad as you think. See what they are saying. \"PM Modi claims that\nMuslims will ruin many things. I say, don't give employment\nto even a single Muslim person. But give employment to the Hindus,\nwe will set up stalls to earn our living. You give employment\nto all my Hindu brothers. You have to provide employment. It's our duty too, us Muslims,\nChirstians, and Sikhs, to make sure that our (Hindu)\nbrother isn't in any danger.\" -\"I am the only Hindu here.\"\n-\"Yeah.\" \"I am the only\nHindu in this colony.\" -\"There is no danger.\"\n-\"What's he saying?\" \"I am the only\nHindu in this colony. I don't face any dangers.\" -\"No dangers at all?\"\n-\"None.\" \"People cook up any nonsense, there are no threats\nor dangers here.\" It's quite simple that if a person from whichever\nreligion commits a crime our law and order should\ntake action against it. So that the rest of the people\ncan live in peace in the country. Can you not understand something\nso simple with your tiny brain? I talked about your 4 anti-Hindu\nvideos in the last video. In one video you were saying\nthat chillum is Lord Shiva's blessing. Disrespecting Lord Shiva. You have removed this video now. Which is a good thing. Here, you should be praised. Good boy! In another video, you were\nmocking Hindu mantras. \"Yo, pandit, recite se*y\nmantras for this wedding.\" \"...recite se*y mantras\nfor this wedding...\" You have removed that video too. Again, good boy! But I showed two more videos. One where 'Jai Shri Ram'\nwas written behind you and you were telling\npeople to install an app to watch and\nobjectify streamers. You said that your\nviewers will enjoy it. \"You can become\nfriends with many people, whether they are\nfrom India or abroad, there are more\nthan 17 million hosts, and the streamers are exciting, you'll enjoy every moment.\" You have not\nremoved this part yet. Do remove this part. You shouldn't do cheap theatrics\nwith Lord Ram's name behind you. And the fourth video was\nperhaps the most problematic where you made fun\nof Hanuman Chalisa. [Reciting Hanuman Chalisa] You have not\nremoved this video yet. So let me put the link\nin the description below. The time code is 5:50-6:08, and from 8:50 to 9:05. Now after watching this video, you'll trim this part. Now on to the next point, you sell a hoodie with\na picture of Lord Ram. You are using religion\nto run your business. The problem is that you are messing with\nthe scriptures of Hinduism. Acharya Prashant has\nalready clarified that and I have mentioned\nthis in multiple videos, that the phrase\n'Violence is Also Religion' have not been mentioned\nanywhere in any Hindu scripture. \"The words 'Dharma Hinsa\nTathaiva Cha' aren't written anywhere. And this should terrify you. What is this centralised\nconspiracy unit, which plans such\nelaborate conspiracies, that something which isn't\neven hinted at in religious scripts, has been coined in Sanskrit, and is now circulating it everywhere\nthrough WhatsApp and other means.\" You can either show me that these lines\nhave been mentioned in any Hindu scripture or remove this hoodie\nfrom your clothing line. Make a new design that has actual lines from\nHindu scriptures on the hoodie. I'm sure you hate it\nwhen I talk about religion. \"Our Dhruv is Lord\nRam's devotee.\" You are irritated because\nthough you speak of Lord Ram, your heart follow Nathuram. You need to remove Nathuram\nGodse from your heart. You need to purify your heart. House Hindu teachings\nfrom Upanishads like 'the world is my\nfamily' in your heart. There is so much to be said, but this video is\ngetting too long. We haven't talked much\nabout your misogyny yet. You call a woman\na 'witch' as a joke. \"Look at this witch here.\" In another video, he pointed\nout some girls as 'not fun'. \"When you see a\ngirl, you are full of joy, these girls are not fun, bro.\" When you go to buy a car, you can't understand that a salesgirl is also someone's\nsister and daughter. She is working to feed herself, it doesn't allow\nyou and your friends to look at them like\nvultures look at their preys. \"The Russians are here!\" \"They're here?\" You should be embarrassed\nin front of your mother. He told his mom that\n'Katariya' is stuck with Russians. \"There was so much immorality, Katariya was stuck\nto the Russian.\" Have you ever considered that\nyour mom was feeling so awkward? Overall, there's so much for\nyou to soak in from this video. But I don't want you\nto get too confused. So let me speak to you in\nclear-cut and simple language, I would like to\ngive you 10 tasks. Do these 10 things so that you can be the right\nexample for your followers and together, you and I, can improve our\nsociety and our country. #1: stop spreading hatred\nand destroying the country. Remove this cover pic of this genocidal\ncharacter from your Twitter profile and put up a picture of a saint, like\nSwami Vivekananda or Dr Abdul Kalam. Then tweet, \"Long\nlive Indian Unity.\" Only then can you call\nyourself a nationalist. #2: Be the voice of Indians\nand the youth of our country. I am not actually\nexpecting this from you. This may be too much for you. But, no worries, just stop promoting\nbetting apps. These addictive apps are driving the youth of\nour country towards ruins. If you want sponsors, drop\nme a personal message. I will get you sponsors. #3: the anti-Hindu\nvideos on your channel, the cheap videos that\ninclude Lord Ram's name, and the videos that make\nfun of Hanuman Chalisa just clip those portions\nfrom your videos. That won't be a big deal. #4: the hoodie on which you\nhave distorted Hindu scriptures redesign it, stop selling that hoodie, and use a quote that is actually in our\nHindu scriptures. #5: this is one of your videos, titled 'Holi Pe Bhang\nPeeke Set Hogye' delete that video. You can consume\nanything you want to, but don't drive the youth of our\ncountry towards a wrong direction. #6: the video in which\nyour friends and you were talking nonsense\nabout that salesgirl, that disgusting video\nshould be deleted. This is not freedom\nof expression where you use cheap\nexpressions and theatrics to attack a girl's dignity. #7: pick up a maths\ntextbook from 7th grade, and work on the\nchapter on Percentage. \"Are all your claims\nand content true? Gold's rate is decided\non a global level, that's not up to\nour government.\" And then Google how gold's rate is decided. This might help you understand the role of the government in\ndeciding the domestic price of gold. All you need to do is read this article. Because being a\nfool is not the issue. Problems arise when a person doesn't\nrealise his foolishness. #8: I saw that you don't use foul\nlanguages as much as you used to, the video you made on me,\ndidn't have a single vile word. Wonderful! Good boy! Now make a reel or post a\ntweet addressing your Elvish Army, telling them to stop\nusing vile languages insulting other people's\nmothers and sisters. There is a line in the\nsong 295 that says there is no difference between your\nmother and someone else's mother. They will learn this\na little late in life. But at least you have\nlearned your lesson. It's on you to teach\nyour Elvish Army now. Whether they agree to\nit or not is their choice, but you need to\ntry your best first. #9: glamorising weapons and objectifing women have been themes in your songs. You need to choose something\ngood for your next song. Instead of the songs that spread\nfilth like Honey Singh's and Badshah's, make a positive\ncontribution to Indian culture. And finally, Task #10: the last thing, Do you remember the\nchildhood game we used to play? \"Posham Pa, brother, Posham Pa, what happened in the Red Fort?\" \"Stole a watch of ₹100.\" \"Will have to go to jail now.\" \"Will have to eat jail's food,\" \"Will have to\ndrink jail's water.\" \"Will have to go to jail now.\" This was just a game\nwe played as children. So why are you becoming\nPosham Pa in real life? You beat up people, you threaten people. You got tangled in\na snake venom case, and there are allegations\nof money laundering too. Have you not had enough? As I told you in the last video, if you say lie and say\nterrible things about people, someday, you'll be charged\nwith criminal defamation. If you spread hatred, someday,\nyou might be charged with 153A [IPC]. For disturbing communal harmony. Once you hit\nsomeone with your car, that person was\nsafe, thankfully. Someday, in this\ngame of Posham Pa, you might really\nneed to eat jail's food. That's why I'm asking\nyou to mend your ways, there's still time. I hope this counter has\nbeen enough for you. If you still think that this\ncounter wasn't enough, let me know. And, friends, I hope\nthat this 'counter' has been enough for all the gang\nof these right-wing YouTubers. I hope that the other\nright-wing YouTubers, will learn their\nlesson from this video. Until then, if you are interested in\nturning YouTube into your career, you can use the course\nlink in the description below. The coupon code is ELVISH420 And this is the detailed\nvideo on the religious aspect. You can click here to watch it. See you in the next video. Thank you very much!"}, {"text": "\"Where's the counter?\" \"Where is his counter?\" Stop pining and waiting\nfor a reply from me. This is the answer. So this allegedly dangerous George Soros about whom there are so\nmany conspiracy theories, I showed you his direct links with BJP. But the link between Harsh\nMander and me, as per Elvish, you will be shocked to hear that someone can actually be so stupid. I think that he is the fool because he didn't even notice that this Aadil Aman who\nwas in my Facebook group spelled his name differently, than this Adil Aman. You are already facing\nso many court cases, you are out on bail, and then you come and\nspew some rubbish in the video to draw more court cases. Hello, friends! Have you ever seen a \"Bitouda\"? This thing. This is used to store cow dung cakes. There is a Haryanvi saying, A Bitouda can give you cow dung only. A few weeks ago, a friend told me that Elvish Yadav made a video on me. He asked what I thought of the video. What else could I expect? A Bitouda can give you cow dung only. Now, friends, there is a whole\nbunch of these right-wing YouTubers who have tried to attack me in one\nway or another in the last few months. Some call me a dog, some call me a cockroach, some claim that my wife is Pakistani, and some call me a bully. But out of all of them, Elvish is the true leader of these idiots. Because, the sheer amount of inappropriate\nthings he said about me in his videos, the amount of lies he has spread, no one can match his vigour. The video he made on me, many YouTubers have already countered it. \"Those who wear saffron\nare terrible people.\" \"All of them are terrible.\" \"Everyone who wears the saffron scarf.\" \"Elvish, Dhruv Rathee never said that anyone who wears saffron\ncolour is a terrible person. Rather those who use saffron as a symbol and carry weapons in front of mosques, those who wear saffron\nand then insult Lord Ram, they are terrible.\" \"This is called brainwashing.\" \"What is this system about? Ruining childhoods? Promoting gambling apps? Making videos while intoxicated? Making videos after drinking beer? Spoiling the social environment? What is this system about?\" Making any random connections Claiming something showing something else. At times, you can't even speak properly. \"Harsh Mandaar or Harsh Mander\nwhatever you want to call him.\" \"So this is an interview of  Singh,  Singh isn't\nthe same as Harsh Mander. He is a different guy. Just because their names are similar, he cited an article about the other person. That's the limit of laziness.\" \"There's no available proof that Harsh Mander and Dhruv\nRathee are directly connected. But based on mere speculation and a conspiracy theory, this is shared with so much confidence.\" \"A person who used vile\nlanguage to rise to fame, he didn't use any such words in this video. He says that he can't use\nsuch language in this video. Why? Because this person, has showed him the better way. That's the difference\neducated YouTubers make. When the leader of vile people, stops using vile language, because of a video this person made, why won't his followers, stop using such language then?\" Despite being insulted so much, Elvish was not satisfied. He wanted me to make a counter video. Repeatedly asking me to counter his claims. \"Where's the counter?\" \"Where is his counter?\" \"Why isn't he replying?\" Stop pining and waiting\nfor a reply from me. This is the answer. I'll start by saying that Don't you dare play the victim\ncard after watching this video. I won't like to see you crying. You have gone on TV to cry earlier. \"People may say I'm BJP's mouthpiece.\" \"Why is Dhruv so \ninterested in anti-nationals?\" \"A person may do anything, by what is the limit to craziness?\" BJP uses a popular strategy. You must have noticed this before whoever criticises BJP, BJP's people start\nlabelling them \"anti-national.\" Elvish did the same. Labelling critics and people with\nopposing views as \"anti-national.\" And then somehow connecting\nall of them to Dhruv Rathee eventually declaring that\nI am \"anti-national\" too. \"I'm labelling him anti-national.\" Come, look at what he said point-by-point. He talked about a\nman named Aadil Aman. \"In 2020, Dhruv Rathee\ncreated a Facebook group, he was the admin of the group. There were many members in this group. But one of the important\nmembers in the group was Aadil Aman.\" First misinformation. I didn't make any groups in 2020. The group he is talking\nabout was created in 2017. And by 2020, I had deleted that. The name of the Facebook\ngroup was Dhruv Rathee Squad. Along with it, I have a Facebook page with the name \"Dhruv Rathee\" To manage this page, I chose a few admins among the users who were the\nmost active on my Facebook page. I didn't know these people personally. The only basis for making them\nthe Admin of the Facebook group was they were the ones to consistently\nlike and comment on my group the most. In fact, this was based on\nFacebook suggestions back then. So, these admins of my Facebook group, I have never met any of them personally. Now, what happened is\nthat one of the admins, Aadil Aman made some\nviolent and extremist comments, which I do not support, obviously. The other admins showed me those comments and I removed him from the admin position. Now, it's quite logical, I always oppose any mentality\nlike Nathuram Godse's. But later, I realized\nthat if this continues, if people can write whatever\nthey want to in this group, I will be blamed later on. That's why around 2020-21, I shut down this Facebook group. Now, nearly, four years later,\nthis fool enters our story. Who tries to create a\nscandal about this incident. He starts creating imaginary stories that Aadil and I are best friends. \"If Dhruv is watching this video, he'd be probably smiling by now. They are old friends. They worked for AAP together.\" When PM Modi is caught following\nfrauds and scamsters on Twitter, then these pro-BJP influencers\ndo all sorts of mental gymnastics to show that the honourable\nPM is always blameless. That the PM had no way to know\nthat the accounts he follows are vile. Do you remember this\ntwitter user named Nikhil? He was proud to be followed\nby PM Modi on Twitter. Look at how he celebrated\nthe de@th of a female journalist. Used disgraceful words for her. \"Please, we request the PM to not follow such people. If he can't find any other\nworthy India account to follow, he can feel free to follow me.\" But this wasn't the only case. This is the BJP 2016 page, which posts foul language\nagainst journalist Swati Chaturvedi. Narendra Modi was following this too. BJP 2014, Avinash Choubey, CoolAditaya, MahaveerM, and many such threatening\nand abusive handles were being followed by PM Modi. Not only that, PM Modi had hosted some violent and\nabusive trolls like Ankit Jain, Suresh Nakhua, and Tajinder\nBagga on his official residence. Couldn't he have checked what\nkind of people they were beforehand? Now, moving towards offline, Asaram was convicted of r@pe. Here, Narendra Modi is seen\ngarlanding him and touching his feet. \"When no one knew me, since then, I have been receiving his blessings.\" In this tweet and Facebook post, PM Modi is see praising Gurmeet Ram Rahim. The same Gurmeet Ram Rahim who has been found guilty\nin mu₹der and r@pe cases. In this photo, you can\nsee Haryana's ex-chief minister sitting with\nGurmeet Ram Rahim. Look at this 2017 news article. Madhya Pradesh's Anti-terrorist squad arrested 11 people in Bhopal,\nGwalior, Jabalpur, and Satna. They were accused of\nspying for Pakistan's ISI. Now look at this headline\npublished by Aaj Tak. This person wearing BJP's\nbanner around his neck, and wearing a t-shirt promoting Modi, is Dhruv Saxena. Here is his photo with MP's former\nChief Minister Shivraj Singh Chauhan. \"Bharatiya Janata Party is \nthe first political party in the world that has now been marked as an ISI-certified party. At least 3 out of these 11 were directly connected to BJP.\" There are not 1 or 2 connections\nbetween BJP and alleged terrorists. There are many. Look at this news article from 2022. One of the two terrorists caught\nin Jammu's Reasi, Talib Hussain, is the former chief of J&K BJP's\nMinority Morcha IT Cell. BJP said that he was a\nmember for only 18 days. The accused in the\nk!lling Nasir and Junaid, Monu Manesar was\nphotographed with Anurag Thakur, with the late Arun Jaitley, and with Home Minister Amit Shah. In this photo, PM Modi, is seen with former BJP MP, Pragya Thakur. An accused in the 2008\nMalegaon bomb blast case. BJP members and their extremist tendencies, their direct involvement\nor indirect association, these were some examples of it, just a trailer. If I start making an exhaustive list, this video will turn into a 3-hour film. Babu Bajrangi's sting operation, Yashwant Shinde's affidavit, Prajwal Ravenna, Ashish Mishra, Anurag Thakur, Yati Narsimhanand Saraswati, Surajpal Ammu, Suresh Chavhanke, the list goes on and on. Some support gun violence, some garland people who lynched someone, some call r@pists \"cultured Brahmins,\" and some call for genocide against Muslims. Does Elvish have the guts\nto talk about these cases? Elvish, I know for sure that\nyou are watching this video. I am talking to you. If you have even an ounce of courage, ask BJP for a counter. You were harassing me\nfor making a counter video, now do this to BJP. You won't. Because I know that people like\nyou who appease those in power, can never be courageous enough\nto so something like this in their lives. It's easy to speak against me because you know that the authorities\nwon't take any action against you, and you will get views by\ntargeting big YouTubers. There will be some\ncontroversy and free publicity. Do you know what's the biggest\nproblem with shallow YouTubers like you? People like you think that you'll get\nviews only by creating controversies. And that this is the only\nway to get more followers. That this is the only way to\nbuild a career on YouTube. But I told another YouTuber like you that it's not possible to build a sustainable\nYouTube career by creating controversies. People will tolerate this\ndrama only to a certain limit. After that, people will realise that you create drama and controversies only for the views and money. If you really want to make a\nlong-term career on YouTube, then you will have to provide some\ngenuine value to your audience. I have taught this in my\nYouTube Blueprint course. If you don't understand this, go and take the course. I'll give you a special discount. Use the coupon code ELVISH40 to get 40% off. In this 7.5-hour-long course, I have taught everything. How to film,\nhow to edit, how to monetise, how to earn from this career without promoting\ngambling and betting apps. It's really important that you learn these. Because your current business model of creating controversy to get more views and promoting these gambling apps is ruining the future\nof our country's youth. In this course, I have detailed\nother ways to earn money. And the most important thing,\nin the second chapter, I talked about how to choose your niche. Based on your skills and passion I'll show you how to create\na unique YouTube channel. Now, friends, I'm not sure\nabout Elvish Yadav's skill levels. So, forget about him. But if you are interested, you can definitely use\nthe ELVISH40 coupon code. The people who have\nalready taken this course, found it extremely useful. And whatever I've learned in\nmy 10-years-long YouTube career, I'll teach you all of it in this course. You can scan this QR code. Or you can use the link\nin the description below. Coming back to the topic, the guy goes on to talk about George Soros. \"Harsh Mandar has works with George Soros, who has invested ₹80 billion, to overthrow a patriotic PM like Modi, and the entire government.\" You must have seen this George Soros\npropaganda on WhatsApp University. It has Illuminati,\nNew World Order, Pakistan, China,  America, Communism, JNU, Toolkit Gang,\nKhan Market Gang, Congress etc. All of them put together. They have made a mess of these big words. And this mess is served to Modi's devotees with a good morning message on WhatsApp. In his videos, Elvish\nYadav keeps repeating that you should Google what he claims. So let's actually Google it and see who this George Soros is. George Soros is a\nHungarian-American billionaire. He is an investor, hedge fund manager,\nshort seller, and philanthropist. There are some big words. Elvish might not have understood these. So he opened his WhatsApp and decided to parrot what\nwas written on WhatsApp. In 1992, he shook the Bank of\nEngland with his short selling. He earned a profit\nof a billion dollars. In 1997, he shorted the\ncurrencies of Thailand and Malaysia, due to which there was a\nfinancial crisis in those countries. The same year, he wrote\nan article in The Atlantic, in which he stated that he made a fortune in the financial markets, but he felt that laissez-faire capitalism, where there are no government regulations, such capitalism is a\nthreat to open society. Open society means a world with democratic governance, freedom of expression, and\nrespect for individual rights. To build such a society, he built his Open Society Foundation\nin 100 countries around the world. This Open Society Foundation\nset its foot in India in 1999 when Atal Bihari Vajpayee was\nthe Prime Minister of our country. Initially, the society awarded\nscholarships and fellowships to students to study and conduct\nresearch in Indian institutions. It was only in 2014 that they began their India-specific\ngrant-making program. Under this, they supported local\norganisations working in different sectors like community living for people\nwith psychosocial disabilities, public services,\nstrengthening rights, justice system reforms,\nmedicine access, etc. Their social impact investments have funded two ventures, Neo Growth and Capital Float. These two ventures have helped more than\n40,000 small businesses in India by providing affordable\nfinancing of around $300 million. For example, look at this\nnews article from 2017. In the Financial Year 2018, Capital Float disbursed loans of ₹50 billion\nto small and micro businesses. In 2022, Capital Float was renamed Axio. If you google a little more, you will find the founders of this company. Gaurav Hinduja and\nShashank Rishyasringa, who have done their MBA\nfrom Stanford University. And if you google Gaurav Hinduja, his Twitter account will come up. Where you can see\nhis verified followers, that include BJP leader Kapil Mishra. Then Google Shashank's name. This news article will come\nup about Shashank's marriage. Mukesh Ambani's mother Kokilaben Ambani, BJP leader Lal Krishan Advani, And BJP leader Devendra Fadnavis. So this allegedly dangerous George Soros about whom there are so\nmany conspiracy theories, I showed you his direct links with BJP. But what fake news they\nwill spread on WhatsApp? That I get funding from George Soros. An investigation by the\nIndian Express revealed that George Soros' Open Society Foundation has 68 such projects worldwide which are funded by\nthe UN Democracy Fund. And in this United Nations Democracy Fund, India is the fourth-highest contributor. Do you understand what this means, friends? This means that indirectly, George\nSoros is funded by the Modi government. George Soros' opinion\nabout China's Xi Jinping is that China's President is the most\ndangerous opponent for open societies. He has told the international community to do a crack-down on\nChina's high-tech companies. He also criticised China's\nBelt and Road Initiative. Not only this, in 2017, he ordered the closure of Pakistan's\nbranch of the Open Society Foundation. The George Soros that\nthey try to paint as a villain, openly speaks against\nChina and Pakistan. Additionally, he made efforts\nto end racism in America. He raised his voice\nagainst income inequality. Along with some other rich people,\nhe wrote a letter to the US government in which he said that instead of\nthe middle-class and poor people the rich should be taxed. He said that rich people like them\nwho have more than $50 million should be taxed with a 2%-3% Wealth Tax. So overall you can see that George Soros openly speaks against China. Pakistan is upset with him. He opposes racism and\nincome inequality in America. He talks about the dangers\nof unregulated capitalism. He has given fellowships\nto students in India. His organisation has\ngiven money to farmers. Provided easy loans to more\nthan 40,000 small businesses. They have invested in many \nIndian startups like Freshworks. And the Indian government \ndonates to the UN's Democracy Fund, that funds their worldwide projects. All of this sounds fine, so what's the problem? The problem is, he expressed \nconcerns over India's eroding democracy. The problem is, he \ncriticised Narendra Modi too. He talked about the suspicious relationship \nbetween Gautam Adani and PM Modi. He said that PM Modi needs to \nspeak out on the Adani crisis. To retain the trust of foreign investors. \"Modi and business tycoon Adani are close allies. Modi is silent on the subject. But he will have to answer \nquestions from foreign investors. And in Parliament.\" As you know, according to their ecosystem, Modi is India, and India is Modi for them. So if anyone criticises PM Modi, their gang declares them anti-India. Whether that is Rhianna, \nIndian farmers or George Soros. These were the propaganda circulating \non WhatsApp and pro-BJP media. But Elvish's stupidity goes beyond this. Elvish claims that George Soros \nand Rahul Gandhi's aunt know each other. And so the aunt is a threat to our nation. \"George Soros and Rahul Gandhi's aunt, Fori Nehru, are close acquaintances.\" A simple search on Google will tell you that she passed away in 2017. At the age of 108. A woman who passed away 7 years ago, at the age of 108, is a threat to our nation according to Elvish. And look at this 2009 \narticle in the Indian Express. This reports that \nFori Nehru was from Hungary. As is George Soros. Like Soros, she was a Jew too. After her love marriage in India, she changed her name to Shobha Nehru. The heading is from a 2009 article \"Mr Soros goes to meet an old friend\" But 14 years later,\non 18th February, 2023, This article is published\nby two right-wing websites, as breaking news perhaps the biggest news ever, they used a 14 years old article, to print a \"Breaking News\" The same thing was done to former\nPM Dr Manmohan Singh's daughter Amrit Singh. This is an article from 2013 that reports that the PM's daughter was awarded for her outstanding\nwork in human rights law. Her report was called\n\"Globalising Torture: CIA Secret Torture and\nExtraordinary Rendition\" In it she talked about 136 people who were framed as terror suspect to be detained and tortured\nin jails across 54 countries. It is also mentions that she was working with the\nOpen Society Justice Initiative the ones publishing this report. But 7 years later, the pro-BJP websites published this too, as a piping hot breaking news. Had they had tried to find\nout the latest information, they would have found that she doesn't work with the Open\nSociety Foundation anymore. Presently, she is a law\nprofessor at Stanford University. After this, Elvish talks\nabout Harsh Mander. \"Harsh Mandaar Call him Harsh Mandaar\nor Harsh Mander whatever.\" No, first of all,\nit's not whatever. His name is Harsh Mander. Tomorrow, if someone\ndisrespects your name like this, \"call him Elvish or Aalvish whatever\" it's disrespectful. Second, let's Google to check who he is. Harsh Mander is a former IAS officer who has been the\nDistrict Head in 6 districts. He has been a Divisional Commissioner. In Masoorie's Lal Bahadur\nShastri IAS Training Academy, he was a faculty. In 2002, opposing the Gujarat riots, he took voluntary retirement. He has written 24 books. Elvish wouldn't have read\nso many books in 7 lifetimes. And in the last 10 years, in Dainik Bhaskar,\nHindustan Times, The Hindu,\nIndian Express, Scroll,\nLivemint, NDTV,\nBusiness Standard, Article 14, and such other\nnewspapers and news portals, he has written columns. Shyam Benegal's film, Samar, is based on two stories written by him. He has given lectures at\nmany college universities like IIM Ahmedabad, NALSAR University of Law, MIT Boston, University of California, Institute of Development Studies. From 2010 to 2012, he was a member of the National\nAdvisory Council of the UPA government. He has greatly contributed to\ndrafting many important bills, like the Right to Information,\nRight to Education, Food Security Bill,\nChild Labour Abolition. He ran the Karwan-e-Mohabbat\ncampaign against l¥nchings. And he has received\nmany awards for his work, like M.A. Thomas National\nHuman Rights Award 2002, the Christhi Harmony Award 2012, and the Quaide Milleth Award 2020. But according to this fool Elvish, he is anti-national too. You may ask why? Because Elvish says that he has worked with George\nSoros' Open Society Foundation. \"The same Harsh Mandar\nwho works for George Soros.\" This man has such a creative \nimagination for nonsense.  The most interesting thing is seeing how am I related to this? Friends, I haven't met Harsh Mander yet, nor have I ever spoken to him. I found out about him from Elvish's video, and the information I\ngave you in this video, I had to Google it and research\nabout it after watching his video. But the link between Harsh\nMander and me, as per Elvish, you will be shocked to hear that someone can actually be so stupid. Elvish said that the video I\nmade on CAA and Manipur, was inspired by Harsh Mander's tweet. \"On 4th August, 2023, Harsh Mandar \ntweeted about the Manipur riots. And two days later, Dhruv published his video.\" He revealed the timings\nof the tweet and the video as if he is a great detective. But here he made another mistake. \"On 14th December, 2019, Harsh Mandar posted a tweet on CAA and NRC, and exactly 3 days later, that is, on 17th December, 2019, Dhruv, as per the toolkit, made a video wherein he mentioned the CAA.\" Actually, this was my\nsecond video on CAA NRC. 5 days before this, on 12th December, I\nuploaded the first video. I made 3 videos on this topic in total. All of them are still\nuploaded on YouTube. You can go and check when\nthey were uploaded yourself. So, first of all,\nthis proof is incorrect, and even if it were true, then trying to show a connection\nlike this is quite a strange thing to do. If any topic makes news in our country, then, of course, the top\nYouTubers will make videos on it. I will also make a video on that. In December 2019, news\nchannels and social media platforms were debating on this topic. So I made a video. Along with me, millions\nof people tweeted about it. Made posts on Facebook. It's the same for Manipur. When Manipur's issue\nwas getting unbearable, I made a video on it. And out of millions of\ntweets by as many users, to specify one person and to say that\nafter this person's tweet, I made my video. This is quite illogical. And I decided on making\nthat video on Manipur because in Manipur's tragic clashes, the video of those two women\nshook the very soul of people. Every person whose\nconscience hasn't d!ed, whose soul hasn't been sold, spoke out on this topic. But a government's bootlicker like Elvish had nothing to say on a\ncritical issue like Manipur. And then he claims to be a nationalist. \"I love my country. No matter what anyone says. Patriotism runs through me. It's in every part of my body.\" Do you feel any shame or not? Recently, when you were\nasked about the NEET exam, you became speechless, you could do nothing else but smile. \"Recently the papers for NEET exams for\nthose who want to be doctors were leaked, what is your take on it? Elvish! Or even Munawar. This is about the youngsters.\" And you want others to remain silent\non sociopolitical issues like you? Do you think your fans\nand viewers are idiots that they will believe\nany idiotic thing you say? Elvish knew that people would\nnot believe such baseless stuff. So he used another trick. In an attempt to connect\nme with Harsh Mander, he brought Aadil Aman in between. He said that Aadil Aman\nnow lives in Germany and works with Harsh Mander. \"And this guy, Adil Aman, \nhas moved to Germany. And since 2019, has been working for \nan NGO Karwan-e-Mohabbat.\" To prove this, he showed\na Facebook profile as proof. And do you know what friends? This was some other Adil\nAman's Facebook profile. Literally, he was talking\nabout two different people. Either he is stupid that he couldn't even check whose Facebook profile he showed, or he thinks his viewers are really stupid. I think that he is the fool because he didn't even notice that this Aadil Aman who\nwas in my Facebook group spelled his name differently, than this Adil Aman. He didn't even realise that\nthey couldn't be the same person. Look at the Facebook\npost of this other Adil Aman. \"On the evening of 1st January, 2024 my friends informed me that my name is being misused by a\nYouTuber named Elvish Yadav. Elvish, who is currently out on bail, has 15 million subscribers on YouTube and 16 million followers on Instagram. I am a researcher I am pursuing a Masters degree\nfrom the University of Göttingen. I have no affiliation with any\npolitical party or their student wing. As Elvish claimed in his video. It is clear from the video that the comment Elvish is talking\nabout wasn't made by me. And my Facebook profile was used to show a link between my former\nemployer Harsh Mander and Dhruv Rathee. Because of this deliberate defamation, and misrepresentation, Elvish's followers have filled my\nFacebook inbox with abusive messages. They have threatened\nto hurt me and my family. I have seen users on Twitter demanding my arrest\nbased on this misinformation.\" You stupid Elvish, because of you, some\ninnocent man is getting abused. Aren't you ashamed? Look at what's written further. \"My lawyer sent a legal notice\nto Elvish Yadav on 3rd June saying that the comment\nhe has attributed to me have not been made by me. And neither have I organised any protest. We gave him 3 days to delete the video and to issue a clarification. 3 days have passed and now, I will file a legal\ncase against Elvish Yadav for causing damage to my reputation and for threatening my\nand my family's safety.\" That's why I warned you\nright at the beginning of the video, Don't cry, Elvish. The nonsense that you spout, actually affects someone's life. You are already facing\nso many court cases, you are out on bail, and then you come and\nspew some rubbish in the video to draw more court cases. In his video, Elvish said that anyone can show any random article\nto prove anything against someone. \"Suppose I want to prove that \nthis cameraman is a bad person. I can do that. Some way or the other,\nby showing whatever random article.\" And this is exactly what\nElvish did in his video. I want to ask, why don't you tell your audience whether you do all this\nonly for views and money or was someone higher up paying you? While talking about Harsh Mander, he showed an article, underlined a line, that his parents worked for\nthe British police in Tanzania. Now, look at this article. Instead of Mander, it says Singh. I searched this line from\nthis article on Google using double quotes, and this article came up. This was an interview with\nCaptain  Singh, a brave officer. He was born in 1926 in Tanzania and when he was only 33 years old, that is in 1959, China attacked Tibet. At that time, Captain  Singh played an important role in protecting\nthe Dalai Lama and bringing him to India. On the government's website for\nPadma Awards, we can see that he was awarded a Padma Shri in 1960. Elvish, if was nothing else, you would have respected\nsuch a brave officer at least. Even though you aren't educated enough, but can't you even read the bare minimum to differentiate between Harsh\nMandar and Harmandar Singh? And by the way, let me inform you, friends, Harsh Mander is the son of\nthis Captain Harmandar Singh. Even if Harsh Mander wants, he can file a defamation\ncase against Elvish. Not only that, you didn't spare former PM\nDr Manmohan Singh's daughter Amrit Singh, and spread lies about her, she too can file a case against you. Moreover, I can file a case\nagainst you for defamation. My lawyer said that the hateful\nnonsense about me in your video, is grounds for a criminal defamation case. If these cases are filed\nagainst you tomorrow, then don't play the victim card. I'm telling you this repeatedly. Elvish tried to show that I have some\nquestionable links with some people. But I can prove that it is he\nwho has these connections. In one of his videos, Elvish\nshowed support for Akhilesh Yadav. \"The thing is, we're\nAkhilesh's supporters.\" \"He has made the Yadav\ncommunity proud in UP.\" \"So tell me, why should\nwe not support Akhilesh?\" Who is Akhilesh Yadav's alliance partner? Rahul Gandhi. While he was trying to show that Rahul\nGandhi is \"anti-national\" in his video, won't it make him\nanti-national by assosiation? One the other hand, you\nhave so many links to the BJP. You have been photographed\nwith so many politicians. Using these to show off, to show your support to these people. From one side or the another, anyone can cook up your\nconnections with several people. That can be used to\ndeclare you \"anti-national\". \"I declared them anti-national.\" \"Caught by the NIA.\" Elvish, the lies that I've caught till now were in a short 5-6 minute\nsection of your video. There are many more lies to be caught. You have made so many allegations about me about how I spread fake\ninformation on my WhatsApp channel, shared p-rn-graphic content on Telegram, and whatever nonsense you imagine. At times you said that\nI promote some fake coin, at times you claimed that I have\nlinks with the Aam Aadmi Party. The filth you have spread, it will take another video to mop it up. In the next video, friends, we will go into the\nother allegations in detail and we'll catch Elvish\nYadav's real personality. Till then, Elvish, you have\na chance to introspect, Go and talk to your parents. Show them this video. Tell them about the numerous possible\ncourt cases that can be filed against you. And yes, don't play the victim card. I don't want you to go and\ncry on a news channel again. And friends, if you are interested in making YouTube your\npart-time job or full-time career, then you will get the link to the YouTube\nBlueprint course in the description below. Or you can scan this QR code. Use the coupon code ELVISH40 Till then, I would like to tell you that I had made a similar\nvideo on Elvish before. You can click here to watch it if you want to know how such\nYouTubers spread filth in society. Thank you very much!"}, {"text": "The police is already under a lot of pressure and now a new headache for them - chhapri influencers whose testosterone level is high and their respect for law and order is low. We can't say anything about social reform but they know how to fool the society Self-proclaimed Ram Bhakt Elvish Yadav, was arrested in snake venom case Strange Ram bhakt he is ... these people are defaming my religion to make money and followers Haryana police got involved when fitness influencers Rajat Dalal and Rajveer Singh Sisodiya were to fight After the police got involved, their testosterone level dropped. But these are the new digital icons of New India. Beatings, abuse, threats to kill, explicit rape threats against women of each other's families many viral videos top trending, and of course, followers double overnight, and if God is a little merciful, entry to Big Boss next year.  And by doing cheap stunts, breaking the law, spending some time in jail, these new icons of the country will become famous.  They will become rich. But who will waste time? Obviously, their fans, their army. How? I will tell you now. But before that, you understand the chronology.   If you are a fan of a Chhapri Influencer or if you have a family member, then please share this episode with them.   In today's episode, we will expose how hate and conflict influencers are shaping the next generation. They are filling their pockets but are making everyone broke. When we used to watch WWE in childhood, we used to think that Undertaker is dead and revived. and that HHH really hit opponent with a hammer Now, whether it's true or not, it was interesting to everyone. And everyone used to stare at it. Similarly, nowadays, there is a new entertainment formula to sit in the car, make a body and abuse and threaten on social media. Now, whether you call it entertainment or stupidity, it is up to you. The Royal Rumble started with a charity match.  God of Cricket Sachin Tendulkar and player Akshay Kumar were among the stars. But the highlight was something else.  People were more interested in the two former winners of Bigg Boss, Munawar Faruqui and Elvish Yadav do? Trends on social media started and right wing supporters started abusing Elvish Why? We raised him up. Youth raised him He showed some sportsman spirit and tried to show some manners and hugged Munawar Faruqui And that's it. At this point, Hindu was in danger. I am not kidding. Because the people who came in danger, the influencers who came in danger, they had to say  that Elvish Yadav has earned his entire clout, online following, in the name of Hindutva. So why has he become secular? They are not wrong He has a slogan of Lord Ram in his videos. But talks very dirty. But people don't care. They were supporting Elvish, and suddenly they were trolling Elvish on the so called anti-Hindu activity this is not new for Elvish. He is always in controversy. Controversy means engagement, engagement means views, views means Rolls Royce Sometimes he is in the news for communal roast videos, sometimes he is in the headlines for snake venom rave parties  or to give sexist comments against women, or to give death threats - he is in headlines But Hindu has never come in danger from these small things. Elvish Bhai has supporter of former CM Khattar.   And not just the former CM, but also the big BJP politicians, union ministers, celebrities, Elvish Bhai was a favorite Now, that's a different thing that yesterday Noida Police spoke in front of Elvish Bhai and Elvish did not speak Elvish was called for investigation in snake venom case by Noida police He was sent to 14 days judicial custody According to police, if a case is filed against him under the Wildlife Protection Act, they say that they have got a lot of evidence against him  under the Narcotic Drugs and Psychotropic Substances Act 1985. and that Elvish has admitted that he had supplied snake venom  So, maybe he was doing this to earn some money.  Because those videos of singing were not enough to earn money. If found guilty of a crime, Elvish may be sentenced  to 10 years under NDPS Act.  If found guilty under Wildlife Protection Act, sentence of 3-7 years.  What this whole issue is ... we have already made a video on it. You can watch it. But let's come back to the biggest crime of his.  Which is unforgivable according to his followers.  Snake venom is a small thing. How did you upset your Hindutva warriors? How did you hug Munawar? Hindu-Muslim poison he was spreading. Business was going well. Gaining recognition too Then hugged Munawar Faruqui, who was already on the right wing's target. He had said sorry, but still no, still on the right wing's target. Then on social media, Elvish understood the experience of Munawar  Then on social media, trend started that Elvish is anti-Hindu. He has to apologize  A YouTuber Maxtern brother entered the scene. Maxtern brother said something but... can you speak in front of Elvish bhai? After this, Elvish brother beat Maxtern. But Maxtern also turned out to be very clever, very cunning.  He recorded the video. And you see the smartness of social media The video was also very smart and accurate. It was shared on social media.  The news reached the FIR. The talk was about arrests. Internet was divided ... some supported Maxtern and some supported Elvish - lots of views Amongst all this, a Twitter influencer named Random Sena jumped in. He was spreading anti-Hindu Elvish trend from the beginning.   He was saying that this is a very wrong thing and he was himself coming in limelight with Elvish. Now, this is what Random Sena does... Doxing people, abusing them, threatening them. All this in the name of Hindutva. But before the random army got more limelight, Elvish and Maxtern got patched up. They beat each other up, there was talk of arrest, murder charges, and suddenly, they started taking pictures with each other.  Followers were like, we have been giving our lives to these people and here they are getting their picture taken.  Maxtern got millions of followers in a few days.  Now, a fitness influencer named Rajat Dalal has done the patch up.  He is famous for abusing and beating people.  He went to Dehradun over a fight on internet But this problem ends on one side and starts on the other side. This time, the Kattar Hindu Elvish and Kattar Hindu Random Sena fight.  Elvish leaks their personal details. Random Sena also files 10 charges against Elvish Including abusing minor girls also. We don't have time to go into the garbage. You can go to the rabbit hole if you want. But basically, net-net, the fight between Random Sena and Rajat Dalal also starts. Random Sena commented on Rajat Dalal's surname.  Elvish even apologized to Hindu society before meeting Noida Police because he hugged Munawar. Just think, how stupidly this whole fight started and how far it has gone. If there was no Munawar, they would have found a reason to fight. Sometimes in the name of caste, in the name of language, abuse, in the name of state, or in the name of their own army.  Now see, this is how social media business works. Who cares about value addition Rajat Dalal's problem starts with Rajveer, another fitness influencer.   Rajveer lives in Ghaziabad. He can't back out. He has to protect reputation of Ghaziabad. So he also posted 5-10 videos in his car.  Some cow protectors also jumped in and threatened. They were all taking publicity for free.  Two of them were arrested for communal tension. Such anti-social elements are involved in social media war.  Threats, abuse and calling the boys to the scene.  Rajat Dalal was mobilizing the Jat community against Rajveer.  Rajveer was also making videos with his own people. Videos were being made to keep up the engagement and increase the number of followers.  In some video they are with a murdered. In another video there is name of gangster  In the end, the decision was made like in a sophisticated democratic society Open, contest should be fought.  The day was decided, the place was decided, but in the end? In the end, police woke up from sleep. JHajjar police tweeted, called both influencers, warned them and said that they will take action  And then, an apology video was released.  Because of video and post, Jhajjar police has done a legal action on me. And I accept my mistake for that. And I will not do anything like this in future.  Suddenly, the police raised a finger and the whole testosterone was gone.  Police officer Deepak Sharma also told the influencers in their style to stop shouting.  Influencers are also saying that they will time out after gaining followers and fame. Why are we telling you all this amid big electoral bond scene?  Because this is the truth of our country. So much has happened but our police and law enforcement machinery  watch this social media war day and night and don't say anything.   In the end, I mean, like in Bollywood, police is lost It is the same police that can catch a farmer, a student, a poor man, a vegetable seller, a cart owner in 2 minutes. But here, the issue becomes so serious. They talk about beating, cutting, abusing, violence, death threats, shooting. But after that, police finally woke up,  But whether it was about snake madam or fitness influencers, police were able to tighten the chhapri in 2 minutes I am sure there are many Indian fitness influencers from all communities who are doing a great job. But these few influencers who are promoting mob culture to grow themselves.  They are giving wrong examples to others and to millions of youths. By the way, there are many such things in the US. Online feuds are also happening there.  But the difference is that people know that it is a pretend fight. Here it is becoming an industry and it is becoming a bragging right that one is a murderer And it doesn't stop there. Gangsters are being dragged in the middle of all this.  Where threats of death are being given. Who is Don? This is being posted. Who has committed 56 murders? Who has committed 50 murders? This is being claimed. Real world crime is being made viral content. It will end with videos of truck turning over, shooting. Who will be affected by this? Youngsters This is a cycle of violence, hate, making goons heroes.  You saw how influencers were cheating people in education. Same thing happening. And to mock underprivileged communities is a very easy way to make profit in the name of content Mocking the weak, spreading hate, inciting violence, glorifying assault, all these things are happening in front of us.   If you don't watch this social media, you don't know what the youth is consuming on social media.  And the audience is enjoying it. And we are making this devil ourselves.  We made godi media, now see what the state of media is.  In the same way, we are making this devil on social media.   it will be very heavy on you and us. Because they will be the heroes of tomorrow.   So if your brothers and sisters follow such people, then tell them to study, become IAS. Forget chhapri influencers and ask yourself what you are getting by watching any influencer? Entertainment? Knowledge? Profit? Or have you become someone's army? They don't even care about you. Think about this."}]