[{"text": "- My strength lies not in my name, but in the backing of 1.4 billion Indians, and thousands of years of timeless culture\nand heritage. So, wherever I go, I carry with me the\nessence of thousands of years of Vedic tradition, the\ntimeless teachings of Swami Vivekananda, and the blessings, dreams, and aspirations\nof 1.4 billion Indians. When I shake hands with a world leader,\nit's not Modi, but 1.4 billion Indians\ndoing so. So, this isn't my strength at all. It is\nrather the strength of India. Whenever we speak of peace, the world\nlistens to us. Because India is the land of Gautama\nBuddha and Mahatma Gandhi. And Indians aren't hardwired to espouse\nstrife and conflict. We espouse harmony instead. We seek neither to wage war against\nnature, nor to foster strife among\nnations. We stand for peace. And wherever we can act as peacemakers, we\nhave gladly embraced that responsibility. My early life was\nspent in extreme poverty. But we never really felt the burden of\npoverty. You see, someone who is used to wearing\nfine shoes will feel their absence when they don’t\nhave them. But for us, we had never worn shoes in our\nlives, so how would we even know that wearing\nshoes was a big deal? We weren’t in a position to compare. That’s just how we lived. When I became Prime Minister, I specially\ninvited Pakistan to my swearing-in ceremony so we could turn over a new leaf. Yet, every noble attempt at fostering\npeace was met with hostility and betrayal. We sincerely hope that wisdom prevails\nupon them and they choose the path of peace. I believe even the people of Pakistan long\nfor peace. Look, regarding what you said about\ncriticism and how I deal with it, if I had to summarize in one sentence, I\nwelcome it. I have a strong belief that criticism is\nthe soul of democracy. I want to tell all young people the\nfollowing: No matter how dark the night may seem, it is still just night, and morning is\nbound to come. - The following is a\nconversation with Narendra Modi, the Prime Minister of India. It was one of the most moving\nconversations and experiences of my life. Allow me here to say a few words about it. Please skip ahead straight to\nour conversation, if you like. Narendra Modi's life story is incredible. He rose from poverty to lead a\nnation of 1.4 billion people, the biggest democracy in the world, where he won epic-scale elections\nfor Prime Minister three times. As a leader, he fought for\nideas that unite his nation of India, a nation that is composed\nof a large number of highly varied and\ndisparate cultures and peoples who have a long history marked by\nreligious, social, and political frictions. He's known for taking decisive,\nat times, controversial actions for which he's loved by hundreds of millions\nof people, and is also criticized by many. We discuss all of this at\nlength in this conversation. On the world stage,\nhe's respected as a peacemaker and friend by most major world leaders, even those\nwhose nations are at war with each other, from United States to China,\nto Ukraine and Russia, to Israel, Palestine, and the Middle East,\nand everywhere else. Now, at this moment in history,\nit's clear, at least to me, that the flourishing of human civilization\nhangs in the balance, with several wars on the brink of escalation\nto regional and even global conflict, rising tensions between nuclear powers, technological developments\nfrom AI to nuclear fusion that aim to completely transform\nsociety and geopolitics as we know it, and, of course, generally,\nincreasing political and cultural turmoil. So now more than ever,\nwe need great leaders, great peacemakers, who build\nbridges, not destroy them, who may preserve the\nidentity of their nations, but still celebrate the common\nhumanity of all of us, all people on Earth. For this and many other reasons,\nthis conversation with Prime Minister Modi was one of the most\nremarkable I've ever had. You may hear such words and think\nthat I'm just enamored by power or access. No, never was, never will be. I do not idolize anyone,\nespecially those in power. I'm generally skeptical\nof power, money, and fame because of their natural\ncorrupting influence on the mind, the heart, the soul of a person. The whole point of all the conversations I've had in my life, on mic and off mic, is that I try to see and\nexplore the full complexity of every human being,\nthe good and the bad. I believe we're all the same\nin a deep fundamental sense. All capable of good, all capable of evil, all carry stories of\npain and stories of hope, whether you're a world\nleader or a truck driver, a coal miner or a farmer\nin the American Midwest, and, by the way, I will be talking to a lot of the\nlatter kind of folk this year, off mic, and maybe even on mic, as I\ntravel the US and the world. My brief statements\nhere about Narendra Modi are about both him as a leader\nand especially him as a human being. In the extensive time I spent with him, I spoke with him off mic and on mic. It was a deeply personal human interaction characterized by warmth, kindness, humor,\ninner and outer peace, and absolute focus on the\nconversation between us in the present moment as\nif nothing else existed. I have heard from many people that he treats everyone he\nmeets in this empathic way, no matter where they come from, or what their position is in this world. So, for those and many other reasons, this really was an incredible experience\nI will never forget. Oh, and by the way, we made captions and\nvoiceover audio tracks available in English,\nHindi, and other languages. You can also listen to the original\nmixed-language version where I speak English and Prime Minister Modi speaks Hindi. Separately, you can choose to turn\non subtitles in your preferred language. On YouTube, you can switch\nbetween language audio tracks by clicking the Settings gear icon,\nthen clicking Audio Track, and then selecting the\nlanguage you prefer. For fully English overdub, select English, for fully Hindi overdub, select Hindi, and to listen to the original\nmixed-language version, where I speak English and Prime\nMinister Modi Speaks Hindi, please select Hindi Latin audio track. So you can listen either to a version\nthat is all one language, or to the original mixed-language version\nwith subtitles in your preferred language, the default is English overdub. All thanks to ElevenLabs and\na great team of translators, we do our best to bring the\nPrime Minister's voice to life with AI voice cloning in English. I promise that we will\ncontinue to work very hard to break down the barriers\nthat language creates, and try to make these conversations as accessible as possible\nto everyone in the world. Anyway, let me pause one more\ntime to say a big thank you. What a wild ride this life has been. It's an honor for me to be on\nit with all of you. I love you all. This is the \"Lex Fridman Podcast.\" And now, dear friends, here's\nthe Prime Minister of India, Narendra Modi. So, I should also say,\nI’m fasting right now. It’s been almost two days, 45 hours. So just water, no food, in honor of this\nconversation, just to get in the right mindset, get into\nthe spiritual level. I’ve read that you often\nfast for many days. Can you explain why you fast and where\ndoes your mind go when you fast? - First of all, I’m truly, pleasantly\nsurprised and honored that you’re fasting. All the more because it feels like you're\nfasting as a tribute of respect for me. So I express my deepest gratitude to you\nfor doing this. In India, our religious traditions are actually a\nway of life. Our Supreme Court once gave a brilliant\ninterpretation of Hinduism. They have stated that Hinduism is not\nabout rituals or methods of worship. But rather it is a way of living, a philosophy that guides life itself. And in our scriptures, there is deep discussion on elevating the body, mind, intellect,\nsoul, and humanity. They outline various paths, traditions,\nand systems to achieve this and fasting is one of them. But fasting alone isn’t everything. In India, whether you see it culturally or\nphilosophically, sometimes, I see that fasting is a way to\ncultivate discipline. If I put it in simple terms, or explain it to the viewers who are\nunfamiliar with India, it is a powerful tool to bring both the inner and outer\nself into balance. It shapes life in profound ways.\nWhen you fast, You may have noticed, as you said, you've\nbeen fasting on water for two days. Every single one of your senses, especially smell, touch, and taste, becomes highly sensitive. You may even notice the subtle aroma of\nwater itself, something you probably never noticed\nbefore when drinking it. If someone walks past you carrying tea, you will catch its aroma, just like you\nwould with coffee. A small flower you’ve seen before, you\nwill see it again today, but now, you can perceive its details more\nvividly. Your senses become extra sharp, highly aware, and\nfully tuned in. And uh, their capability, to observe and to respond, multiplies and\ngrows sharper. I have personally often experienced this. Another thing I’ve experienced is that\nfasting can greatly accelerate the thinking\nprocess and can, uh, give a fresh\nperspective. You start thinking outside the box. I don’t know if everyone experiences this,\nbut I certainly do. Most people assume that fasting simply\nmeans giving up food or not eating. But that’s just the physical aspect of\nfasting. If someone is forced to go without food\ndue to hardship, with an empty stomach,\ncan we call that fasting? Fasting is actually a scientific process. Whenever I fast for an extended period, I\nprepare my body in advance. For 5 to 7 days before the fast, I follow various Ayurvedic practices and\nyoga practices, along with other traditional cleansing\nmethods to internally reset my system. Before actually beginning the fast, I make sure to drink a lot of water, as\nmuch as possible. So, you could say that this detoxification\nprocess helps prepare my body in the best possible\nway. And once I begin fasting, for me, it’s an\nact of devotion. For me fasting is a form of\nself-discipline. For me, personally, even while I go about\ndoing my daily activities during a fast, my mind remains deeply introspective and\nfocused inward. And that experience is profoundly\ntransformative for me. My practice of fasting didn’t come from\nreading books, listening to sermons, or following a tradition just because my\nfamily happened to have observed it. It came from my own personal experience. During my school days, there was a movement inspired by Mahatma\nGandhi’s vision his vision of cow protection. The government had not enacted any laws at\nthe time. At the time, people across the country observed a one-day fast by gathering in\npublic places in silent protest. We were just kids, probably had just\nfinished primary school. Something inside me said, \"I should be\npart of this.\" And that was the first time in my life I\nexperienced fasting. At such a young age, I felt neither hunger\nnor any desire for food. Instead, I felt a new awareness, a surge\nof energy within me. So, I became convinced that fasting is a\nscience, far beyond just skipping meals. It is something far greater than that. Then, gradually, I refined my body and\nmind through various experiments. Over time, it became a long and\ndisciplined journey for me. And one thing is certain, fasting never\nslows me down. I work just as much as usual, sometimes I\neven work more. And another fascinating thing I’ve noticed\nis that when I need to express my\nthoughts, I’m amazed at where they come from and how\nthey flow. - Yeah. - It’s truly an incredible experience. - So you still do meetings with\nworld leaders, you still manage the affairs of India, you still carry out your role as a leader\non the world stage, all fasted and sometimes nine days? - Well, this practice has a long\nhistorical context. I hope it may be\ninteresting for those listening. There is an ancient tradition in India\ncalled Chaturmas. During the monsoon season, we know that\nthe digestion tends to slow down. And so, in this season, many people in India follow the practice\nof eating only a single meal within 24\nhours. For me, this starts around mid-June and\ngoes on until after Diwali, around November. For about four to four and a half months, I follow this tradition of eating only\nonce in 24 hours. Then comes the Navratri festival in India, which usually falls in September or\nOctober During this time, the whole country\ncelebrates Durga Puja, a festival of strength, devotion, and\nspiritual discipline. This lasts for nine days. During this time, I completely abstain\nfrom food and only drink hot water. Although, drinking hot water has always\nbeen a part of my daily routine. My past lifestyle was such that I\nnaturally developed this habit over time. Then, in March or April, another Navratri\noccurs, called Chaitra Navratri. This year, it will likely begin around\nMarch 31st. During this nine-day fast, I eat only one\nspecific fruit, once a day. So for those nine days, if let’s say I\nchoose papaya. then for all nine days, I won’t touch\nanything else, just papaya. That too I eat only once a day. That’s how\nI follow my nine-day fasting routine. So there are numerous fasts I keep\nthroughout the year, and this has become a\ndeeply ingrained tradition in my life. Perhaps I can say that I’ve been following\nthese practices for 50 to 55 years. - Has there been times when you met with a\nworld leader and completely fasted? And maybe what do they think about that? What do they think about your ability to\ndo that kind of thing? And you're right, I should mention that\nfrom even my two days, my ability to be\npresent, my ability to sense everything sharply\nfocus on this experience is elevated. But yes, is there stories with a world\nleader that maybe jumped to mind when you were\nfasted? - Well, most of the time, I don’t even let\npeople know about it. It’s my personal matter. So I never publicized\nit, but people gradually started finding out. It became known only after I became\nChief Minister and Prime Minister. Otherwise, it was purely personal. But now that it’s out in the open, I don’t\nmind sharing. If someone asks, I tell them so it might\nbe useful to them. Because it’s not my personal property. It’s my experience. And if that can help\nsomeone, why not share it? After all, my life has always been devoted\nto the well-being of others. For example, after I\nbecame Prime Minister, I had a bilateral meeting at the White\nHouse with President Obama, and he had also arranged a formal dinner. Then, as discussions between the two\ngovernments progressed, someone said, \"Please, join us for\ndinner.\" To which another replied, \"But the Prime\nMinister doesn’t eat.\" This left them a bit concerned. How do you host the leader of such a major\nnation at the White House without serving food? When we sat down, they brought me a glass\nof hot water. I turned to President Obama and jokingly\nsaid, \"Look, my dinner has arrived!\" as I placed the glass in front of me. Later, when I visited again, he still\nremembered. He smiled and said, \"Last time, you were\nfasting.\" This time, we're having lunch Since you're not fasting, you’ll have to\neat twice as much! - Let's go to the beginning. You rose from humble beginnings to lead\nthe world's largest democracy. So, I think there's a lot of people for\nwhom this is truly inspiring. Your family was of very modest means, and\nyou grew up in a one-room house with a mud floor, your whole family living\nthere. Tell me about your childhood. How did those humble beginnings shape your\noutlook on life? - My birthplace is in Gujarat, specifically in North Gujarat, in Mehsana\nDistrict, in a small town called Vadnagar. Historically, this town holds great\nsignificance. And so, Vadnagar is where I was born and\ncompleted my early education. Looking at the world as I\nunderstand it today, I can reflect on my childhood and\nthe unique environment I grew up in. My village had certain fascinating\naspects, some of which are quite rare,\neven globally. When I was in school, there was an elder\nin our village who would regularly tell students,\n\"Listen, kids, wherever you go, if you find a carved stone or you find a\nstone with inscriptions on it, or anything with engravings, bring it and\nplace it in this corner of the school. Over time, my curiosity grew, and I\nstarted to understand, I realized that my village had a rich and ancient history. Discussions at school often revealed more\nfascinating details about its past. Later, I learned that China even made a\nfilm about it. I had read in a newspaper about a film\nthat mentioned the Chinese philosopher Hiuen Tsang, who had spent a considerable amount of\ntime in my village, having arrived there many centuries ago. Back then, it was a major center for\nBuddhist learning. That’s how I first learned about it. And perhaps, around the 1400s, it was a\nprominent Buddhist educational hub. There was a Victory Monument from the 12th\ncentury, a temple from the 17th century, and in the 16th century, two sisters, Tana\nand Riri, who were renowned musicians. As I uncovered these history traces, I\ngrasped the depth of our heritage. So, when I became Chief Minister, I\ninitiated large-scale excavation projects. The findings from these very projects\nconfirmed that thousands of Buddhist monks\nhad, at one time, studied there. It was a place where Buddhist, Jain, and\nHindu traditions coexisted harmoniously. And, for us, history wasn’t just confined\nto books. Every stone spoke, every wall had a story\nto tell. And so when we began the large-scale\nexcavation work, we uncovered findings that hold immense\nhistorical significance. So far, they have discovered evidence\ndating back 2,800 years, proving that this city has remained\nunbroken and eternal for all those 2800\nyears. They have discovered solid proof of how\nits development unfolded over these\ncenturies. Now, an international-level museum has\nbeen established there, open to visitors Especially for archaeology students, it\nhas become a major area of study. So, the place where I was born holds its\nown unique historical significance. I see it as my good fortune; some things\nin life unfold beyond our understanding. Kashi became my realm of duty. Now Kashi is also eternal. Kashi, also\nknown as Banaras or Varanasi, is an eternal city that has remained\nvibrant and alive for centuries. Perhaps, it was some divine design that\nled a boy born in Vadnagar to eventually make Kashi his realm of\nduty, living in the embrace of Mother\nGanga. When I think about my family, my father,\nmy mother, my siblings, my uncles, aunts,\ngrandparents, we all grew up together in a\nsmall house. The place we lived was likely even smaller\nthan where we are sitting now. There was no window, just a small door. That’s where I was born, that’s where I\ngrew up. Now, when people talk about poverty, it’s natural to discuss it in the context\nof public life. And by those standards, my early life was\nspent in extreme poverty. But we never really felt the burden of\npoverty. You see, someone who is used to wearing\nfine shoes will feel their absence when they don’t\nhave them. But for us, we had never worn shoes in our\nlives, so how would we even know that wearing\nshoes was a big deal? We weren’t in a position to compare. That’s just how we lived. Our mother worked incredibly hard. My father, too.\nHe was extremely hardworking. And he was also extremely disciplined. Every morning, around 4:00 or 4:30 AM, he\nwould leave the house, walk long distances, visit several\ntemples, and then reach his shop. He wore traditional leather shoes,\nhandmade in the village. The shoes were very tough and sturdy, making a distinct ‘tok tok tok’ sound when\nhe walked. People in the village used to say that they could tell the time\njust by hearing his footsteps, \"Oh yes,\" they would say: \"Mr. Damodar is\non his way!\" Such was his discipline. He worked\ntirelessly, late into the night. Our mother, too, ensured that we never\nfelt the struggles of our circumstances. But despite everything, these challenging circumstances of living\nin scarcity never left a mark on our\nminds. I remember, in school, the idea of wearing\nshoes never even crossed my mind. One day, while I was on my way to school,\nI ran into my uncle on the way. He saw me and was surprised, \"Hey! You go\nto school like this? Without shoes?\" So at that time, he bought me a pair of\ncanvas shoes and made me wear them. Back then, they must have cost around 10\nor 12 rupees. But here's the thing, they were white canvas shoes,\nand they would quickly get stained. So what did I do? In the evening, after school was over, I\nwould stay back for a while. I would go from classroom to classroom, collecting leftover pieces of chalk that\nthe teachers had discarded. I would take the pieces of chalk home, soak them in water, mix them into a paste, and polish my canvas shoes with it, making\nthem bright white again. For me, those shoes were a treasured\npossession, a symbol of great wealth. And I don’t exactly know why, but from childhood, our mother was\nextremely particular about cleanliness. Perhaps that’s where we inherited that\nhabit too. Not sure how I picked up the habit of\ndressing neatly, but it’s been there since childhood. Whatever I wore, I made sure it looked\nproper. Back then, as you can imagine, we didn’t\nhave any arrangements for ironing clothes. So instead, I would heat up water in a\ncopper pot, hold it with tongs, and press\nmy clothes myself. Then, I’d head off to school. That’s how I lived, and I found joy in it. We never thought about being poor, or\njudged about how others lived, or what\ntheir struggles were. We lived carefree, enjoying whatever\nlittle we had, and kept working hard. Never once did we complain about these\nthings. And all these aspects of my life, whether\nyou call it fortune or misfortune, unfolded in such a way in politics that\nthey started coming to light. Because when I was taking my oath as Chief\nMinister, TV reporters went to my village,\nquestioned my childhood friends, went to capture videos of my home. That’s when people started asking, \"Who is this and what background\nhe is coming from?\" Before that, very few knew much about my\nlife. That’s just how my journey has been. My mother possessed an innate spirit of\ncaring for others' well-being, it was woven into the very fabric of her\nbeing. She possessed knowledge of traditional\nremedies and healing practices and would\ntreat children with these remedies. Every morning, before sunrise, around five\no’clock, she would start treating them. So, all the children and their parents\nwould gather at our home, little children\ncrying, and we had to wake up early because of it. Meanwhile, my mother would continue\ntreating them with care. This spirit of service, in a way, was\nnurtured through these experiences. A sense of empathy for society, the desire\nto do good for others, these values were instilled in me from my\nfamily. I believe that my life has been shaped by\nmy mother, my father, my teachers, and the\nenvironment I grew up in. - There's a lot of young people listening\nto this that are truly inspired by your\nstory. From those humble beginnings to the leader\nof the biggest democracy in the world. What can you tell to those young folks, who are struggling, who are lost in the\nworld, who are trying to find their way, what advice could you give them? - I want to tell all young people the\nfollowing: No matter how dark the night may seem, it is still just night, and morning is\nbound to come. That’s why we need patience and\nself-confidence. Yes, the challenges are real, but I am not\ndefined by my circumstances. I am here for a purpose, sent by a higher\npower. And I am not alone; the one who sent me is\nalways with me. This unwavering faith should always remain\nwithin us. Difficulties are a test of endurance; they\nare not meant to defeat me. Hardships exist to make me stronger, helping me grow and improve, not to leave\nme hopeless or discouraged. Personally, I see every crisis, every\nchallenge, as an opportunity. So, to all young people, I say, \"Have patience. There are no shortcuts in\nlife.\" At our railway stations, there hangs a\nsign for those who habitually cross the tracks\ninstead of using the bridge. It reads, \"Shortcut will cut you short.\" I would tell young people the same,\n\"Shortcut will cut you short.\" There are no shortcuts in life. Patience and perseverance are essential. Whatever responsibility we are given, we\nmust pour our heart into it. We should live it with passion, enjoy the\njourney, and find fulfillment in it. I truly believe that if this mindset is\ncultivated, it transforms life. Similarly, abundance alone is not enough,\nthere is no guarantee of success. Even a wealthy person who indulges in\ncomfort and idleness will eventually\nwither away. Instead, he must decide, \"Yes, I may have\nresources around me, but I must use my abilities to grow them\nfurther.\" I must contribute more to society with my\nown strength. Even if I am in a good position, there is\nstill so much more to do. Even if I am not in a good position, there\nis still so much work to do, that’s what I believe. I have also noticed that, some people tend\nto think, \"I've learned enough, that's it.\" But one should never let the student\nwithin them die. Learning should never\nstop. I believe that as long as I am alive, I\nmust have a purpose. Perhaps I exist to keep learning, to keep\ngrowing. Now, my mother tongue\nis Gujarati, and We were not very familiar with the Hindi\nlanguage, nor did we know how to speak it eloquently\nor communicate effectively. But as a child, I used to sit at my\nfather’s tea shop. And at that young age, I got the chance to\nmeet so many people. And every time, I learned something from\nthem. I observed their ways of speaking, their\nexpressions, these things taught me a lot. Even though I wasn’t in a position to\napply it then, I thought, \"If I ever get the chance, why\nnot?\" \"Why shouldn’t I present myself\nwell?\" So, I believe the desire to learn should\nalways remain alive. And uh, another thing I’ve observed is\nthat most people dream about achieving something or\nbecoming someone. They set big targets, and when they fall short, they feel\ndisappointed. That’s why, whenever I get a chance to\ntalk to my friends, I tell them: \"Instead of dreaming about getting and\nbecoming, dream of doing something.\" If you focus on 'DOING' something, and let’s say your goal is to reach ten,\nbut you make it to eight. you won’t feel discouraged. You’ll still\nwork toward ten with determination. But if your dream is only to become\nsomething and it doesn’t happen, even your achievements may feel like a\nburden. That’s why we must adjust our mindset in\nlife. Instead of thinking about what I got or\ndidn’t get, the mindset should be, \"What\ncan I give? Because true contentment doesn’t bloom on\nits own; it grows from the depths of what\nyou give. - And I should say that this young kid,\none of the things I dreamed of doing is to do this very thing to talk to you\ntoday. So this is a very surreal. At 17, another fascinating part of your\nlife, you left home and spent two years roaming\nin the Himalayas, searching for purpose, for deeper truth,\nfor God. So not much is known about this period of\nyour life. You lived a nomadic, minimalist existence\nvery much like a yogi. often sleeping without a roof on your head, what are some memorable spiritual moments,\nrituals, experiences from that time? - It seems like you’ve put in a lot of\neffort. Look, I …. Look, I don’t usually talk much about\nthis, but I can share a few external\naspects of it. I grew up in a very small town. Our life\nwas all about being part of a community. We lived among people, surrounded by them,\nthat was just how life was. There was a library in the village, and I\nused to go there often to read books. Whenever I read something from the books,\nI often found myself feeling inspired, thinking, why shouldn't I shape my own\nlife like that? That desire was always there. When I used to read about Swami\nVivekananda or read about Chhatrapati\nShivaji Maharaj, I would often wonder: how did they live?\nHow did they build such remarkable lives? And for that, I constantly experimented on\nmyself. Most of my experiments were physical in\nnature, testing my body’s limits. For example, where I lived, winters\nweren’t too harsh, but December nights could get quite cold. But still, at night the cold would bite, it was natural. So, sometimes, I would decide to sleep\noutside in the open, with nothing to cover myself, just to see\nhow my body endures the cold. So, from a very young age, I would often\nexperiment with my body, and uh, this became a regular thing for\nme. For me, going to the library, reading extensively,\nvisiting the pond, washing the family’s clothes, and swimming\nbecame part of my routine. Swimming was my main physical activity. All of these things were deeply connected\nto my life. Later, as I read Vivekananda, I became\neven more drawn to his teachings. One time, I read about Swami Vivekananda.\nHis mother was ill, so he went to Sri Ramakrishna Paramahamsa\nfor guidance. He would argue with him, debate with him. In his early days, he would often argue with him, questioning\neverything intellectually. He said, “My mother is sick. If I were\nearning, I could take better care of her.” Sri Ramakrishna said, \"Don't bother me\nwith all this.\" Go to Goddess Kali. She is there. Ask her\nfor what you need.” And so, Swami Vivekananda went and\nsat before Goddess Kali's idol for hours, and he\nimmersed himself into deep meditation. After a few hours, when he returned, Ramakrishna asked him, \"So, did you\nrequest the goddess?\" Swami Vivekananda replied, \"No, I didn’t.\"\nRamakrishna said, \"Go again tomorrow. She will fulfill your request. Ask her!\" He went the next day, and then again the\nday after. But each time, he found himself unable to ask for anything. His mother was\nunwell, and he needed help, but when he sat before Goddess Kali, he\nwas completely absorbed in her presence. And yet, he could not bring himself to ask\nfor anything. Each time, he returned empty-handed. He told Sri Ramakrishna, \"I came back\nempty-handed. I didn’t ask for anything.\" To stand before the Divine Goddess and not\nbe able to ask for anything, that moment, that experience, lit a flame\ninside him. There was a spark in his life, and from\nthat came the spirit of giving. I believe that perhaps that small incident in Vivekananda's life\nleft an impression on me too, the thought of ‘What can I give to the\nworld?’ Maybe true contentment comes from giving. If my heart is only filled with the hunger\nto receive, that hunger will never end. And within that realization came the idea\nof Shiva and living beings as one, If you wish to serve Shiva, serve all\nliving beings. Recognize the unity between the divine and\nthe living. True non-duality is experienced through\nthis realization. I would often lose myself in such\nthoughts, my mind naturally drifting in that\ndirection. I remember an incident, in the neighborhood where we lived, just outside,\nthere was a Lord Shiva temple. One day, a saint came to stay there. So that saint used to engage in meditation\nand spiritual practices. I started feeling drawn to him, thinking perhaps he possessed some\nspiritual energy. I had only read about Swami Vivekananda,\nnever seen such figures in real life. During Navratri, he was fasting, and he had placed Sorghum grains on his\nhand, a common tradition in our culture. In a way, sprouting seeds on your palms and sleeping like that for nine or ten\ndays. It was a kind of spiritual vow, and this\nsaint was observing it. During those same days, my maternal uncle’s family was\npreparing for my aunt’s wedding. Everyone from my home was going to my\nuncle’s house for the wedding. Now, for any child, visiting an uncle’s\nhouse is always exciting. But I told my family, \"I’m not going.\nI’ll stay here, and I will take care of Swamiji.\" Since he has these grains on his hand, he\ncan't eat or drink. So, I will take care of him. So, as a child, I chose not to attend the\nwedding. I stayed back, serving Swamiji instead. Somehow, my mind was naturally drawn in\nthat direction. At times, whenever soldiers from my\nvillage came home during their holidays, They would walk around in their uniforms\nwith such pride. I would run behind them all day, thinking,\n\"Look at them! They are serving the nation.\" So there was always a strong feeling\ninside me to do something meaningful. I didn’t fully understand what it would\nbe, and I didn’t have a roadmap. There was a hunger within me, a deep longing to understand life,\nto explore its meaning. So, I just set out and\nbegan the journey. During my time in the mission, I came across remarkable saints. They\nshowered me with love and blessings. Among them, I formed a special bond with\nSwami Atmasthananda Ji. He lived for nearly a hundred years, a\nlife full of wisdom and service. In his final years, I deeply wished for him to stay with me at\nthe Prime Minister’s residence. But his responsibilities were vast, and he\ncouldn’t come. However, back when I was Chief Minister,\nhe used to visit, and I was fortunate to receive his\nblessings and guidance. He once looked at me and said, \"Why have you come here? You have a\ngreater purpose to fulfill.\" \"Is your priority your own well-being, or\nis it the welfare of society?\" Whatever Swami Vivekananda said was for\nthe betterment of society. He said, \"You are meant to serve others.\" So I…. I remember feeling a bit disheartened at\nthat moment, I had come seeking guidance, but all I got\nwere words. So, I continued on my journey, wandering\nfrom place to place. I spent time in the Himalayas, embracing\nthe solitude of the mountains. I met many remarkable individuals along\nthe way, some were great ascetics, people who had\nrenounced everything. But still, my mind remained\nrestless. Perhaps it was my age of curiosity, of\nwanting to learn, to understand. It was a new experience, a world shaped by the mountains, by ice,\nby the towering snow-covered peaks. But all of this played a huge role in\nshaping me. It strengthened me from within and enabled\nme to discover my inner power. Practicing meditation, waking up in the\nsacred pre-dawn hours, bathing in the cold,\nserving people with devotion, and naturally tending to elderly saints,\nbecame a seamless part of who I was. Once, a natural calamity struck the region, and I immediately devoted myself\nto helping the villagers. So these were the saints and spiritual\nmasters with whom I stayed from time to\ntime. I never remained in one place for long. I\nkept moving, constantly wandering. That was the kind of life I lived. - And for people who don't know that\nmoment in Ramakrishna mission ashram with with the monk Swami Atmasthananda, as you\nmentioned. He helped steer you towards the life of\nservice. So there is another possible life that\ncould have been where you take sanyasa, you give away everything and you are a\nmonk. So we could have had a monk Narendra Modi\nand a prime minister Narendra Modi. And he helped you take the decision to\nlive a life of service at every scale. - From the outside, people may call me a\nleader, some call me the Prime Minister, others call me the Chief Minister, and that's how they see me\nfrom their perspective. But deep within, there is only an\nunwavering spiritual commitment. The Modi who lovingly helped his mother\ncare for children during their treatments, tending to them with patience and\ncompassion, the Modi who wandered through the\nHimalayas, and the Modi who now works from this seat\nof responsibility, they are all tied together by the same\ninner consistency. Every action is dedicated to serving\nothers. People may see a stark difference between\na saint and a leader but to me, there is no real difference. Yes, the attire changes, the way of life\nchanges, the words spoken throughout\nthe day shift, and the nature of work evolves. But the core of my being remains\nunchanged, carrying out every responsibility with\nthe same sense of calm focus and dedication. - Another part of your life of who you are\nis you've spoken your whole life about putting your nation of India above\nall else. When you were eight, you joined the RSS, which espouses the idea of Hindu\nnationalism. Can you tell me about RSS and what impact\nthey had on who you are and the development of your\npolitical ideas? - Ever since childhood, I always had the habit of staying engaged\nin something or the other. I remember there was a man named Makoshi,\nI don’t quite recall his full name, I think he was part of the service group,\nMakoshi Soni or something like that. He used to carry a small drum-like\ninstrument called a tambourine with him. And he used to sing patriotic songs in his\ndeep, powerful voice. Whenever he came to our village, he would\nhold programs in different places. I would run after him like a crazy fan,\njust to listen to his songs. I would spend entire nights listening to\ntheir patriotic songs. I enjoyed it I don’t even know why, but I just did. In our village there was a branch of the\nRashtriya Swayamsevak Sangh, where we played sports and sang patriotic\nsongs. Something about those songs touched me\ndeeply; they stirred something inside me. And that’s how I eventually became part of\nthe RSS. One of the core values that were\ninstilled in us at RSS was whatever you do, do it with a\npurpose. Even while studying, study with the goal\nof learning enough to contribute to the\nnation. Even when you exercise, do it with the purpose of strengthening your body to\nserve the nation. This is what we were taught. And today,\nRSS is a massive organization. It is now nearing its 100th anniversary. Such a massive volunteer organization likely doesn’t exist anywhere else in the\nworld Millions of people are connected to it. But understanding RSS is not that simple. One must make an effort to truly grasp the\nnature of its work. More than anything, the RSS provides you\nwith a clear direction toward what can truly be called a purpose\nin life. Secondly, the nation is everything, and\nserving the people is akin to serving God. This is what has been said since the Vedic\nera, what our sages have said, what Vivekananda\nsaid, and what the RSS echoes. A volunteer is told that the inspiration\nhe gains from RSS, it’s not just about attending the one-hour\nsession or wearing the uniform. What matters is what you do for society. And today, inspired by that spirit, many\ninitiatives are thriving. Like some volunteers established an\norganization called Seva Bharti. This organization serves the slums and\nsettlements where the poorest people live, which they call service communities. To my knowledge, they run approximately one hundred and\ntwenty-five thousand service projects, without any government assistance,\nsolely through community support. They spend time there,\nteach the children, care for their health,\ninstill good values, and work towards improving cleanliness in\nthese communities. Running 125,000 social service projects is\nno small feat. Similarly, some volunteers, nurtured by\nRSS, are dedicated to serving tribal\ncommunities through Vanvasi Kalyan Ashram. They live among the tribal people, working\nfor their welfare. They have established over 70,000 one\nteacher schools, in remote tribal regions. There are also some people in America who\nshow there support for this cause, and contribute donations of\nabout $10 or $15. And they say, ‘Skip a Coca-Cola\nthis month, don't drink Coca-cola and donate that money to a One Teacher\nschool instead. Now imagine, 70,000 one teacher schools\ndedicated to educating tribal children. Some volunteers have founded\nVidya Bharati to revolutionize education. Today, they run nearly 25,000 schools, educating around 3 million students, and I believe that millions of students\nhave benefited from this initiative, receiving quality education at an\nincredibly low cost. Alongside education, values are\nprioritized, and students remain grounded, learning skills so they don’t become a\nburden on society. That is, in every aspect of life, whether it’s women, youth, or even\nlaborers, the RSS has played a role. In terms of membership size, if I may say\nso, we have The Indian Labor Union. It has around 50,000 unions, with millions\nof members across the country. Perhaps, in terms of scale, there is no\nbigger labor union in the world. But what’s interesting is the approach\nthey take. Historically, leftist ideologies have\nfueled labor movements worldwide. And what has been their slogan? \"Workers of the world, unite!\" The message was clear, unite first, and\nthen we’ll deal with everything else. But what do the labor unions run by\nRSS-trained volunteers believe in? They say, \"Workers unite the world.\" Others say, \"Workers of the World Unite.\" and we say \"Workers Unite the World.\" It may seem like just a small shift in\nwords, but it represents a huge ideological\ntransformation. The volunteers who come from the RSS follow their own interests,\nnature, and inclination and in doing so, they strengthen and\npromote these kinds of activities. When you observe these initiatives, you’ll see how, over the past hundred\nyears, the RSS has dedicated itself with the discipline\nand devotion of a seeker, staying away from the glare of mainstream\nattention. I feel blessed to gain life’s values from\nsuch a sacred organization. Through the RSS, I found a life of\npurpose. Then, I was fortunate to spend some time\namong the saints, which gave me a strong spiritual\nfoundation. I found discipline and a life of purpose and through the guidance of saints, I\ngained spiritual grounding. Swami Atmasthananda and others like him\nhave held my hand throughout my journey, constantly guiding me at every step. The teachings of Ramakrishna Mission,\nSwami Vivekananda, and the service-driven philosophy of the\nRSS have played a crucial role in shaping me. - But they've also helped push the idea of\nIndia. What is the idea that unifies India? What\nis India as a nation? What is the foundational idea that unites all of these disparate worlds and\ncommunities and cultures? What would it be? - Look, India is a cultural identity. It is a civilization that dates back\nthousands of years. Consider the vastness of India, over a hundred languages, thousands of dialects. India is so diverse that we have a saying, that every twenty miles the language\nchanges. Customs change, cuisine changes, even clothing styles shift\nfrom region to region. From the south to the north, you will see\nimmense diversity across the country. But if you dig a little deeper, you will\nfind a common thread. For example, the stories of Lord Ram can\nbe heard everywhere in India. His name echoes in every corner of the\ncountry. But if you look closely, from Tamil Nadu\nto Jammu and Kashmir, you will always find people whose names\ninclude ‘Ram’ in some form. In Gujarat, he might be called ‘Ram Bhai,’ in Tamil Nadu, ‘Ramachandran,’ in\nMaharashtra, ‘Ram Bhau.’ This unique cultural bond is what unites\nIndia as one civilization, Take something as simple as bathing in water. We have a ritual where all the rivers of\nIndia are remembered. They chant: \"I am bathing\nwith the waters of all these\nrivers.\" Ganga, Yamuna, Godavari, Saraswati,\nNarmada, Sindhu, Kaveri, It's a sentiment that unites a nation. And\nwe have a long tradition of making such resolutions at the beginning\nof important events and rituals. And the resolution itself can present a\nhistorical record. And, in so doing, serve as a way of\ncollecting and preserving historical data. It has been an incredibly unique system,\nguided meticulously by our scriptures. When someone makes a resolution performs a\npuja, or even during weddings, we start by invoking the entire universe, beginning with Jambudweep, Bharatkhand,\nAryavrat, and gradually narrow it down to the\nvillage, then mentioning the specific\nfamily, and finally, we invoke the family deity. This practice is still alive, happening\ndaily in every corner of India. But sadly, the Western and global models\nbegan viewing nations only as administrative systems. India, however, has had a variety of\nadministrative systems throughout history. Many systems were fragmented, scattered,\nand varied across regions. Kings and rulers were numerous, but India's unity lay\nin cultural bonds. Pilgrimage traditions played a key role in\npreserving this unity. Shankaracharya established the four\npilgrimage sites. Even today, millions of people travel from\none place to another for pilgrimage. In Kashi, you’ll find people who bring\nwater from Rameshwaram to Kashi and take water from Kashi to Rameshwaram. Even if you look at our Hindu calendar, you’ll find so many things across the\ncountry that you can’t even imagine. - If we look at the historical foundation\nof modern India, along with yourself, Mahatma Gandhi is one of the most important humans\nto have ever lived. But certainly one of the most important\nhumans to the history of India. What do you admire about Mahatma Gandhi? - As I had mentioned before, I was born in Gujarat,\nand Gujarati is my mother tongue. Mahatma Gandhi was also born in Gujarat.\nHis native language was Gujarati, too. He pursued a career as an attorney and\nlived overseas for several years. He had plenty of great opportunities. But the deep sense of duty within him, along with the values instilled\nby his family, led him to give up all comforts and devote\nhis life to serving the people of India. He joined the struggle for India’s\nindependence. And to this day, he continues to deeply\ninfluence the life of every Indian in some\nway. Mahatma Gandhi tried to live by his\nprinciples, and practiced what he\npreached. For example, he strongly advocated for\ncleanliness and practiced it himself. And he made it a point to discuss\ncleanliness wherever he went. Another key factor to consider is India's\nfight for independence. India was ruled by the Mughals, the British, and\nseveral other foreign powers. Despite being bound by the shackles of\ncolonial rule for centuries, the flame of independence burned brightly in every corner and nook of India, never\nfading, always fueling the desire for freedom. Millions of people sacrificed their lives\nso the light of freedom could shine on India They laid down their lives for freedom, sacrificing their youth\nbehind prison walls. Mahatma Gandhi also fought for India’s\nindependence, but in his own way. Indeed, the other freedom fighters were\nbrave warriors, and devoted sons of Mother\nIndia. They came, they fought, and their\nmartyrdom immortalized them. And they did indeed have a lasting impact. But it was Mahatma Gandhi who awakened a\nnation, leading a mass movement fueled by\ntruth. And he wove even a sweeper into the very\nfabric of the freedom struggle. He told teachers their work was part of\nthe freedom struggle. He told the people spinning thread and\nweaving clothes they were freedom\nfighters. He told those tending to lepers that their\nservice was a step toward India’s freedom. He viewed every task as a vital thread in\nthe fabric of India’s independence movement. And this transformed India's common man\ninto a soldier in the quest for freedom. Gandhi forged a mass movement so immense\nthat the British could never fully grasp it. The British never imagined that a pinch of\nsalt from the Dandi March could spark a massive revolution,\nand he made it happen. And his life, presence, style, mannerisms, all left a profound impact. And I have seen many of his stories evolve\ninto timeless legends. I recall an incident from a Round Table\nConference. Yeah, I believe he was attending a Round\nTable Conference. He was supposed to meet King George at the\nBuckingham Palace. Draped in his breechcloth, Mahatma Gandhi\nmade his way to the palace. Many people were amazed that he had showed\nup in that attire to meet the King. Gandhi remarked he didn’t need to wear a\nlot of clothes. He said, \"Your King is wearing enough\nclothes for the both of us.\" This was the whimsical charm of his\nnature. Mahatma Gandhi possessed many remarkable\nqualities. His call for unity\nand recognition of the people's strength\nstill resonates with me. In everything I do, I strive to include\nthe common man and to ensure the participation of as many\nas possible. I don't believe in leaving everything to\nthe government. I am a firm believer in the power of\nsocial change. - So, he was probably one of the greatest\nleaders of the 20th century. You are one of the greatest leaders of the\n21st century. Those two centuries are very different. And you have been masterful in the game,\nin the art of geopolitics. So, let me ask you—you have found a\nbalance. So, when negotiating on the world stage\nwith super powerful nations, is it better to be loved or feared? It seems like you are a master class of\nbeing loved by everybody, but everybody knows and feels the\nstrength. So, finding that balance—can you speak to\nthat balance? - First and foremost, I don't think this\nis a fair comparison. Mahatma Gandhi wasn't just a twentieth-century leader. His relevance\ntranscends centuries. Mahatma Gandhi's legacy will last for\ncenturies to come, and he remains relevant\nto date. As far as I am concerned, I have a\nresponsibility to fulfill. Yet, the weight of that responsibility\npales in comparison to my country. I am nowhere near as great as my country. And my strength lies not in my name, but in the backing of 1.4 billion Indians, and thousands of years of timeless culture\nand heritage. So, wherever I go, I carry with me the\nessence of thousands of years of Vedic tradition, the\ntimeless teachings of Swami Vivekananda, and the blessings, dreams, and aspirations\nof 1.4 billion Indians. When I shake hands with a world leader,\nit's not Modi, but 1.4 billion Indians\ndoing so. So, this isn't my strength at all. It is\nrather the strength of India. You see, I recall something that\nhappened all the way back in 2013. It was when my party declared I would be\ntheir Prime Ministerial candidate. My critics often tried to corner me on one\npoint. It became a topic of widespread\ndiscussion. \"Modi is nothing more than a\nstate leader.\" \"What does he know of foreign policy? Does\nhe even understand global geopolitics?\" This was on everyone's lips, and I was\nasked this question in every interview. I gave a very well thought-out answer at\nthe time. I said, \"I won’t lay out my entire foreign\npolicy in an interview, nor is it needed.\" That said, India will neither allow itself\nto be looked down upon, nor will it ever\nlook up to anyone, India will now see eye-to-eye with her\ncounterparts. This was my belief in 2013, and it still\nlies at the heart of my foreign policy. For me, the country always comes first. However, to belittle someone, or speaking\nill of others, is neither part of my\ncultural values, nor my traditions. Moreover, our culture upholds and\nadvocates for the welfare of mankind. India has always championed the ideas of\nglobal peace and brotherhood. For centuries, we have envisioned the\nworld as one big family. Our noble ancestors envisaged the welfare\nof the whole world and universe. And that’s why you must have noticed, the\nnature of our conversations as well as the ideas, that I have\npresented on the global stage, which are\nrooted in respect and positivity. For example, I spoke about the\nenvironment in one of my speeches. I proposed the concept of One Sun, One\nWorld, One Grid. During the COVID pandemic, I delivered a\nspeech at the G-20 Summit. I put forth the vision of One Health, where humans and nature would live in\nharmony. And I have always worked towards this. We hosted the G-20 Summit with the motto,\n\"One Earth, One Family, One Future.\" We have inherited this\ntimeless wisdom, and it's our duty to\nshare it with the world. To give you an example, I have advocated\nfor embracing renewable energy. We founded the International Solar\nAlliance with the motto, \"One Sun, One\nWorld, One Grid.\" Even when it comes to global healthcare, I\nhad proposed \"One Earth, One Health\". This initiative extends not only to humans\nbut also to all flora and fauna. I have always aimed to initiate efforts\nthat foster global well-being. And the global community needs to join\nhands to accomplish that. We must also understand that the world has\nbecome one small village today. No country can thrive in isolation. Today, we all depend upon one another. No one can make it far by themselves. That is why you must learn to synchronize\nwith everyone. And everyone else must learn to\nsynchronize with you. That's the only way to propel this\ninitiative forward. Organizations like the United Nations came\ninto being after the First World War, but they failed to evolve with the times. And this inability to adapt has sparked a\nglobal debate on their relevance. - You have spoken about— You have the experience, you have the\nskill, you have the geopolitical leverage to be the biggest peacemaker in the world\ntoday, on the world stage, and there are several wars going on. Can you, maybe, explain how you approach\nthe process of making peace, helping make peace between two warring\nnations? For example, Russia and Ukraine. - Well, I represent the country that is\nthe land of Lord Buddha. I represent the country that is the land\nof Mahatma Gandhi. These are the great souls whose teachings,\nwords, actions, and behavior are entirely\ndedicated to peace. And that is why, culturally and\nhistorically, our background is so strong that whenever we speak of peace, the world\nlistens to us. Because India is the land of Gautama\nBuddha and Mahatma Gandhi. And Indians aren't hardwired to espouse\nstrife and conflict. We espouse harmony instead. We seek neither to wage war against\nnature, nor to foster strife among\nnations. We stand for peace. And wherever we can act as peacemakers, we\nhave gladly embraced that responsibility. Returning to your example, I have a close relationship with\nRussia and Ukraine alike. I can sit with President Putin, and say\nthat this is not the time for war And I can also tell President Zelensky, in\na friendly way, that brother, regardless of how many\npeople stand with you in the world, there will never be a resolution on the\nbattlefield. The resolution will only come when both Ukraine and Russia\ncome to the negotiating table. Ukraine may hold countless discussions\nwith their allies, but it will bear no fruit. Discussions must include\nboth parties instead. Initially, it was challenging to find\npeace, but now, the current situation presents an\nopportunity for meaningful and productive\ntalks between Ukraine and Russia. There has been a lot of suffering. Even\nthe Global South has suffered. The world has been grappling with a food,\nfuel, and fertilizer crisis. So, the global community should unite in\nthe pursuit of peace. As for me, I have always maintained that I\nstand with peace. I am not neutral. I have a stance, and\nthat is peace. And peace is what I strive\nfor. - Another difficult, historic relationship\nand conflict is between India and\nPakistan. So, it's one of the most tense conflicts\nin the world. Two nuclear powers with strong ideological\ndifferences. You are a great peacemaker. Looking out\ninto the future as a visionary, what do you see is the path for\nfriendship, for peace, for good relations\nbetween India and Pakistan? - I would like to delve into periods of\nour history the world may be unfamiliar\nwith. Before 1947, during the struggle for\nindependence, everyone was fighting side\nby side, shoulder to shoulder. And the nation was eagerly waiting to\ncelebrate the freedom, the joy of\nindependence. Now, we could have a lengthy discussion on what led to the events that unfolded. But the fact remains that the policymakers\nof the time agreed to India's partition. And they agreed to the Muslim side's\ndemand of carving out a separate nation. With hearts weighed down by grief and\nsilent tears, Indians embraced this\npainful reality. However, what unfolded was an immediate,\nheartbreaking saga of bloodshed. Trains filled with bloodied,\nwounded people  and corpses started arriving from Pakistan. It was a harrowing sight. After getting their own way, we expected\nthem to live and let live. And yet, they chose not to foster a\nharmonious coexistence. Time and again they decided to be at odds\nwith India. They have waged a proxy war against us. Don't mistake this for ideology. What kind of ideology thrives on bloodshed\nand the export of terror? And we are not the sole victims of this\nmenace. Wherever terror strikes in the world, the trail somehow\nleads to Pakistan. Let's take the September 11 attacks for\nexample. The main mastermind behind it,\nOsama Bin Laden, where did he eventually emerge\nfrom? He had taken refuge in Pakistan. The world has recognized that, in a way, terrorism and\nthe terrorist mindset are deeply rooted in Pakistan. Today, it stands as an epicenter of turmoil,\nnot just for India, but for the world. And we have repeatedly asked them what\ngood can come from this path? We have urged them to abandon the path of\nstate-sponsored terrorism for good. What do you hope to gain by surrendering\nyour nation to lawless forces? I've even personally traveled to Lahore in\nthe pursuit of peace. When I became Prime Minister, I specially\ninvited Pakistan to my swearing-in ceremony so we could turn over a new leaf. Yet, every noble attempt at fostering\npeace was met with hostility and betrayal. We sincerely hope that wisdom prevails\nupon them and they choose the path of peace. I believe even the people of Pakistan long\nfor peace. Because even they must be weary of living\nin strife and unrest. They must have grown weary of relentless\nterror, where even innocent children are\nkilled and countless lives are destroyed. - Are there any memorable stories from\nyour past attempts to try to improve relations with Pakistan\nthat could guide the path forward into the\nfuture? - Like I mentioned, my first attempt at\nimproving bilateral relations was when I invited my Pakistani counterpart to\nmy swearing-in. It was a gesture of\ngoodwill. It was a diplomatic gesture unlike any in\ndecades. The very people who once questioned my\napproach to foreign policy were taken aback when they learned I had invited all\nSAARC heads of state. And our then President, Mr. Pranab\nMukherjee, beautifully captured that historic gesture\nin his memoir. This was a testament to how clear and\nconfident India's foreign policy had become. This sent a clear message to the world about India's commitment to\npeace and harmony. But we didn't get the desired outcome. - Maybe to ask a little bit of a lighter\nquestion, who has the better cricket team, India or\nPakistan? The two teams have a epic rivalry on the\npitch and more seriously given the geopolitical\ntensions that you spoke to, what role do sports and cricket and football play in fostering better\nrelations? - I think sports have the power to\nenergize the entire world. The spirit of sports brings people\ntogether across different nations. That’s why I would never want to see\nsports being discredited. I truly believe that sports play a major\nrole in human evolution, they’re not just games; they connect\npeople on a deeper level. Now, coming to the question of who’s\nbetter and who’s not. When it comes to techniques in sports,\nI’m not an expert. Only those who specialize in the technical\naspects can judge which techniques are superior and who the\nbest players really are. But sometimes, the results speak for\nthemselves. Just a few days ago, India and Pakistan\nplayed a match. The result reveals which is the better\nteam. That’s how we know. - Yeah, I've, I've watched the series\ncalled the greatest rivalry, India vs. Pakistan, that describes so many\nincredible players, so many incredible games. It's, it's always beautiful to see a great\nrivalry. You've also spoken about football.\nFootball is very popular in India. So another tough question, who is the\ngreatest football player of all time? We've got Messi, Pelé, Maradona,\nCristiano Ronaldo, Zidane. Who do you think is the greatest football\nplayer to have ever played? - It’s absolutely true that many regions\nin India have a strong football culture. Our women’s football team is performing\nreally well, and the men’s team is also making great\nprogress. But if we talk about the past, back in the\n1980s, one name that always stood out was\nMaradona. For that generation, he was seen\nas a true hero. And if you ask today’s generation, they’ll\nimmediately mention Messi. Now that you’ve asked, another interesting\nmemory just came to mind. There’s a state in India called Madhya\nPradesh, right in the center. There’s a district called Shahdol, a completely tribal region where a large\ntribal community resides. I really enjoy interacting with people\nfrom such communities, especially the self-help groups run by\ntribal women. So, I decided to visit them and have a\nconversation. But when I got there, I noticed something\nfascinating, around 80 to 100 young boys, kids, and even some\nolder youth, all dressed in sports uniforms,\nstanding together. Naturally, I walked over to them. So, I asked them,\n\"Where are you all from?\" And they replied,\n\"We’re from Mini Brazil!\" I was surprised and said,\n\"What do you mean by Mini Brazil?\" They said,\n\"That’s what people call our village.\" Curious, I asked,\n\"Why do they call it Mini Brazil?\" They explained, \"In our village, football\nhas been played for four generations. Nearly 80 national-level players have come\nfrom here. Our entire village is dedicated to\nfootball. They also told me, \"When we host our\nannual football match, nearly 20 to 25 thousand spectators come\nfrom nearby villages to watch. I see the growing craze for football in\nIndia these days as a positive sign because it not only fuels passion, but\nalso builds true team spirit. - Yeah, football is one of the great\nsports that unites not just India, the whole world, and that, that just shows\nthe power of what sport can do. You recently visited the United States and, reinvigorated your friendship with\nDonald Trump. What do you like about Donald Trump as a\nfriend, as a leader? - I'd like to share with you an event that\nstands out in my memory. Perhaps from that, you'll get a better\nunderstanding of the point I'm trying to convey. For example, we had an event\nin Houston, Howdy Modi. Both President Trump and I were there, and\nthe entire stadium was completely packed. A massive crowd at an event in the U.S. is\na huge moment. While packed stadiums are common in\nsports, this was extraordinary for a political\nrally. The Indian diaspora had gathered in large\nnumbers. Both of us delivered speeches, and he sat\ndown below, listening to me speak. Now, that’s his humility. The President of the United States sitting\nin the audience, while I spoke from the stage that was a\nremarkable gesture on his part. After finishing my speech, I stepped down. And as we all know, security in the U.S.\nis extremely strict and thorough The level of scrutiny there is on a\ncompletely different level. I went over to thank him,\nand casually said, \"If you don’t mind, why don’t we take a\nlap around the stadium? There are so many people here, let’s walk,\nwave, and greet them.\" In American life, it’s almost impossible for the President to walk into a crowd of\nthousands. But without even a moment’s hesitation, he\nagreed and started walking with me. His entire security detail\nwas thrown off guard. But for me, that moment was truly\ntouching, it showed me that this man had\ncourage. He makes his own decisions, but also, he\ntrusted me and my lead in that moment enough to have walked\nwith me into the crowd. It was that sense of mutual trust, a\nstrong bond between us, that I truly\nwitnessed on that day. And the way I saw President Trump that\nday, walking into a crowd of thousands without\neven asking security was truly amazing. And if you watch the video now,\nyou’ll be amazed. When he was shot during the recent\ncampaign, I saw the same resilient and\ndetermined President Trump. The one who walked hand in hand with me in\nthat stadium. Even after being shot, he remained\nunwaveringly dedicated to America, his life was for his nation. His reflection showed his,\n'America First spirit', just as I believe in Nation First. I stand for India First and that’s why we\nconnect so well. These are the things that truly resonate. And I believe that, across the world, politicians are covered so\nmuch by the media that people mostly perceive each other\nthrough its lens. People rarely get the chance to truly meet\nor personally know one another. And perhaps, third-party intervention is\nthe real cause of tensions. When I visited him in the White House for\nthe first time, there was already a lot written about\nPresident Trump in the media. At that time, he was still new to office, and the world had a rather different\nperception of him. Even I had been briefed in many different\nways before meeting him. But to my surprise, the very moment I\nstepped into the White House, he broke all formal protocols right away. And then, he personally took me on a tour\nof the White House. As he showed me around,\nI noticed something striking, he wasn’t holding\nany notes, or cue cards, nor was anyone\naccompanying him to assist. He pointed things out himself. \"This is\nwhere Abraham Lincoln lived,\" he said. He even explained why the courtroom was\ndesigned so long. He would point at the table and tell me\nwhich President signed here and on what date. I found that incredibly impressive, it showed how much he\nhonored the Presidency, And, how respectful and deeply connected\nhe was to America’s history. I could feel that. And he spoke to me\nfreely, discussing many things openly. That was my experience from our first\nmeeting. Later, when his first term ended and President Biden won,\nfour years passed. But during that time, whenever someone we\nboth knew met him, and this must have happened dozens of\ntimes, he would say, \"Modi is my friend, convey\nmy regards.\" That kind of gesture is rare. Even though we didn’t meet\nphysically for years, our direct and\nindirect communication, our closeness, and the trust between us\nremained unshaken. - He said that you're a much, tougher,\nmuch better negotiator than he is. He said this recently when you visited. What do you think of him as a negotiator and what do you think he meant about, you\nbeing a great negotiator? - Now, that’s not something I can comment\non, since it's his graciousness and humility. It is very kind of him that he openly appreciates me on various\noccasions, and in different contexts. But about negotiation, I always put my\ncountry’s interests first. That’s why, in every forum, I speak up for\nIndia’s interests, not to harm anyone, but in a positive manner. And because of\nthat, no one takes offense. People know that if Modi is present, he\nwill strongly advocate for these things. After all, the people of India have given\nme this responsibility. For me, my nation is my High Command, and I will always honor their will. - You've also had a bunch of productive\nmeetings with several other folks on your visit to the\nUnited States, Elon Musk, JD Vance, Tulsi Gabbard, Vivek\nRamaswamy. What are some things that stood out from\nthose meetings? Maybe key takeaways, key memories. - Look, I can say this, I have observed\nPresident Trump both during his first term and now in his second run. This time, he seems far more\nprepared than before. He has a clear roadmap in his mind, with well-defined steps, each one designed\nto lead him toward his goals. I also had the chance to meet members of\nhis team, and I truly believe he has put together a\nstrong, capable group. And with such a strong team, I feel they\nare fully capable of implementing President Trump’s vision,\nbased on my interactions with them. I met several people: Tulsi Gabbard, Vivek\nRamaswamy, Elon Musk, and there was a family-like atmosphere.\nEveryone had come with their families. As for Elon Musk, I’ve known him since my\ntime as Chief Minister. He was there with his family and children, so naturally, the atmosphere\nfelt warm and friendly. Of course, we had discussions and we\ntalked about many different topics. Now, with his Doge mission, he is\nincredibly excited about how it's\nprogressing. And honestly, it makes me happy too,\nbecause when I took office in 2014, I wanted to free my country from the\ndeep-rooted issues and harmful practices\nthat have crept in, and I'll continue striving to eliminate as\nmany of them as I possibly can. For example, after I took office in 2014,\nI observed that back then, we weren’t part of many global\ndiscussions, not like how President Trump and Doge are\nbeing talked about today. But let me give you an example so you can\nsee the kind of work that was done. I noticed that the benefits of certain\ngovernment schemes, especially welfare programs, were being exploited by so many people who\nnever even existed in real life. There were ghost names, pensions being\nissued to fake people, widow pensions were being granted even\nbefore marriages took place, and disability pensions were given without\nany real disabilities. Then, I launched a scrutiny process and\nyou’ll be shocked to know what we found. A hundred million people. A hundred million people. That’s 100 million fake or duplicate names\nthat I removed from the system. And because of that, We saved massive amount of money. Then I introduced\nDirect Benefit Transfer, ensuring that every rupee sent from Delhi\nreached the rightful person without leakage. As a result, my country\nsaved nearly ₹3 trillion that would have otherwise ended\nup in the wrong hands. Just because of Direct Benefit Transfer\nthrough technology, we eliminated\nmiddlemen, ensuring transparency in the\nsystem. I also introduced the GEM Portal for\ngovernment purchases, which has helped save both time and money. It has increased competition\nand improved quality. In India, we had an overwhelming\nburden of compliances. I eliminated 40,000 unnecessary\ncompliances and removed nearly 1,500 outdated laws\nthat served no purpose. So, in a way, my efforts have been about\nfreeing governance from unnecessary dominance and\ninefficiency. And naturally, when bold changes happen,\njust like Doge’s mission, they become a topic of discussion\nworldwide. - You have, you and Xi Jinping have\nconsidered each other friends. How can that friendship\nbe reinvigorated to help deescalate some of the recent\ntensions and resume dialogue and\ncooperation with China? - Look, the relationship between\nIndia and China isn’t something new. Both nations have ancient cultures and\ncivilizations. Even in the modern world, they play a\nsignificant role. If you look at historical records, for centuries, India and China have\nlearned from each other. Together, they have always contributed to\nthe global good in some way. Old records suggest that at one point,\nIndia and China alone accounted for more than 50% of the\nworld’s GDP. That’s how massive India’s contribution\nwas. And I believe our ties have been extremely\nstrong, with deep cultural connections. If we look back centuries, there’s no real\nhistory of conflict between us. It has always been about learning from\neach other and understanding one another. At one time, Buddhism had a profound\ninfluence in China, and that philosophy originally came from\nhere. Our relationship should remain just as\nstrong in the future. It should continue to grow. Of course, differences are natural, when\ntwo neighboring countries exist, occasional disagreements are bound to\nhappen. Even within a family, not everything is\nalways perfect. But our focus is to ensure that these\ndifferences don’t turn into disputes. That’s what we actively work toward. Instead of discord, we emphasize dialogue, because only through dialogue can we build\na stable, cooperative relationship that serves the best interests of both\nnations. It is true that there have been ongoing\nborder disputes between us. And in 2020, the incidents along the\nborder created significant tensions between our\ncountries. However, after my recent meeting with\nPresident Xi, we have seen a return to\nnormalcy at the border. We are now working to restore conditions\nto how they were before 2020. Slowly but surely, trust, enthusiasm, and\nenergy will return. But of course, it will take some time,\nsince there’s been a five-year gap. Our cooperation isn’t just beneficial, it’s also essential for global stability\nand prosperity. And since the 21st century is Asia’s\ncentury, we want India and China to compete in a\nhealthy and natural way. Competition is not a bad thing, but it\nshould never turn into conflict. - The world is worried about a brewing\nglobal war. The tensions between China and the United\nStates in Ukraine, Russia, in Europe, in Israel,\nthe Middle East, what can you say about how we in the\ntwenty first century can avoid a global war, avoid an escalation towards more conflict,\nmore war? - Look, COVID exposed the limitations of\nevery nation. No matter how much we consider ourselves\nas a great nation, no matter how progressive\nwe think we are, or how scientifically advanced we believe\nwe’ve become, everyone has their own way of looking at\nthings, in the end, we all found ourselves on the\nsame ground. Every country in the world faced this\nreality. At that time, it felt like the world would\nlearn from it. That we would move toward a more unified\nworld. Just as a geopolitical order emerged after\nWorld War II, many thought something similar would\nhappen post-COVID. But unfortunately, instead of moving\ntoward peace, the world became even more fragmented,\nushering in a period of uncertainty. And the wars have only made it worse. I believe that modern wars are no longer just about resources or interests. Today, I see so many kinds of conflicts\nhappening. Physical battles often get discussed,\nstruggles are happening in every domain. International organizations that were once\npowerful have become almost irrelevant, no real reforms are happening. Institutions like the UN are failing to\nfulfill their roles. People who disregard international laws\nand rules continue to act freely, and no one can stop them. In such situations, The prudent choice for everyone\nis to let go of conflict and move toward\ncooperation. And, a development-driven approach is the\nway forward, expansionism will not work. As I’ve said before, the world is\ninterdependent and interconnected. Every nation needs one another, no one can\nstand alone. And from all the different forums I\nattend, one thing is clear, everyone is deeply worried about these\nconflicts. We can only hope that peace is restored\nvery soon. - I'm not very good at this.\n- You keep looking at your watch. - No no no, I am barely know what I am\ndoing Prime Minister. I am not very good at this. Okay. In...you have been through your career and\nthrough your life you have seen a lot of difficult situation\nin the history of India, one of them, the 2002 Gujarat riots. They are one of the most challenging\nperiod of modern Indian history when there was violence between Hindu and\nMuslim citizens of the Gujarat that led to over one thousand deaths. It revealed the intensity of religious\ntension in the region, you were, as you mentioned, Chief Minister\nof Gujarat at that time. Looking back, what lessons do you draw\nfrom that time? And we should also say that India's\nindependent Supreme court upheld twice, in twelve and twenty two they you had no\ninvolvement in the violence of the 2002 Gujarat riots. But I was wondering if you could speak to\nthe broad lessons you draw from that time. - Look, regarding you first point, when\nyou humbly said That you don't know what you are doing,\nthat you're not good at this. I disagree and personally feel you've put\nin tremendous care. You've done extensive research and have\ndived deeply into every small detail. So, I think you've done very well. And all the efforts you've put in during\nour conversation, and in all your conversations, are\nappreciated. And rather than\nsimply interviewing me, I feel you're trying to deeply understand\nIndia. That's why I strongly feel there's genuine\nhonesty in your sincere effort\nto uncover the truth. And for that sincere approach, I genuinely\ncongratulate you. - Thank you\n- Regarding the earlier events that you mentioned, like the 2002 riots in Gujarat, I'd like to paint you a clearer picture of\nthe 12 to 15 months leading up to that, so you can fully understand, uh, the\natmosphere of that time. For instance, take December 24, 1999, roughly three years earlier: An Indian flight from Kathmandu to Delhi\nwas hijacked, redirected to Afghanistan, and landed in\nKandahar. Hundreds of Indian passengers were held\nhostage. It caused massive turmoil across India, as\npeople faced life-and-death uncertainty. Then, in the year 2000, the Red Fort\nin Delhi was attacked by terrorists. Yet another crisis struck the nation,\nintensifying fear and turmoil. On September 11, 2001, the Twin Towers\nin America faced a devastating terror attack,\nonce again shocking the entire world. Because ultimately, the people behind\nthese attacks are driven by a similar\nmindset. Then, in October 2001, terrorists attacked\nthe Jammu and Kashmir Assembly. Soon after, on December 13, 2001, India’s\nParliament was targeted. Within just 8 to 10 months, these major\nglobal terrorist attacks took place, violent incidents that led to bloodshed\nand the loss of innocent lives. In such a tense environment, even the\nsmallest spark can ignite unrest. The situation had already\nbecome extremely volatile. In such times, suddenly,\non October 7, 2001, I was given the responsibility of becoming\nChief Minister of Gujarat. This was an enormous challenge. At that time, Gujarat was recovering from\na devastating earthquake, the largest of the previous century, which\nhad left thousands dead. My first major task as Chief Minister was\noverseeing the rehabilitation of survivors. This was a crucial task, and from day one\nafter my oath, I immersed myself in it. I was a person who had absolutely no prior\nexperience with government. I had never been part of\nany administration, never even served in government before. I had never contested an election, never\neven been a State Representative. For the first time in my life, I had to\nface elections. On February 24, 2002, I became a State\nRepresentative, an elected representative,\nfor the first time. And it was\nonly around February 24th,\n25th, or 26th that I stepped into the Gujarat Assembly\nfor the very first time. On February 27, 2002, we were seated in\nthe assembly for the budget session, and that same day, it had been just three days since I'd\nbecome a State Representative, when suddenly, the horrific Godhra\nincident occurred. It was a tragedy of unimaginable\nmagnitude, people were burned alive. You can imagine, against the backdrop of\nincidents like the Kandahar hijacking, the attack on Parliament, or even 9/11, and then to have so many people killed and\nburned alive, you can imagine how tense and volatile the\nsituation was. Of course, this was tragic for everyone,\neveryone prefers peace. The perception that these were the biggest\nriots ever is actually misinformation. If you review the data from before 2002,\nyou'll see that Gujarat faced frequent riots, curfews were\nconstantly being imposed somewhere. Communal violence could erupt over trivial\nissues, like kite-flying contests or even minor\nbicycle collisions. Before 2002, Gujarat witnessed over 250\nsignificant riots. The riots in 1969 lasted nearly six\nmonths. So there was a long history long before I\nwas in the picture. But that one tragic incident in 2002\nbecame a sparking point, leading some people towards violence. Yet, the judiciary thoroughly investigated\nthe matter. At that time, our political\nopponents were in power, and naturally, they wanted all allegations\nagainst us to stick. Despite their relentless efforts, the\njudiciary analyzed the situation\nmeticulously, twice, and ultimately, found us completely\ninnocent. Those who were truly responsible have\nfaced justice from the courts. But the most important thing is, in\nGujarat, where riots used to happen somewhere or\nthe other every year. But after 2002, in 22 years, there hasn’t been a single\nmajor riot in Gujarat. Gujarat remains completely peaceful. Our approach has always been to avoid\nvote-bank politics. Instead, our mantra has been: \"Together\nwith everyone, development for all, trust from all, and efforts by everyone.\" We’ve shifted away from the politics of\nappeasement to the politics of aspiration. Because of this, anyone who wishes to\ncontribute joins us willingly. We've continuously strived to turn Gujarat\ninto a well-developed state, and today, Gujarat is actively\ncontributing toward building a developed\nIndia as well. - A lot of people love you. I've got to hear from a lot of them but there is also people who criticize\nyou, including from the media and folks in the media have criticised you\nover this 2002 Gujarat riots, what's your relationship like with\ncriticism? What, how do you deal with critics, how do\nyou deal with criticism coming from the media or in your own inner\ncircle or just in your own life? - Look, regarding what you said about\ncriticism and how I deal with it, if I had to summarize in one sentence, I\nwelcome it. I have a strong belief that criticism is\nthe soul of democracy. If democracy truly runs in your veins, you\nmust embrace it. In our scriptures, it’s said: \"Always keep\nyour critics close.\" Critics should be your nearest companions\nbecause through genuine criticism, you can improve quickly and work\ndemocratically with better insights. In fact, I believe we should have more\ncriticism, and it should be sharp and well-informed. But my real complaint is that nowadays,\nwhat we see isn't real criticism. Genuine criticism requires thorough study, in-depth research, and careful analysis. It demands finding the truth from\nfalsehoods. Today, people look for shortcuts, avoid proper research,\nand skip deep analysis. Instead of identifying genuine weaknesses,\nthey jump straight to accusations. There's a big difference between\nallegations and criticism. The references you're giving, they are\nallegations, not criticism. For a strong democracy, genuine criticism\nis necessary. Allegations benefit no one; they just\ncause unnecessary conflicts. That's why I always welcome criticism\nopenly. And whenever false accusations arise, I calmly continue serving my country with\ncomplete dedication. - Yeah, the thing you speak of, is very\nimportant to me because I admire great journalism. And unfortunately, in modern day, a lot of\njournalists seek clickbait headlines, make accusations because they operate\nunder incentive because they want the headline, the cheap\nshot. I think there is room and desire and\nhunger for great journalists, and that requires deep understanding. And it saddens me how often one of the\nreasons, you know, I don't think I'm very good at\nthis, but one of the reasons I really wanted to\ntalk to you, is because, I don't see enough high effort, deep dive\nresearch, I don't know how many books I've read. I've read a lot in preparing just to\nexperience, just to try to understand. It requires a lot of preparation, a lot of\nwork. And I would love to see great journalists\ndo that more. And from that place, you can criticize,\nfrom that place, you can really investigate the complexity\nof a situation of people in power. Their strengths, their flaws, the mistakes\nthey have made, but that requires great, great, great\npreparation. So this, I wish there was more of that, of\ngreat journalism. - Yes. Clear, well-directed, and specific\ncriticism genuinely helps in the process of effective policy-making. It leads to a clear-cut policy vision. I specifically pay close attention to such\nconstructive criticism, in fact, I actively welcome it. Regarding your point about journalistic\nheadlines, if someone’s attracted by catchy headlines\nor plays with words, I honestly don't mind that much. But when there's a deliberate agenda\nbehind the actions, and the truth is deliberately ignored, that can cause damage that lasts for\ndecades. If someone focuses on pleasing their\nreaders or viewers with attractive\nheadlines, maybe we can compromise a little. But if there's a hidden motive, or if things are intentionally twisted to serve\nan agenda, that's a serious issue worth worrying\nabout. - And in that, the truth suffers, I think. - I remember once, in London, I was\ninvited to give a speech at an event organized by a Gujarati\nnewspaper there. So, during my speech, I casually said,\nsince it was an event attended by journalists \"What kind of journalism should we have? Should it be like a fly or a bee? I explained. A fly sits on dirt and\nspreads the dirt around. But a bee lands on flowers, collects\nnectar, and then shares that\nsweetness everywhere. Yet, if something wrong occurs, the bee\ncan sting so powerfully that you’d have to hide your face for\nthree days straight! However, some people selectively picked up\njust half of my analogy and created a huge controversy out of it. Honestly, was I being negative about\nanyone? Not at all. I was simply highlighting the incredible\nstrength of a bee, that even its small\nsting can leave such an impact that can make someone hide their face for days.\nYou can't show your face. That’s the power journalism should have. But unfortunately, some people prefer the\nfly approach instead. - I now have a new life goal of\nbecoming the bee You mentioned democracy, so— And not knowing much about government\nuntil 2002. But to—from 2002 to today, you won eight\nelections that I could count. So, in many of the elections, over 800\nmillion people vote in India. What does it take to win an election like\nthat, and to win an election of 1.4\nbillion people, where you get to represent those people in\nthe biggest democracy in the world? - Well, I've been actively involved in\npolitics for years. Before stepping into active politics, my\nfocus was primarily on organizational work. This also included managing elections and\nstrategizing campaigns. So, that was where I dedicated my time. For 24 years, the people of Gujarat and\nIndia have placed their trust in me to lead. With unwavering dedication and a deep\nsense of duty, I try to fulfill the sacred duty entrusted to me by the\npeople I revere as divine. I remain committed to honoring their\ntrust, ensuring it never falters. And they see me for what I truly am. My government is committed to ensuring\nwelfare schemes reach every citizen. Every scheme must reach its intended\nbeneficiaries. Every beneficiary must be treated equally. No one should face discrimination on\ncaste, creed, faith, wealth, or ideology. We must strive to ensure the well-being\nand prosperity of everyone. This way, even those not directly\nbenefiting, never feel left out or treated\nunfairly. They find comfort in knowing they, too,\nwill benefit in due course. This fosters a deep sense of trust. And trust is the cornerstone of my\ngovernance model. Secondly, my governance\nflows beyond the ebb and flow\nof elections. My governance is rooted in the people, not\nthe polls. It is committed to the well-being of my\ncitizens and the greater good of the nation. As you may know, I had once set out on a\nquest for spiritual awakening. So now, I revere my nation as the divine\nitself. And I now revere the people as a\nmanifestation of the divine. Like a devoted priest, my heart is set on\nserving the people. I don't distance myself from the people. I\nlive among them, as one of them. And I tell everyone I work with, \"If you\nwork hard, I will work harder.\" People see this, and it builds trust. Besides, I have no conflicts of interest. I have no friends or relatives who stand\nto gain from the position I hold. The common man appreciates this lack of\nvested interest. And that's probably just one reason why. Moreover, I come from a party with\nmillions of dedicated volunteers, volunteers who are completely devoted to\nthe welfare of India and its citizens. They have had no stake whatsoever in\npolitics. They've held no title, nor strayed where\ninfluence holds sway. My party is blessed with millions of\nvolunteers who work tirelessly. I am proud to belong to the world's\nlargest political party. And it's not like my party has been around\nforever. It reflects the hard work of millions of\nvolunteers. Their selfless service is widely\nrecognized and valued by the community. It fortifies people's trust in the BJP, echoed in the election results. I never tallied our election triumphs, but\nwe have had people's blessings. - I was wondering if you could speak to\nthe incredible logistics, that blew my mind, of running the\nelections in India. So, there are a lot of interesting\nanecdotes that arise. For example, that no voter should be more\nthan two kilometers away from a polling\nstation. The result of that is you have these\nstories of voting machines having to be\ncarried to remote regions of India. It's really incredible—just every single\nvoter counts. And the machinery of having 600 plus\nmillion people vote— Is there some anecdote you could speak to\nthat is particularly impressive to you, or maybe you could speak generally to the\nlogistics of what it takes to run an\nelection that big, in a democracy that big? - First and foremost, I am truly grateful\nfor your insightful question. Anyone who believes in democracy should\nlisten to what I am about to share with you. We often discuss election results, but all\nthe behind-the-scenes work is overlooked. Let's take the recently concluded 2024\ngeneral elections as an example. There were 980 million registered voters! Each of those voters had a registered ID and all the necessary details\nin a vast database. And this number is twice the entire\npopulation of North America. It even surpasses the total population of\nthe entire European Union. Out of the 980 million registered voters, 646 million people ventured out and braved\nthe intense heat of May, determined to\ncast their votes. Temperatures soared to 40 degrees in some\nareas, yet they chose to go! And the size of this voter base is double\nthe population of the United States! We had more than a million polling booths. Can you fathom all the manpower involved\nin this? My country has more than 2,500 registered\npolitical parties. This staggering figure, with such a vast\narray of political parties, has the power\nto leave the entire world in awe! My country has more than 900\nround-the-clock news channels. There are over 5,000 newspapers published\ndaily. They each play a role in upholding\ndemocracy in their own way. Even the humblest villages here embrace\ntechnology with remarkable swiftness. While some other countries take months to\ndeclare election results, we announce the results within a day,\ndespite the mind-boggling number of voters! And you were spot on in  saying that even the remotest\nvillages have polling stations. We even use helicopters to transport\npolling stations. I believe Arunachal Pradesh has the\nhighest-altitude polling booth on record. In Gujarat, a polling booth was set up in\nthe Gir Forest for just one voter who was in the middle of nowhere. But we ensured a polling booth\nwas set up for them. All I mean to say is that we truly leave no stone unturned in our unwavering commitment\nto strengthening democracy, ensuring that we are always fully prepared\nand election-ready, no matter the\ncircumstances. I firmly believe that India's Election\nCommission sets a global standard as a benchmark for conducting free and fair elections. It is the apex decision-maker. This in itself is such a remarkable story that the world’s top universities should\nconsider it a case study. They should analyze the management behind\nit as a valuable learning example. Given the sheer number of voters, can you\ntruly grasp the immense depth of political\nawareness? All of this will make for an excellent\ncase study for the younger generation\nworldwide. - To me—I love democracy. This is one of the main reasons I love the\nUnited States. But there's just nothing quite as\nbeautiful as democracy when it functions\nin India. You know, like you said, 900 million\npeople registered to vote! It really is a case study. It's beautiful to see that many people\ncome together willingly, passionately,\ncasting a vote for some person to represent them, like,\nthey're putting their heart in that. It's really important for a person to feel\nlike their voice is going to be heard. It's beautiful. Speaking of which, you are loved by a lot\nof people. You are one of the most powerful humans in\nthe world. Do you sometimes think about whether this\nmuch power has a corrupting effect on your\nmind, especially across the many years that\nyou've been in power? - Well, I don’t think the word \"powerful\"\nquite reflects the journey of my life. I can never claim to be powerful, for all\nI am is a humble servant. I even identify myself as not the Prime\nMinister, but the Prime Servant. And service is the guiding principle of my\nwork ethic. As far as power is concerned, it is\nsomething I have never bothered about. I entered politics not to play power\ngames, but to serve. Rather than seeking power, I stay committed to doing\nand getting work done. I am more focused on productivity than\npower. I have always dedicated myself to serving\nthe people. I have always devoted myself to bringing\nabout a positive change in their lives. - Like you mentioned, you work a lot. You\ngive your whole soul to your work. Do you ever get lonely? - Look, I never experience loneliness. Because I am an ardent believer in the\nphilosophy of one plus one. And this philosophy of one plus one is aligned with my moral compass. And whenever I am asked to elaborate on\nthis outlook, I say, \"The first one represents Modi, and\nthe other one represents the Almighty.\" I am never alone, for He is always there\nto keep me company. This is just how I function. Having wholeheartedly embraced the ideals\nof Swami Vivekananda, I firmly believe that service to mankind\nis service to God. For me, the nation itself is divine, and\nmankind is a reflection of the divine. I walk this path with the conviction that\nserving the people is serving the divine. That’s why the very notion of struggling\nwith loneliness has never even remotely\ncrossed my mind. Like at the time of pandemic. With the lockdown and traveling\nrestrictions in place, I came up with a way to make the most of\nmy time. I designed a governance model that operated\nseamlessly through video conferencing. I kept myself occupied with remote work\nand virtual meetings. Another thing I did was to connect with the\npeople I had worked with throughout my life. Among my party's volunteers nationwide, I made a list of those\nwho were 70 and older. Some of the volunteers had very humble\nbeginnings and came from very modest\nbackgrounds. I personally called every volunteer aged\n70 and above. I made it a point to inquire about their\nhealth and their families' well-being. I inquired about how their area was\ncoping. I asked these questions to make sure they\nwere doing well. This allowed me to build rapport with\nthem, and we would go down the memory\nlane. They were touched that the Prime Minister\nwould check on them in the pandemic. I made around 40 calls every day, without\nfail. I carried on with this throughout the\npandemic. It gave me the chance to reconnect and\nrelive old memories with familiar faces. Loneliness is never a concern for me, as I\nalways find ways to stay engaged. And I have long been at peace with myself. The time I spent in the Himalayas have\nhelped me develop this. - I've heard from many people that you are\nthe hardest worker they know. What's your philosophy behind that? Maybe, you put in crazy hours every single\nday. Do you ever get tired? What... what's your source of strength and\nperseverance through all of that? - Look, first of all, I don't believe I'm\nthe only one working. I look at the people around me and always\nthink, \"These people work\nharder than I do.\" When I think about farmers, I realize how\nhard they work. They toil and sweat under the open sky,\nday after day. When I look at our country's soldiers, I\nthink about how many hours someone spends working tirelessly in snow,\ndeserts, or even underwater, day and night. When I see a laborer, I think about how\nhard they're working. I always think about how hard our mothers\nand sisters work in every family for the happiness of the family. They're the first to wake up and the last\nto go to bed, taking care of everyone in the family, while also managing social\nresponsibilities. Thinking of all this, I'm in awe of how\nhard people work. So I think: how can I sleep?\nHow can I relax? So naturally, the motivation is right in\nfront of my eyes, those very things around me\nkeep me motivated. Secondly, my responsibilities keep\npushing me forward. The responsibilities entrusted to me by my\nfellow citizens always remind me that I'm not here to\nenjoy privileges. I will always give it my absolute best. Perhaps there are a couple of things I may\nnot accomplish, but there will never be a lack of effort\nor hard work from me. And when I was campaigning in 2014, I had made a promise, first in Gujarat,\nand later across India I promised my fellow citizens that I will never fall behind in hard work\nfor my country. Secondly, I promised I would never act\nwith bad intentions. And thirdly, I vowed I'd never do anything\nfor personal gain. Today, it's been\ntwenty-four years, for such a long period, the people have\nentrusted me as head of government. I've continuously held myself to these\nthree standards, and I still live by them today. My inspiration comes from, serving 1.4\nbillion people, from understanding and\nfulfilling their aspirations, and addressing their needs. I'm always determined to do as much as I\ncan, work as hard as possible. Even today, my energy remains just as\nstrong. - Me, as an engineer, as a person who\nloves mathematics, I have to ask, Srinivasa Ramanujan is an Indian\nmathematician from a century ago. He's widely considered to be, one of the\ngreatest mathematicians of all time. Self taught, grew up in poverty. You have often spoken about him. What do you find inspiring about him? - Look, I deeply respect him, and everyone in my country respects him as\nwell. Because I strongly believe there’s a deep\nconnection between science and\nspirituality. If you closely observe many scientifically\nadvanced minds, you'll find they're often spiritually\nadvanced too. They’re not disconnected from\nspirituality. Srinivasa Ramanujan once said that his\nmathematical ideas came from the goddess he worshipped. Meaning, ideas emerge from spiritual\ndiscipline. and discipline is more than just hard\nwork. It means fully devoting yourself to a task\nand completely immersing yourself into it, so much that you become one with your\nwork. You see, the more open we are to new and\ndifferent sources of knowledge, the more new ideas we’ll have. I think it's important for us to clearly\nunderstand the difference between\ninformation and knowledge. Some people mistakenly confuse information\nwith knowledge, carrying around large amounts of\ninformation. But I don’t believe information alone\nequals knowledge. Knowledge is something deeper. It gradually evolves through processing,\nreflection, and understanding. Recognizing this difference is important\nin how we handle both. - You have a reputation for being a\ndecisive leader. So can you walk me through, on this topic\nof ideas, how you make decisions? What's your\nprocess? So, for instance, when facing a high\nstakes choice, with no clear precedence, you know, a lot of uncertainty, having to\nbalance, input, how do you make decisions? - There are many factors to my\ndecision-making. First, I'm perhaps the only politician in\nIndia who has stayed overnight in around 85 to 90 percent of the\ndistricts across the country. This was before my current role. I used to\ntravel extensively. I learned a lot from those experiences. They gave me first-hand knowledge of the ground realities and\ngrassroots-level issues. not something asked or heard, or learned\nmerely from books. Secondly, from a governance perspective, I carry no baggage\nof any kind. I don't carry any baggage that weighs me\ndown or forces me to act a certain way. Thirdly, I have a simple yardstick for\ndecisions: my country first. I always question if what I'm doing harms\nmy nation in any way. Additionally, Mahatma Gandhi once said\nthat if you're ever unsure when making a decision, think of the\npoorest person's face, remember them, and ask yourself,\n\"Will this help them?\" Then your decision will be right.\nThat wisdom always guides me, remembering ordinary citizens and\nconsidering how my actions affect them. Another factor in my approach is that I'm\nvery well-connected. In my administration,\nmy officials know this well, and probably\nfeel overwhelmed by it, by the fact that my information channels\nare numerous and are very active. Because of that, I receive lots of\ninsights from various sources. So, when someone comes to brief me, that's\nnot my only source of information. I always have additional perspectives\navailable to me. Another thing, I maintain\na learner's mindset. Suppose I'm not familiar with something,\nand an official explains it to me, I approach them like a student and ask,\n\"Can you clarify this? How does it work? Then what happens next? And how?\" And whenever I have different information, I deliberately play devil's advocate and\nask challenging questions. I thoroughly analyze the issue from\nmultiple angles, hoping that careful evaluation will yield\nsomething valuable. Then, once I converge toward a decision or\naction that is worth taking, I share the idea informally with\nlike-minded people, just to gauge their\nreactions and see how they respond, gathering insights and feedback before\nmoving forward. Until finally I have a strong conviction that my decision is right. This entire decision-making process\ndoesn't actually take much time. My speed is very fast. Let me share an example, how did I make\ndecisions during COVID? I had Nobel Prize winners advising me, giving countless economic examples from\naround the world. They'd say, \"This country is doing this,\nthat country did that, you should do it\ntoo.\" Renowned economists constantly bombarded\nme with suggestions. Political parties pressured me\nrelentlessly, urging me to spend huge\namounts of money. But I didn't act immediately. I paused and\nreflected, \"What exactly should I do?\" Then, considering the unique conditions of\nmy own country, I made a clear decision: I wouldn’t let the poor sleep hungry. I wouldn’t allow social tensions to arise\nover basic daily needs. These core principles guided my approach. The entire world was in lockdown; global economies were collapsing. Everyone pressured me to empty the\ntreasury, print more currency, and flood money\neverywhere. But I decided that this was not the right\neconomic route to follow. And so instead, the path I chose, after carefully listening to experts, understanding their opinions without\nopposing them, and combining their advice with my own\ncountry's situation and my personal experiences, created a system that worked effectively.\nAs a result, when the whole world suffered from severe\ninflation immediately after COVID, India did not. Today, my country is steadily\nadvancing at a rapid pace emerging as one of the fastest-growing\nmajor economies in the world. The main reason is that during that\ncrisis, with patience and discipline, I resisted the temptation to apply every\nglobal theory blindly. We didn't worry about what newspapers\nwould say, whether they'd praise or\ncriticize. Ignoring all that, I stayed focused on\nbasic fundamentals, and by doing so, we succeeded and kept moving ahead. So ultimately, my economy benefited as\nwell. My approach has always been to stay\nfocused on these fundamentals. Another strength is my risk-taking\ncapacity. I don’t worry about potential losses for\nmyself. If something is right for my country, for\nthe people, I’m always prepared to take\nthe risk. And secondly, I take ownership of my\ndecisions. If something goes wrong, I don’t shift\nblame to others, I stand up, take responsibility, and own\nthe outcome. When you take ownership, your team also\nbecomes deeply committed. They know this person won’t let us down,\nwon’t abandon us, he’ll always stand with us. Because they see I’m making honest\ndecisions, not for myself, but for the nation. I’ve openly told the country from the\nstart, \"I’m human, I can make mistakes. But I won’t act with bad intentions.\" People remember those words clearly, even\nif something doesn’t go as planned, they trust that Modi’s intentions were\nright. They think, \"He probably meant to do\nsomething good, even if it didn't work out.\" So, society sees and accepts me just as I\nam. - You gave a powerful speech on AI a few\nweeks ago at the AI Summit in France. In it you spoke about the talent pool for\nAI engineers in India. I think it's probably one of the biggest\npools of brilliant engineers in the world. So how can India become the leader in the\nspace of AI? Currently it lags behind the United\nStates. What does it take for India to start\nwinning and leading the world in AI? - One thing I'm about to say might sound\nstrong, and it may even upset some people. But since you've asked, I'll speak openly\nfrom my heart: No matter what the world does with AI, it\nwill remain incomplete without India. I'm making this statement very\nresponsibly. Tell me. You've heard my speech at the AI Summit in\nParis on global cooperation. What do you think? Can anyone develop AI\nentirely on their own? What is your perspective on this? - So you, you gave, actually in your\nspeech, a brilliant example of the\npositive impact of AI and the limitations of AI. I think the example you gave is, when you\nask it to generate an image of a person writing with their left hand, it's always going to generate\na person writing with their right hand. So in that way, the West creating an AI\nsystem, where India is not part of that process is\nalways going to generate the person with the right hand. It's a... it's a essential part of what\nthe world is historically, but especially in 21st century. - I agree. I believe AI development is\nfundamentally a collaboration. Everyone involved supports one another through shared experiences and learning. India isn't just developing\ntheoretical AI models, it is actively working on and\nbringing to life AI-driven applications for very\nspecific use cases. To ensure that GPU access is available to\nevery section of society, We have already created a unique\nmarketplace-based model to ensure its\nbroad accessibility. A significant mindset shift is taking\nplace in India, though historical influences, traditional\ngovernment procedures, or the lack of strong support\ninfrastructure made us appear as lagging\nbehind to others. Take 5G, for example: the world initially\nbelieved we were far behind. But once we started, we became the fastest nation globally to roll out comprehensive\n5G networks. Recently, an American company executive\nvisited me and shared his experiences\nabout this very fact. He told me that, if I were to advertise in\nthe U.S. for engineers, I would only receive enough applicants to\nfill a single room, at best. But if I do the same in India, even a football field wouldn't be enough\nto hold them. This indicates that India has access to an\nextraordinarily vast pool of talent, and that’s our greatest strength. After all, artificial intelligence is\nfundamentally powered, shaped and guided by human\nintelligence. Without genuine human intelligence, AI\ncan't thrive or progress sustainably. And that real intelligence exists\nabundantly in India's youth and talent pool. And, I believe that's our greatest asset. - But also, if you look, many of the top\ntech leaders, first of all, tech talent, but tech\nleaders in the US are of Indian origin, Sundar Pichai, Satya Nadella, Aravind\nSrinivas, you've met with some of them, what spirit of their Indian origins do you think they\ncarry in them that enables them to be so\nsuccessful? - Look, Indian culture emphasizes that there should be equal respect for the\nplace where you're born and the place where you work.\nThere should be no difference. As much as there is dedication\nto the land of birth, there should be the same sense of\ndedication to the land of work. You should always give your best,\nwherever you are. Because of these rich cultural values, every Indian strives to\ngive their best effort, regardless of their role or\nposition. They don’t wait until they're in senior\nroles; even in smaller roles, Secondly, they never get involved in\nanything questionable or unethical. They tend to remain dedicated to what's\nright and ethical. Their nature is collaborative, they easily\nget along with others. Eventually, for success, just having\nknowledge isn’t enough. The ability to work effectively as part of\na team matters significantly more. Understanding people and harnessing their\nabilities is an incredibly valuable skill. Generally, people raised in India,\nespecially those coming from joint families and brought up in an\nopen society, find it easier to lead complex tasks and\nlarge teams effectively. That's why today, in major corporations\nacross the globe, you'll find Indians holding\nkey leadership positions. And the problem-solving abilities, along\nwith the analytical thinking, of Indian professionals,\nare truly exceptional. I believe this capability is so strong it\nmakes Indians globally competitive and extremely valuable on the\ninternational stage. This is the reason why, in fields like innovation, entrepreneurship,\nstartups, and boardrooms, you'll find Indians achieving\nextraordinary results everywhere. Take our space sector, for example. Previously, it was entirely\ngovernment-controlled. But just a couple of years ago, I opened\nit up to the private sector, and now we already have 200 startups\nworking in space technology. Moreover, our missions like Chandrayaan\nare extremely cost-effective. India's Chandrayaan mission cost\nless than what Hollywood spends making a single\nblockbuster film! So, when the world sees how cost-effective\nour work is, they naturally think, \"Why not partner\nwith India?\" This automatically generates respect for\nIndian talent globally. I believe this is a hallmark of our\ncivilizational ethos. - So you spoke about this human\nintelligence. Do you worry that AI, artificial\nintelligence, will replace us humans? - It's true that in every era, a competitive atmosphere was created between technology and humanity. At times, it was even portrayed as conflict. It was often portrayed as if technology\nwould challenge human existence itself. But every time, as technology advanced,\nhumans adapted and stayed a step ahead. It has always been the case. After all, it is humans who find the best\nways to use technology to their advantage. And I believe that with AI, humans are now being forced to reflect on\nwhat it truly means to be human. This is the real power of AI. Because of the way AI functions, it has\nchallenged how we perceive work itself. But human imagination is the fuel. AI can create many things\nbased on that, and in the future, it may\nachieve even more. Still, I firmly believe that no\ntechnology can ever replace the boundless creativity\nand imagination of the human mind. - I agree with you. It does make me and a lot of people wonder\nwhat makes human special because it seems that there is a lot that\nmakes human special. The imagination, the creativity, the\nconsciousness, the ability to be afraid, to love, to dream, to think outside of the box, outside of\nthe box, of the box, of the box, take risks, all of those things. - Now, look, humans have an innate ability\nto care for each other, the natural tendency to be concerned about\none another. Now, can someone tell me, is AI capable of\nthis? - This is one of the big open questions of\nthe 21st century. Every year you host the \"Pariksha Pe\nCharcha\" where you interact directly with young\nstudents and give them advice on how to prepare for\nexams. I watched a bunch of them so you you give\nadvice on how to succeed in exams, how to manage\nstress, all those kind of things. Can you explain on a high level the different exams that students in India\nneed to take in their education journey, and why it's so stressful? - By and large, a strange mindset has\ndeveloped in society today. Even schools measure their success by\nstudents' rankings. Families, too, feel pride when their child\nachieves a high rank, because they believe it improves their\neducational and social status. This mentality has resulted in increased\npressure on children. Kids also began feeling that their entire\nlives depend on 10th and 12th grade exams. We've introduced significant changes in\nour new education policy to address this\nissue. But until those changes take effect on the\nground, I feel another responsibility: If our children face challenges, it's my\nduty to listen to them, understand them and ease their burden. In a way, when I conduct\n\"Pariksha Pe Charcha,\" I get insights directly\nfrom the students, understand their parents' mindset, as well as the perspectives of people in\nthe educational field. So, these discussions don't just benefit\nthe students; they benefit me too. Exams are valuable for assessing knowledge\nin a specific domain, but they can't become the sole measure of\nsomeone's overall potential. Many people may not score high\nacademically, yet can hit a century in\ncricket because that's where their true strength\nlies. When the focus shifts to actual learning,\nscores tend to naturally improve. I remember when I was a student, I had a\nteacher whose learning techniques still greatly\nappeal to me today. He would give us children specific\ninstructions. To one child, he would say, \"Tomorrow,\nbring exactly 10 chickpeas from home.\" To another, he might request, \"Bring 15\ngrains of rice, no more, no less.\" A third child could be told, \"Bring 21\nmoong beans, precisely that number.\" Different students got different\nquantities and varieties. So, each child would think,\n\"I need to get exactly ten,\" and counting them at home helped them\nmemorize numbers naturally. Then, they'd learn what chickpeas were, and after returning to school,\nthey'd pool it all. The teacher would then ask,\n\"Take out ten chickpeas, three chickpeas, two moong beans...\" This way, children learned math and could identify chickpeas\nand moong beans effortlessly. I'm talking about early childhood\neducation here. Such learning techniques educate children\nwithout burdening them, and we've incorporated similar methods\ninto our new education policy. When I was in school,\nI observed one of my teachers using an innovative idea. On his very first day, he placed a diary\non the table and said, Whoever arrives earliest each morning will write one sentence in this diary,\nalong with their name. The next student would then need to write\na related sentence. At first, I'd rush to school very early\nevery day. Why? So that I could write the first sentence. I once wrote something like, \"Today's sunrise was magnificent; it filled me with energy.\" I'd write my name, and whoever arrived\nafter me had to write something connected to the sunrise\nas well. After a few days, I realized my creativity\nwasn't improving much from this. Why? Because I'd arrive with a fixed\nthought already in mind and simply write\nit down. So, I decided I'd start\ngoing last instead. What happened then was that I'd read what\nothers had written first, and then try to give my very best. As a result, my creativity began to\nimprove even more. Sometimes, teachers do these small, simple activities that\ngreatly impact your life. These experiences, combined with\nmy own background in organizational work, made human resource development a key area\nof focus for me. That's why I engage with children through\nevents once or twice each year. And over time, these efforts have resulted\nin a book that's benefiting thousands of children,\nserving as a valuable reference for them. - Can you speak a little bit more by way\nof advice to students of how to be successful on their path in\ntheir career, how to find the career and how to find success, in India, and\njust to all the people across the world who find inspiration in your words? - I believe that whatever task you get, if you perform that task with complete\ndedication and sincerity, they inevitably become an expert sooner or\nlater, and their enhanced capabilities open doors to success. While working, one must continually strive\nto improve their skills and should never underestimate their\nability to learn. When someone constantly neglects their\nlearning ability, they limit their growth. But those who look beyond their tasks, and\nobserve what others around them are doing, their capacity can double or even triple. To young people, I'd say this clearly: There’s no need to feel discouraged,\nthere’s certainly some task out there destined just for you.\nDon't worry. Focus on enhancing your skills, and\nopportunities will come. You may think: \"I wanted to be a doctor\nbut became a teacher. My life is wasted.\" Thinking like that won't help you at all.\nAlright, you didn't become a doctor, but as a teacher, you can shape a hundred\ndoctors. If you had become a doctor, you'd serve\nonly your patients, but now, as a teacher, you can inspire students to fulfill their\ndreams of becoming doctors, so that both you and your students can\ntogether serve millions of patients. Then, he gains a new perspective on life: “I couldn't become a doctor, so I was\nmiserable, and I was unhappy being a teacher. But now I realize, as a teacher, I can\ncreate doctors.” Connecting your life to a greater purpose\nbrings a sense of inspiration and meaning I have always believed that God has given\neveryone unique capabilities Never lose faith in your own abilities; You should always maintain trust in your\nown abilities. Keep believing in yourself, and trust that\nwhen the opportunity comes, you'll perform,\nand you'll succeed. That confidence makes a\nperson deliver results. - How did those students deal with stress, with struggle, with difficulties along\nthat path? - Parents must first understand that life\nis not just about taking exams. Families should understand, that their\nchildren aren’t trophies meant to be\ndisplayed or models to show off in society. It’s not about saying,\n\"Look, my kid scores so high!\" Parents really need to stop using their\nkids just as status symbols. Secondly, students should always keep\nthemselves well-prepared beforehand. Only then can they appear for exams\nfeeling stress-free and confident. They should have complete trust in\nthemselves and their abilities. Sometimes I see students panic over the\nsmallest issues during exams, they take papers or other things and when their pen suddenly stops working,\ncausing anxiety. Sometimes they feel uneasy, thinking, \"Oh no, I don’t like sitting next to this\nperson.\" If the bench wobbles, their whole\nattention goes there, indicating self-doubt. Those lacking confidence constantly keep\nlooking for distractions. But if you're confident and have genuinely\nworked hard, just take a minute. Take some deep breaths, relax your mind,\nand refocus your attention calmly. Slowly read through the questions and\nallocate your time systematically, I have this amount of time, I'll dedicate\nthese minutes per question. In my experience, students who regularly\npractice writing test papers can easily overcome such situations\nwithout any trouble at all. - And you said, always focus on learning. What's your approach to learning? What advice can you give on how to learn\nbest, not just when you are young, but\nthroughout your life? - Let me share a personal example with\nyou. I used to learn a lot from reading, but\nthese days, more and more,\nI learn by being fully present. Whenever I meet someone, I am fully\npresent in the moment. I give them my full attention. This complete focus allows me to grasp new\nconcepts quickly. When I'm with you, I'm fully present,\ngrounded in the moment. No calls or messages can pull me away from\nthis moment with you. I am fully present, focused on the here\nand now. That’s why I always believe this is a\nhabit everyone should embrace. It will sharpen your mind and improve your\nlearning ability. Besides, knowledge alone cannot light the\nway. You must immerse yourself in the flow of\npractice. You cannot master driving merely by\nreading the life stories of great drivers. You must get behind the wheel and take the\nroad yourself. You must dare to take\nrisks. You can never master the road if fear of\naccident or death holds you back. I truly believe that those who live in the\npresent, are the ones who live life to the\nfullest. That’s because they know that every moment\nlived has already slipped into the past. So you must embrace the moment before it\nfades into the past. Otherwise, chasing the future only turns\nthe present into the past. It's not a trade worth making. Most people stress so much about the\nfuture that their present quietly slips\naway. Before they know it, the moment has\nalready faded into the past. - Yeah, I've heard a lot of stories of you\nhaving meetings with people, and it's— usually all the distractions are— There are no distractions. There are just\ntwo human beings, just like this. And just focused on the moment\nand the interaction, and that's a really beautiful thing. And today really is a gift that you would\ngive that focus to me, so thank you. Let me ask, maybe, a difficult, maybe, a\nhuman question. Do you contemplate your mortality? Are you\nafraid of death? - Can I ask you a question instead? - Sure. - I have a very interesting question. Life and death are two sides of a coin,\nbut which of the two is more certain? - Death. - Exactly. Now, with that out of the way, we know for a fact that life itself is a\nwhispered promise of death. and yet, life is also destined to\nflourish. So, again, in the dance of life and death,\nonly death is certain. So, why fear what is certain? That’s why you must embrace life, instead\nof fretting over death. That's how life will evolve and flourish,\nfor it is uncertain. That’s why you must commit to enriching, refining, and elevating your life so you can live fully and with a purpose\nbefore death comes knocking. That's why you must let go of the fear of\ndeath. After all, death is inevitable, and there's no use worrying\nabout when it will arrive. It will arrive when it's meant to. - What gives you hope about the future,\nnot just of India, but all of human civilization—all of us\nhumans here on Earth? - Well, I am an optimist at heart. Pessimism and negativity are simply not\ningrained in my mindset; they don't align\nwith the way I think. That’s why I always gravitate toward the\nbright side instead. If we take a moment to reflect on the\nhistory of mankind, we see the incredible crises humans have\novercome with resilience and strength. We also see the major changes humanity has\nembraced to evolve with the times. And this continuous transformation has\ncarried on for millennia. In every era, it is in human nature to\nadapt to the ever-flowing current of\nchange. And while our progress has gone through\ncycles of ups and downs, it is those people who can break free from\nthe constraints of these historical cycles and outdated\nthinking patterns. It is they who can help humanity achieve\nextraordinary positive breakthroughs, with an unshackled speed and grace, Transcending the limitations of the old\nway of doing things, by embracing change. - In this moment, I was wondering if you\ncould guide me, perhaps, through a Hindu prayer\nor meditation for a few moments. I learned— I'm trying to learn the Gayatri Mantra. And in my fast, I was trying to do the\nchants. Perhaps I could try chanting, and\nyou could— tell me about the importance of this\nmantra and maybe others in your life, in\nyour spirituality. Should I try? - Yes, please. - Om Bhur Bhuvah Swah Tat Savitur Varenyam Bhargo Devasya Dheemahi Dhiyo Yo Nah Prachodayaat How did I do? It's ok? - You did great! Om Bhur Bhuvah Swah Tat Savitur Varenyam Bhargo Devasya Dheemahi\nDhiyo Yo Nah Prachodayaat This mantra is dedicated to the radient\npower of the Sun and is considered a powerful tool for\nspiritual enlightenment. Many mantras in Hindu philosophy are\ndeeply intertwined, In some intricate and interesting ways,\nwith science and nature. Each woven into different facets of life. Chanting mantras on a daily basis brings profound and\nlasting benefits. - In your own spirituality, in your quiet\nmoments, when you are with God, where does your mind go, what role do\nmantras play when you're fasting, when you're just\nalone with yourself? - The word meditation has been overused to\nthe point that it feels like a cliché. In Indian languages, we usually refer to\nit as \"Dhyaan\". If I associate Dhyaan to meditation, it\nmight seem burdensome to some. One might think: \"This is too difficult.\nI'm not an enlightened being.\" But it's not rocket science. It just means\nfreeing yourself from distraction. For example, even when you're in class, your mind wanders to recess. All you think about is lunch, not the\nlesson. Meditation is simply being present in the\nmoment. I recall an incident from my time living\nin the Himalayas. There, I encountered this wise sage. He taught me a simple, practical\ntechnique. It was nothing spiritual. There are several little streams in the\nHimalayas. He positioned a large leaf to catch water\nfrom one of those streams. And placed an up-side-down bowl below. So water would drip rhythmically from the\nleaf onto the bowl. He asked me to focus only\non the dripping water, ignoring all other sounds. Ignore the chirping birds and the soft\nrustle of the breeze. He would place the leaf, and I would\nmeditate there for hours. I felt my mind slowly tuning in to the rhythmic sounds of the water droplets\nfalling onto the bowl, like a melody guiding me into deep focus. And it's not like I was chanting mantras\nor reciting God’s name. I like to call it the divine resonance. It was by tuning into that divine\nresonance that I learned the art of\nconcentration. This practice slowly evolved into\nmeditation. Sometimes, you happen to stay at a fancy\nhotel. You get a lavish, luxurious room. The decor is impeccable, and you have been\nwholeheartedly fasting. But there's a dripping faucet in the\nbathroom. That faint sound is enough to make a\nluxurious room feel worthless. At times, we realize the value of\nconcentration in life’s inner journey. We come to appreciate the difference a lit\nbit of concentration can make. One very interesting concept comes to mind\nfrom our scriptures. Since we spoke about life and death, I\nwould like to quote a mantra. Om purnamadah purnamidam\npurnatmapurnamudacyate in other words, all life is part of a\ncomplete circle. And this mantra emphasizes the path to\nachieve that completeness. Similarly, Hindus never focus solely on\nindividual well-being. Sarve bhavantu sukhinah \nsarve santu niraamayaah. In other words, we wish for the well-being\nand prosperity of all. Sarve bhadraanni pashyantu\nMaa kashcid duhkha bhaag bhavet this mantra encompasses the idea of\nuniversal well-being and prosperity. And you know how this mantra ends?\nOm shaantih, shaantih, shaantih every Hindu mantra ends on the same note.\n\"Peace, peace, peace.\" These ancient and powerful rituals, born\nin India, have emerged from thousands of years of\nthe spiritual practice of sages. They connect us to the essence of life. - Shaantih, shaantih, shaantih. - Uh-huh. - Thank you for this honor, thank you for\nthis incredible conversation. Thank you for welcoming me to India, and I can't wait to break the fast with\nsome Indian food tomorrow. Thank you so much, Prime Minister. This\nwas an honor. - I am thankful for the opportunity to\nhave this conversation with you. After fasting for two days, I recommend\nyou ease into eating slowly. And I hope you reap great benefits from\nthis fasting experience. I’ve explored several new realms of\nthought for the first time ever with you\ntoday. I had long kept those thoughts tucked away\nwithin myself. But today, you've brought those thoughts\nto light. I hope—\n- Thank you. - I hope your viewers may enjoy this. It\nwas a great pleasure speaking with you. - Thank you. - Thank you. Thank you for listening\nto this conversation with Prime Minister Narendra Modi. And now let me answer some\nquestions and try to reflect on and articulate some things\nI've been thinking about. If you would like to submit questions or get in touch with\nme for whatever reason, go to lexfridman.com/contact. First, let me give a shout out to the amazing team\naround the Prime Minister. Everyone was super kind,\nexcellent at what they do, efficient, great communication, and just great people all around. And since I spoke English and Prime Minister Modi spoke Hindi, I have to comment on the interpreter who was doing simultaneous\ninterpreting for both of us. She was absolutely amazing. I can't sing her enough praises. From the equipment used, to\nthe quality of the translation, to just the human touch of it all. And in general, my travels\naround Delhi and India revealed to me some early glimpses of what felt like another world,\nalmost like another planet, different culturally from\nanything I've experienced before. A chaos of human interactions, out there, big dynamic\npersonalities and characters. Obviously, India's composed\nof many distinct subcultures, and Delhi represents just one slice. Much like neither New York or Texas or Iowa alone represent America. They're all different flavors of America. On my visit, I walked around\nand rode rickshaws everywhere, just aimlessly wandering the streets, looking to talk to people about life. Of course, like many places on Earth, there are always some people, especially those that\nhave something to sell, who will at first see me as a tourist, a foreign traveler, one\nwith some money to spend. Like always, I avoided\nsuch shallow interactions and went straight past the small talk to the meaningful conversations, shooting the shit about what they love, what they fear, what kind of hardship and triumph they've\nexperienced in their lives. I think the cool thing about\npeople, anywhere on Earth, is they quickly do see the real you, past the facades that strangers\nput up for each other, if you're vulnerable and\nhonest enough to let them, and I try to do just that. And I should say that for the most part, everyone was super kind\nin the genuine human way, even when they didn't speak English, it was always easy to understand. Probably more than any other\npeople's I've interacted with, in India, people's eyes,\nfaces, body language, all communicated a lot of information, a lot of emotion, not reserved at all. When I travel through\nEastern Europe, for example, in contrast, reading a\nperson is much tougher. The meme does have some truth to it. There's often a protective layer between the heart of the\nperson and the outside world. In India, it's all there on full display. So I had a lot of epic conversations and interactions as I walked around Deli for a couple of weeks. In general, on the\ntopic of reading people, I do believe the eyes can\noften say more than words can. We humans are a fascinating bunch. There really is a deep, turbulent ocean behind the surface\nwaves we show the world. In some sense, what I try\nto do in conversations, on and off the mic, is\nto get to that depth. Anyway, the few weeks I spent in India were a magical experience. Traffic alone was a wild time, like the world's most difficult\ntest for self-driving cars. It reminded me of watching\nnature documentary videos of swarms of fish, when\nit's thousands of them swimming around at insane speeds, seemingly in complete chaos. And yet, when looking at\nthe big picture of it, it all works like a\nperfectly tuned orchestra. I will most certainly travel around India with my friend Paul\nRosolie in the near future, maybe with some other friends, all around from the north\nof India to the south. Now allow me to also comment about one of the books that\nfirst drew me toward India and to its deep history of philosophical and spiritual traditions. The book is \"Siddhartha\" by Herman Hesse. I first read most of Hesse's\nmajor work as a teenager, but then reread them\nagain through the years. It first found me, \"Siddhartha,\" when I was immersed in a very\ndifferent kind of literature of Dostoevsky, Camus, Kafka, Orwell, Hemingway, Kerouac, Steinbeck, and so on. Many of these explore\nthe same human condition that puzzled me when I was a young man, and still puzzles me today even more so. But \"Siddhartha\" was my introduction to the Eastern way of\nlooking at these puzzles. It was written by Herman\nHesse, and by the way, please allow me this\npronunciation of his last name. I've heard some people say Hesse, but my whole life I've always said Hesse. So anyway, it was written by Herman Hesse, a German Swiss Nobel prize-winning writer during one of the darkest\nperiods of his own life. His marriage was failing, World War I had shattered\nhis pacifist ideals and he suffered from\ndebilitating headaches, insomnia, and depression. During this period, he began\npsychoanalysis with Carl Jung, which in part led him to\nexplore Eastern philosophies as a way to heal his fractured psyche. Hesse immersed himself in\ntranslations of ancient Hindu and Buddhist texts,\nstudying the \"Upanishads\" and the \"Bhagavad Gita.\" And so the writing of\n\"Siddhartha\" was in itself, for him, a journey that paralleled that of the\nmain character in the book. Hesse started writing the book in 1919 and finished three years\nlater, experiencing an extensive psychological\ncrisis in the middle. The book follows Siddhartha,\na young man in ancient India as he leaves behind wealth and comfort to search for meaning. You can feel his personal\nstruggle in every page. Siddhartha's restlessness,\nhis dissatisfaction with conventional wisdom,\nhis need to find truth, the direct experience. Again, the book wasn't simply a philosophical exploration for Hesse, it was psychological survival. He was writing his way out of suffering and towards his own enlightenment. I won't go into a deep\nanalysis of the book here, but I will mention two\nkey lessons I took away and carried with me to this day. First lesson comes from\nthis scene in the book that to me is one of the great\nscenes in all of literature. Siddhartha is sitting by\na river just listening, and in that river he hears\nall of life, all sounds, all voices, all of time,\npast, present, future flowing together as one. That scene gave me the\nexperience and the notion that while in some grounded human sense, the linear arrow of time does exist. In another sense, time\nis a kind of illusion, that in fact, everything\nexists simultaneously. That our lives are both\nmomentary and eternal. It is hard to describe\nthese ideas with words, I think they must be experienced\nas personal revelations. I'm reminded of the fish story\nthat David Foster Wallace, another one of my favorite writers, described in a commencement\nspeech 20 years ago. The story goes, two young\nfish are swimming along when they encounter an older\nfish swimming the opposite way. The older fish nods and says, \"Morning boys, how's the water?\" The young fish swim on, and eventually one turns\nto the other and asks, \"What the hell is water?\" The illusion of the\nforward progress of time is water in this metaphor. As humans, we're fully immersed in it, but enlightenment in part\ninvolves being able to step back and get a glimpse at another\ndeeper perspective on reality where all things are\ninextricably interconnected across both time and space. Another key lesson from the novel that was especially formative\nto me as a young man was that one should not\nblindly follow others, or learn about the world\nexclusively through books. But rather forge your own path and thrust yourself into the world where the lessons of\nlife can only be learned by experiencing them directly. And every experience, both\npositive and negative, mistakes, suffering, and\neven seemingly wasted time is all an essential part of growth. To this point, Hesse draws a distinction between knowledge and wisdom. Knowledge can be taught by others. Wisdom can only be gathered through experiencing the\nfull mess of life yourself. In other words, the path to understanding isn't through rejection of the world, but through complete immersion in it. Those are my early steps\nin seeing the world through the lens of Eastern philosophy. But many of Hesse's books\nhad an impact on me. I would recommend to read\n\"Demian\" when you are younger, \"Steppenwolf\" when you are older, \"Siddhartha\" throughout your life, especially in moments of crisis,\nand \"The Glass Bead Game\" if you want to take on\nHesse's magnum opus, that rigorously explores\nthe ways the human mind and human civilization can engage in the pursuit of\nknowledge, wisdom, and meaning. But \"Siddhartha\" is the only one I've\nreturned to more than twice. In my own life, when faced\nwith a difficult situation, I often return to the moment in the book when Siddhartha is asked\nwhat skills he possesses, and his answer is simply, \"I can think, I can wait, I can fast.\" Let me elaborate. Indeed, for the first part, \"I can think,\" as Marcus Aurelius said,\n\"The quality of your life is determined by the\nquality of your thoughts.\" For the second part, \"I can wait,\" patience and waiting often is indeed the optimal decision\nwhen facing a problem. Time does bring clarity\nand depth of understanding. For the third part, \"I can fast,\" when needed, being able to\nlive and flourish with less is a prerequisite of being free, when the mind, the body, and society all are trying to put you in cages. All right, friends. Now, sadly, our time\ntogether in this episode has come to a close. As always, thank you for being here and thank you for your\nsupport through the years. Let me leave you with a few\nwords from the \"Bhagavad Gita.\" \"He who experiences the unity of life, sees his own self in all beings, and all beings in his own self, and looks onto everything\nwith an impartial eye.\" Thank you for listening. I\nhope to see you next time."}, {"text": "Thank you very much. It's a great honor to have Prime Minister Modi of India. He is a great friend of mine for a long time. We've had a wonderful relationship and we kept the relationship during the four year period, the period that was a very interesting period indeed. I watched. I got to see how not to do things and uh we've just started up again and we have I think some very big things to talk about. Number one is uh. They're gonna be purchasing a lot of our oil and gas. We have more oil and gas than any other country in the world by far, and uh they need it and we have it. And we, uh, we're gonna talk about trade. We're gonna talk about many things, but, uh, it's really an honor to see you, and you've been my friend for a long time and congratulations on having done a great job. Thank you. Thank you very much. Or or India or any. Would you like to say anything more? No, I'm OK. Excellency Mataleto. Barra. You have a day kke or you have milkerque. yeah. That is her. A nurse extra Chaliro part you get that upset. Your Excellency, I'm delighted to see you back in the White House and to meet with you today in this room on behalf of 1.4 billion people of India, let me convey my hearty congratulations to you on your grand and historic victory. Yeah, ha ha. Yeah. Saralba. Kiriga this kivanegaera orellius. car. Rajpatitrumharek barkarkarnekami. Ma. Raspa the trumpele versa. Your your city. Joe Santa Duviswata but hegarma Joy. But he was But he be Swashapire bars so Milgarge aberge. Last year, the people of India gave me the opportunity to serve them for the 3rd consecutive time, and it has happened in the history of India in the last 60 years for the first time, and in this term, I will have an opportunity to work with you over the next 4 years, and it's a great pleasure to see the two coincide. And I can say from my past experience of working with you in your first term that we will continue to advance the India US strategic partnership with the same warmth, with the same trust, and with the same excitement. Or merely the trump. Amitara purane and the questadium delay was the Houston man howdy modi. Or Gujarat man and the man Trump but as he. But break car comprehe. Jeski guns IV. I'm happy that as soon as I entered this room, my friend reminded me of Ahmedabad and the cricket stadium where we held the big rally and the events that we did, the mega events that we did in Ahmedabad, Namaste Trump or the Howdi Modi in Houston, we had conveyed a very strong message of our friendship through those events and the resounding echo of those events can be heard even today in India and the world. Para America. Like a hard banana, man. What's quick and they change in it, man. Or that. Raspati rumpali. Arviswase it do say from me humbui got this ai. Excellency, you've made immense personal contribution towards strengthening of our relations, towards making them more comprehensive and in uh attaining unprecedented heights in our relationship, and I firmly believe that in your second term, we will work with even more speed. the trump gets out part of America. As I had promised to the people of India that in my 3rd term as the Prime Minister of India we will work with twice the speed. I firmly believe that with President Trump during the next 4 years, during his 2nd term, we will work with twice the speed that we did in the first term. Rajpakira mujabiharakarnaha. One thing that I deeply appreciate and I learned from President Trump is that he keeps the national interest supreme and like him, I also keep the national interest of India at the top of everything else, and this has been my real fortune fortune. Raspati Trump is Jabiba to make America great again. He was a he. Bexit Bharat 2047. The har harit Charles was quail here. President Donald Trump and Make America Great Again are inseparable whenever we talk about President Trump, one has to talk about Make America Great Again. Similarly, that that vision inspires everybody. Similarly in India we have the resolve of 1.4 billion people of India that by the time India reaches the 100th anniversary of its independence, we will make our country a developed country by 2047, and this is getting new speed and new resolve. America. Harrovial Loan Ali. I love 1 + 129. A or a garata or a garages boat squeal. US is the world's largest world's oldest democracy, and India is the world's largest democracy. So when India and the US come together, they make 1 + 111 and not 2, and this is the power of 11 that is going to work for the welfare of the human humanity. I once again thank my friend President Trump, and we get the resolve that we will together march towards progress and towards prosperity for our nations. Thank you. Thank you. Thank you. Thank you very much. And he's, he's doing a great job in India. Everybody talks about it. He's doing a really fantastic job, a great leader, great leader. I thank you for your warm words, Mr. President, and I firmly believe that every person in India respects your sentiments. Thank you. Thank you very much. Any questions both leaders spoken diplomatic doctrine. So what's the Trump doctrine that you should expect. Well, I think more than anything else will be the unity. We have great unity. We have great friendship, he and I and our countries, and I think it's only going to get closer, but it's very important that we remain united as countries. We are, uh, we're friends and we're gonna stay that way. if you're going to be tough with India on trade, how are you going to beat China then? We're in very good shape to beat anybody we want, but we're not looking to beat anybody. We're looking to do a really good job. We're We've done a fantastic job for the American people. We had a great 4 years and we were interrupted by a terrible administration, absolutely terrible. They didn't know what they were doing and now we're putting it back together and I think it's gonna end up being much stronger. than it was before, even much stronger than it was before President Trump, first of all, congratulations for the fantastic 24 days of your presidency. Historic and unprecedented decisions that you made, transformational reforms, but I'm particularly impressed by the expose on USAID, and I would like you to share with us if you think USAID had a role in election interference in the US in 2020 and Indian elections in 2024, so it could have had a role. There were a lot. Bad things that happened in 2020, uh, I think bad things happened in 2024, but it was too big to rig. We, we won by a tremendous, uh, margin. We won every swing state. We won the popular vote by millions of votes, so it was, it was too big to rig, but, uh, yeah, I think they probably tried. We're looking to go to a. System now much different where one day voting voter ID and uh you just we have to do that and paper ballots we want paper ballots and when they do that we're gonna clean it up very very well but uh we had a great 2016 we had a much better 2020 election but bad things happened and we had the best of all we had, they say the most consequential in history, 129 years. Most consequential, so it was a great election and it gives me a chance to work again with the Prime Minister and Indiana. We're going to be, we're going to have a great relationship together. I said do you see uh India playing a role in your plan to broker a peace in Ukraine? And if I could ask you about a development in your hometown today, the US attorney has resigned over the DOJ's request to drop the case into Eric Adams. Did you personally request the Justice Department to drop that case? No, I didn't. I know nothing about it. I did not, uh, I think that, uh. Just to answer your other question, uh, we're just, uh, gonna get along well. We're gonna get along with all countries. We're gonna do very well. Uh, we're gonna be doing, I think, record business, record numbers, and we're gonna work with India also. We have some very big trade deals to announce in the very near future. President Putin. Mr. President, what you would like to say about the Bangladesh issue because we saw and it is evident that how the deep state of. The State was involved to regime change during the Biden administration. Then Muhammad Yunus made Junior Soros also. So what is your point of view about the Bangladesh and what is the role that played in the situation? Well, there was no role for our deep state. It was this is something that the prime minister has been working on for a long time and has been worked on for hundreds of years, frankly. I've been reading about it, but I will leave Bangladesh to the Prime Minister. Yeah. Rules of Ukraine kapa. Santique initiative with the rapa they put about. Don. Keep her neutralized. Horror neutral. How is governor fuck shit. Or Harro cappasha shanti. Um pale didn't say he or manner for the Putinokimojugimbihamne kahata samai you on the. Herme conviction kiss casaman you madam and nainnikaltabo table per church arquehinikalta. As far as the Russia Ukraine conflict is concerned, I'm very happy that President Trump has taken initiatives to restore peace and had telephone calls with President Putin and President Zelensky. The world had this thinking that India somehow is a neutral country in this whole process, but this is not true. India has a side and that side is of peace. From the very first day I have been talking about the importance of dialogue and diplomacy and a peaceful solution, and when I met President Putin in the presence of media, I had told him that this is not the era of war, and I have firm conviction that problems cannot be resolved on the battlefield. The two sides will have to come to the negotiating table initiative. I just want to add to that we had a very good phone call yesterday with President Putin. It lasted maybe an hour and a half. Uh, it was, uh, excellent, and I think we went a long way toward getting a solution to the horrible war where so many people are being killed, especially soldiers on the battlefield. Uh, at least 1.5 million soldiers have been killed on a ridiculous war that would have never happened if I were president, but we, uh, we've got a long way to, I think we've got a long way to solving it. Uh, tomorrow there's a meeting in Munich and then next week there's a meeting in Saudi Arabia, not with myself or President Putin but with top officials and Ukraine will be a part. 2 and we're gonna see if we can end that war. That war is a horrible war. It's a vicious, bloody war. We wanna end it, uh, to your other question, uh, that US attorney was actually fired. I don't know if he or she resigned, but, uh, that US attorney was fired. OK, go ahead say it. Well, I think we're doing very well in our competition with everybody. I think you're going to see a nation that really is going forward at a very rapid pace. Our economy is going to be fantastic. We're doing things to make it that way. We announced some very big elements today of success. I call it an. Of success reciprocal tariffs so that somebody charges us we charge them the same amount which has never been done in our country before. We've always been taken advantage of by other countries and we allow that to happen foolishly, but we can and we're not going to allow that any longer, so I think we're going to do very well. We've been doing the last they say the last 3 weeks was among. Best 3 weeks ever for a start in a presidency. There's never been anything like it and when you see what we've been able to do in 3 weeks, people are really amazed. Even the Prime Minister mentioned it. I think other countries are looking at it, but uh I just want to thank everybody for being here. Uh, this is a terrific man. We're gonna make some wonderful trade deals for India and for the US, and thank you all very much. Thank you very much. Thank you Thank you thank you thank you."}, {"text": "sign an executive order on Monday imposing a 25%. tariff on steel, and aluminum Imports. And you can see walking into the room right now. That is prime Minister Modi. president Trump Let's just uh dive into this here on live now from Voda listening in to what they have to say at this press conference in Washington DC. Great honor. I'm thrilled to welcome the prime minister of India, my friend. Narendra. Modi. back to the White House. And we spent a lot of time here and a lot of time in special, man. Prime minister It is a pleasure to extend to you the same Hospital. that you showed. Melania and myself, when we country 5 years ago, it's hard to believe so long ago and it seemed like yesterday it was beautiful. We opened the cricket think the largest stadium in the world. and it was, an incredible. period of time. There is truly a special bond between the the world's oldest democracy in the world's largest democracy. And I believe, the, the world's largest country in terms of the numbers of people, And today, the prime minister. and I are announcing a framework to strengthen. those. size. Even further, economically and the US 21st century is a historic. initiative that will deepen every aspect of our partnership. and our friendship. Starting this year will be increasing military sales to India by many billions of dollars. We're also Paving the way to ultimately provide India with the M35. stealth Fighters. In 2017, my Administration. Revived. and reinvigorated, the quad. security partnership and are meeting today, The prime Minister and I reaffirmed that strong, cooperation among the United States. India Australia. and Japan, and it's crucial, really to maintaining peace and prosperity. tranquility. Even. in the indo-pacific. in addition the United States and India will be working together like never before. to confront the threat of radical Islamic terrorism a threat all over the world actually. Today, I'm pleased to announce that my Administration. has approved. The extradition of 1, of the plotters and 1 of the very evil people of the world. and, uh, having to do with the horrific. 20008. Mumbai terrorist attack. to face Justice in India. So, he's going to be going back. to India. faced Justice. as we deepen, our defense. partnership will also strengthen our economic ties and bring greater fairness and reciprocity to our trading relationship as a signal of good Faith. Prime Minister Modi recently announced The reductions to India's unfair. Very strong. tariffs that limit us access into the Indian market. very strongly. and really it's big problem. I must say India. imposes, a 30 to 40 to 60, and even 70% tariff on. so many of the goods. and in some cases far more than that. And as an example of 70% tariff On Us cars going into India, which makes it pretty much impossible to sell those cars. Today, the US. trade deficit with India. is almost hundred billion dollars. And prime minister Modi, and I have and that we'll be getting negotiations to address the long-running disparities that should have been taken care of over the last 4 years, but they didn't do that. In the US, India the goal of a signing, an agreement. and we want, uh, really we want a certain level. Playing Field what do we really think we're entitled to? And, and, and he does also In fairness So we're going to work on that very hard and we can make up the difference very easily with the deficit. with the sale of oil and gas. LNG. and which we have more than anybody in the world. The Prime Minister and I also reached an important agreement on energy that will restore the United States. as a leading supplier of oil and gas to India. through be hopefully their number 1 supplier in the groundbreaking. development for US nuclear industry, India is also reforming its laws to welcome US nuclear technology which is at the highest level into the Indian market. This will bring safe clean and Affordable electricity to millions of Indians and tens of billions of dollars to the US. civilian nuclear. industry. and India. and under the framework, we are announcing today the United States and India are also joining forces to ensure that artificial intelligence and other. Advanced Technologies are developed by the 2. Of the most really true of the most. advanced. Nations. uh, intellectually and otherwise technologically, anywhere in the world. There's nobody Very much. closer We have an incredible relationship there. And those are this is where it seems to be heading. And complex. A very complex subject but it seems to be where people want to be and they want to go and we're leading right now by a lot. But other people will. try to catch us, I don't know if they're going to be able to. we're going to make it available. We're going to make tremendous amounts of electricity available. We're going to let. uh, the people that are buying the electricity, make their own electric plants. electric generation plants. and we've never done this in our country, but we're going to get it done very quickly. Lee, zeldon, and his group are going to get the approvals. uh, in very rapid form. And we're calling in a national emergency, and that's exactly what it is. going to remain at the top of the AI or artificial intelligence I think for a long time to come and we're going to be working very closely with India. and other countries on that. but right now, we're the Leader by quite a bit. Finally, we agreed to work together to help build 1 of the greatest trade. routes in all of India to Israel to Italy and onward to the United States Connecting our partners by ports Railways. And undersea cables, many, many undersea Cables. It's a big. It's a big development. It's a lot of money going to be spent. and we've already spent some, but we're going to be spending a lot Advanced and stay the leader. I'm pleased to report that with today's announcements. the friendship between the United States and India is the strongest, I believe. it's ever been. I think our relationship is the best It's ever been between 2 leaders of the 2 countries. and it's an honor to say that I'd like to now invite the prime minister to say a few words and then we'll take some questions. and uh, We appreciate you all being here. Thank you very much. Your Excellency. President Trump. Delegates of both countries. friends from the media. namaskar. First of all, Express. my heartfelt, gratitude. To my dear friend president Trump. for the grand. Welcome. and hospitality. According to me. President Trump's leadership. Has been. instrumental. in. nurturing India us ties. and making them vibrant. I could feel today. the same. enthusiasm. the same the same enthusiasm, the same. energy, the same commitment. that we had worked with. during our first. Um, Our discussions today. Highlighted. Our pride in our accomplishments during his first. term. The Deep Mutual Trust. that we share. and, also, the resolve to attain. new goals. We? also. Agreed. That the partnership. and cooperation. between, India and the US. can shape a better world. friends. the people of America. Are aware. of. a president Trump's motto. Make. America great again. or Maga the people of America. are well aware of it. The focusing. On. both. Heritage and development. As. they move forward. at a fast pace. and, with a firm resolve, to, ensure a developed India by 2047, if I were to say this, Borrowing. an expression from America. Our vision make India great. again, or Mega When? America and India. Work together. that is when Maga. when it's Maga Plus. Mega. It becomes. Mega. A mega partnership for prosperity. And it is this. Mega spirit. That gives. New scale. and, scope to our objectives. friends. Today. We have. also set ourselves the target. of more than doubling, our bilateral trade. to. attain 500 not. Will work on concluding. Very soon. a mutually. beneficial. Trade Agreement. in order to ensure. India's energy on. trade in oil and gas. investment. in. energy Infrastructure will also increase in the area of new clear energy. We? also discussed. increasing cooperation on small. modular reactors. friends. America. plays. An important role in. India's strategic and trusted partners. we are moving forward. Actively towards joint development. joint production. and transfer of Technology. In the times to come as well. new technologies. and, equipment. Well. enhance our capacities. We have decided Launch. the autonomous systems industry. Alliance. and, a defense. cooperation framework. for the next decade will be prepared. Interoperability. Logistics. Prepare. and maintenance. will. also be its key components. friends. the 21st century. is a technology-driven century. And Democratic Values. Can give New Direction. Strength. And opportunities. to the entire Humanity. opportunities to the entire Humanity. India, and the US. Work intelligence. semiconductors. quantum. other Technologies. today. we also, agreed on trust. which stands. for transforming relationships, utilizing. Strategic technology. Our Focus will be. on establishing. strong Supply chains for critical minerals. Advanced Materials. and pharmaceuticals. We? have also. Decided. to Launch. a recovery. and processing Initiative. For strategic. minerals like lithium and rare. Earths. We? have. had. close cooperation with the US in the area of space. Are not happy after this. The. Nisar satellite developed with mutual cooperation. between Israel and NASA. will soon be flying into space. on. an Indian. launch vehicle. friends. partnership between India and the US. Strengthens. democracy. and values. And systems. We will work together. to and prosperity. in. the indo-pacific. Will play. a special role in this. during the Court Summit. scheduled to be held in India this year. we will expand cooperation. in new areas. with our partner countries. The. IMac. Together. for the development of economic. corridors. And in the area of connectivity. India and us. together. in the fight. Against terrorism. We agree. That. in order. To. eliminate. crossborder terrorism. We need concrete actions. and I'm Trump. That He? uh, in 2008 somebody who carried out genocide in India, that criminal is now going to be handed over to India and I'm grateful to president Trump for this and appropriate action will be taken in the courts in India. Friends. The. Indian. Community. Living in the US. Is an important. Link in our relations. In order to further, deepen. our people-to-people ties. India will soon open. new. and Boston. These will be new consulates. We? have invited. American. universities and educational Institutes. to open. their offshore campuses in India. Lot. Trump. I, Am grateful. to you. for your friendship. and strong commitment. towards India. The people of India. Still fondly, remember your visit? in? 2020? And hope that. President Trump. will come. and visit them again. Indians. I invite you. to visit India. Thank you. Thank you very much. Okay, thank you very much. as excellent. Uh, we'll do. A few questions, please. Please go ahead. Please. Go ahead. Yeah. Yeah. blue shirt. Yeah, blue shirt. Uh, thank you Mr. President. uh, people in India will naturally welcome your decision to extradite turana to India back home. in that context I would like to ask you a question about in last few years we have seen several groups in the US being raising anti-india voice. calling about separation. terrorism activities in India. Do you think that should continue here in the us as well? You're going to have to go louder. Uh Mr. President people in India would be welcome in your decision to extradite the I can't understand a word he's saying. may I sir, may I may answer. Go ahead back there, Mr. President. First, I want to ask thank you very much. Um, you and the president you both spoke about combating Isis, you you both sounded very exciting about this excited about this partnership. Um, upcoming, and I, I was curious how much more confident are you with President Trump leading this country? that there will be peace through strength and you will have a s successful partnership with the United States. versus um, with uh, Biden's incompetence and weakness over the last 4 years. that's your question but I'll answer it. I agree with you. Gross incompetence. Uh, we're going to have a fantastic relationship and it has been like the whole world's been set back over the last 4 years by the weakness of the United States. the weak leadership of the United States. But I think we've taken care of it in just 3 weeks. It seems to me that even uh, some of the media that we wouldn't prefer. has been writing that this is a much different country right now that the world has a light over it. Not only our country, but the whole world. uh, the Prime Minister told me that before too even over India, the world has a light they need the United States to be strong and powerful, but good and I think it's happened in a very short period of time but I will tell you we're going to have a fantastic relationship. and it'll make both countries much stronger. Let's go ahead, please. okay, Gita man. From India today, sir I'll just take my colleague lalit Jazz question forward because you can okay, fine. Um the question is about um the fact that you've uh decided to extradite tvarana. Thank you so much. India has been waiting to, to have him back. in India to bring him to justice, but there are many other elements in uh the United States of America. Particularly khalistani separatists who have been working against Indian interests. how is the United States of America going to cooperate on that front? with India? There are there have been allegations that have been leveled against Indian agencies by the Biden Administration. Are you going to relook that with uh, Tulsi gabbard as dni now? Well, I don't think India had a very good relationship with the Biden Administration. Biden. They wouldn't sell them oil and gas, which is rather hard to believe. Because, you know, it's a good thing to do. and a lot of things happen that weren't very appropriate. Appropriate, I thought between India and the administration, the Biden Administration but uh, as you said we're giving a Very violent. man. It seems to me. I mean, I don't know that he's been convicted yet or will be but uh, let's assume he's a pretty violent person. we're giving him back. to India immediately and, uh, there are more to follow because we have quite a few requests. So we work with India on crime. and we want to make it good for India and it's very important. So that kind of a relationship is very important to us. okay? go ahead please. um, go ahead. Thank you. Um Mr. President you've repeatedly called India big abuser of trade and said it is really difficult to do business in India because of tariffs You announced reciprocal tariffs today. Uh, I'm hoping you can speak about uh what kind of reciprocal tariffs, India can expect. Are you willing to make any concessions? Uh, and how can India head off? uh, these tariffs. I also have 1 for the prime minister. Well. it has been uh, to us just about the highest. tariff. Nation. anywhere in the world. They've been very strong on tariffs and I don't blame them necessarily but it's a different way of doing business. It's it's very hard to sell into India because they have a trade barriers very strong tariffs, We barriers, very strong tariffs. We are right now. a reciprocal Nation. We are going to if it's India or if it's somebody else with low tariffs. and we're going to have the same. we're going to have whatever India charges we're charging them. whatever another country charges. We're charging them. So it's called reciprocal, which I think is a very fair way. We didn't have that. we, uh, I was going to do that in my other term and we had the greatest economy ever in the world. We've never, there's never been an economy like we had and then we got hit with Co we had a focus on that. and I wasn't really in the mood to be putting it on Italy and Spain and France and India frankly, and a lot of other countries because the world was very troubled until we got rid of that. nightmare. But we had the strongest economy anywhere in the world during that. fairly long period of time During my first term, as you know, and we didn't do the tariffs, we would have done the reciprocal tariffs but uh, we decided and I decided I think on a human basis on a Humane basis. not to do them because of the fact that there was such suffering all over the world. The last about is trade problems. but now we do we're doing. uh we see tremendous future for our country. but we felt that now it's finally 50 years of abuse. that we will do. and this isn't India, this is among a lot of Nations. the European Union. is very difficult for us. Very, very difficult. they they attacks our companies at levels, that nobody's ever seen before they take advantage of a lot of things. So we're not happy about that. China, of course never taken in 10 cents until I was President. We've taken in hundreds of billions of dollars from China since I've been president. and first term. And and now and uh we have to do that. Just as a mechanism of fairness and that's what I've done and so we are being reciprocal charges we charge them. So, frankly, it no longer matters to us that much. What they charge because whatever they charge uh, I had discussions with India the fact that they're terrorists were very high and I was unable to get a concession. So we're just going to do it the easy way and we're just going to say whatever you charge we charge and I think that's fair for the people of the United States. and I think it's actually fair for India. okay? Are you willing to make Go ahead, please. as to the president of the Prime Minister. as to the Prime Minister please. Yes. Sorry. Uh, yosha Singh with India. Prime minister. Thank you, Mr. President, uh, prime minister the US is, uh, giving a lot of push to curb illegal immigration And India has been cooperating on this issue. Uh, how does India, See this, uh, issue in the larger context? Thank you. But even globally you can. talk about this issue. and, uh, we are of the opinion that Anybody. Who. enters another country. illegally. They? They have absolutely no right. to be in that country. And as far as India and the US is concerned. We have always been of the same opinion and that is that any verified Indian? Who. is? in the US? illegally? We? are. fully. prepared to take them back. to India. However, It doesn't stop there. These are. children of very ordinary. families and they are lured by a big dreams and big promises a lot of them. are brought in. without them, knowing about, why they're going to a country. And in fact, they are connected. with a human trafficking system and we we fight against this system as far as the US and India's concerned. I think what we should do sure that we uproot these, uh, from within the system so that we can trafficking. and basically the the the young vulnerable poor people of India are fooled into coming over as a legal immigrants. and bigger against this. ecosystem or this system. that encourages such gangs to thrive and I can tell you that India will completely support your endeavor. in achieving. Yes, thank you. Thank you, Mr. President. um, the question for the Prime Minister Modi first, if I may um, I wanted to ask you um did you discuss any possible business deals with Elon Musk during your, uh, your meetings today? Uh, Mr. Prime Minister. Mr. President. I wanted to ask you, um, today, you spoke about uh, hoping to have, um, 3-way talks with President XI, and, President Putin. What would you say to? um, European leaders and other allies who may be concerned that? you're, um, apparently more keen to speak to America's, uh, adversaries than to its allies. I'll just go and first on this 1, uh, we had, uh, some talks, and we uh, told the European Union. we told the NATO people largely Day overlap. uh, you have to pay more money because it's unfair what we're doing. We're doing a tremendous amount more. would probably 200 billion dollars more going into uh, Ukraine using for Ukraine. to fight. and Europe is weight in terms of uh the money. it's not equitable. and we want to see a counterbalance. We want to have them. put up more. Money, They have to do that. at the same time. We had a very good conversation with President Putin. the other day yesterday and we also had a very good conversation. I did both in both cases. uh with President zielinski and uh I think we're something. I think we're going to be able to make a deal. And I hope so, because it's a horrible War. It's a very terrible Bloody war with a million and a half soldiers at least already dead on the battlefield. lying all over the fields. Like nobody's ever seen anything like it since certainly since the Second World War and uh, so I think we're going to be able to do something. we're working with uh president zielinski and with president Putin and my impression is that they I know that"}, {"text": "[Applause] thank you very much thank you very much please great honor I'm thrilled to welcome the prime minister of India my friend Narendra Modi back to the White House we spent a lot of time here and a lot of time in India and he's a very special man prime minister it is a pleasure to extend to you the same Hospitality that you showed Melania and myself when we traveled to your beautiful country 5 years ago it's hard to believe so long ago and it seemed like yesterday it was beautiful we opened the Cricket Stadium 129,000 seats I think the largest stadium in the world and it was uh an incredible period of time uh there is truly a special bond between the United States and India in the world's oldest democracy and the world's largest democracy and I believe uh the world's largest country in terms of the numbers of people and today the Prime Minister and I are announcing a framework to strengthen those ties even further economically and the US India compact for the 21st century is a historic initiative that will deepen every aspect of our partnership and our friendship starting this year will be increasing in military sales to India by many billions of dollars we're also Paving the way to ultimately provide India with the F35 stealth fighters in 2017 my Administration revived and reinvigorated the quad security partnership in our meeting today the Prime Minister and I reaffirmed that strong cooperation among the United States India Australia and Japan and it's crucial really to maintaining peace and prosperity Tranquility even in the indopacific in addition the United States and India will be working together like never before to confront the threat of radical Islamic terrorism a threat all over the world actually today I'm pleased to announce that my Administration has approved the extradition of one of the plotters and one of the very evil people of the world and uh having to do with the horrific 2008 Mumbai terrorist attack to face Justice in India so he's going to be going back to India face justice as we deepen our defense partnership will also strengthen our economic ties and bring greater fairness and reciprocity to our trading relationship as a signal of good faith Prime Minister Modi recently announced the reductions to India's unfair very strong tariffs that limit us access into the Indian market very strongly in really it's big problem I must say India imposes a 30 to 40 to 60 and even 70% tariff on so many of the goods and in some cases far more than that and as an example a 70% tariff On Us cars going into India which makes it pretty much impossible to sell those cars today the US uh trade deficit with India is almost hundred billion and Prime Minister Modi and I have agreed that we'll be begin negotiations to address the long running disparities that should have been taken care of over the last four years but they didn't do that in the US India trading relationship with the goal of a signing an agreement and we want uh really we want a certain Level Playing Field which we really think we're entitled to and and and he does also unfairness so we're going to work on that very hard and we can make up the difference very easily with the deficit with the sale of oil and gas LNG of which we have more than anybody in the world the Prime Minister and I also reached an important agreement on energy that will restore the United States as a leading supplier of oil and gas to India it will be hopefully their number one supplier and the groundbreaking development for US nuclear industry India is also reforming its laws to welcome US nuclear technology which is at the highest level into the Indian market this will bring safe clean and affordable electricity to millions of Indians and tens of billions of dollars to the US civilian nuclear industry in India and under the framework we are announcing today the United States and India are also joining forces to ensure that artificial intelligence and other Advanced Technologies are developed by the two of the most really true of the most advanced Nations uh intellectually and otherwise technologically anywhere in the world there's nobody very much closer we have an incredible relationship there and those are this is where it's seems to be heading and artificial intelligence complex a very complex subject but it seems to be where people want to be and they want to go and we're leading right now by a lot but other people will try to catch us I don't know if they're going to be able to we're going to make it available we're going to make tremendous amounts of electricity available we're going to let uh the people that are buying the electricity make their own electric plants electric generation plants and we've never done this in our country but we're going to get it done very quickly Lee zeldon and his group are going to get the approvals uh in very rapid form and we're calling it a national emergency and that's exactly what it is so we're going to be we're going to remain at the top of the AI or artificial intelligence I think for a long time to come and we're going to be working very closely with India and other countries on that but right now we're the Leader by quite a bit finally we agreed to work together to help build one of the greatest trade routes in all of history it will run from India to Israel to Italy and onward to the United States connecting our partners by ports Railways and undersea cables many many undersea cables it's a big it's a big development it's a lot of money going to be spent and we've already spent some but we're going to be spending a lot more in order to stay Advanced and stay the leader I'm pleased to report that with today's announcements the friendship between the United States and India is the strongest I believe it's ever been I think our relationship is the best it's ever been between two leaders of the two countries and it's an honor to say that I'd like to now invite the prime minister to say a few words and then we'll take some questions and uh we appreciate you all being here thank you very much thank you [Applause] very your Excellency president Trump delegates of both countries friends from the media namaskar I would like to first of all express my heartfelt gratitude to my dear friend president Trump for the grand welcome and Hospitality accorded to me president Trump's leadership has been instrumental in n nurturing India us ties and making them vibrant I could feel today the same enthusiasm the same the same enthusiasm the same energy the same commitment that we had worked with during our first term our discussions today highlighted our pride in our accomplishments during his first term the Deep Mutual trust that we share and also the resolve to attain new goals we also agreed that the partnership and cooperation between IND India and the US can shape a better world friends the people of America are aware of President Trump's motto make America great again or Maga the people of America are well aware of it the people of India too are focusing on both Heritage and and development as they move forward at a fast pace and with a firm resolve to ensure a developed India by 2047 if I were to say this borrowing an expression from America our vision for a developed India is to make India great again or meiger when America and India work together that is when Maga when it's Maga plus migga it becomes Mega a mega partnership for prosperity and it is this Mega spirit that gives new scale and scope to our objectives friends today we have also set ourselves the target of more than doubling our bilateral trade to attain $500 billion doar by 2030 our teams will work on concluding very soon a mutually beneficial Trade Agreement in order to ensure India's energy security we will focus on trade in oil and gas investment in energy infrastructure will also increase in the area of nuclear energy we also discussed increasing cooperation on small modular reactors friends America plays an important role in India's defense preparedness as strategic and trusted Partners we are moving forward actively towards joint development joint production and transfer of technology in the times to come as well new technologies and Equipment will enhance our capacities we have decided to launch the autonomous systems industry Alliance and a defense cooperation framework for the next decade will be prepared defense interoperability Logistics repair and maintenance will also be its key components friends the 21st century is a technology driven Century close cooperation in the area of Technology between countries that believe in Democratic Values can give New Direction strength and opportunities to the entire Humanity India and the US will jointly work in areas of artificial intelligence semiconductors Quantum biotechnology and several other Technologies today we also agreed on trust which stands for transforming relationships utilizing strategic technology under this our Focus will be on establishing strong Supply chains for critical minerals Advanced Materials and pharmaceuticals we have also decided to launch a recovery and processing Initiative for strategic minerals like lithium and rare Earths we have had close cooperation with the US in the area of space the Nisar satellite developed with mutual cooperation between ISRO and NASA will soon be flying into space on an Indian launch vehicle friends partnership between India and the US strengthens democracy and strengthens democratic values and systems we will work together to enhance peace stability and prosperity in the the Indo Pacific the quad will play a special role in this during the Cod Summit scheduled to be held in India this year we will expand cooperation in new areas with our partner countries under the iMac and I2 You2 we will work together for the development of of economic corridors and in the area of connectivity India and us will stand strongly together in the fight against terrorism we agree that in order to eliminate crossb terrorism we need concrete actions and I'm very grateful to president Trump that he uh in 2008 somebody who carried out genocide in India that criminal is now going to be handed over to India and I'm grateful to president Trump for this and appropriate action will be taken in the courts in India friends the Indian Community Living in the US is an important Link in our relations in order to further deepen Are People to People TI India will soon open new consulates in Los Angeles and Boston these will be new consulates we have invited American universities and educational institutes to open their offshore campuses in India president Trump I am grateful to you for your friendship and strong commitment towards India the people of India still fondly remember your visit in 2020 and hope that President Trump will come and visit them again on behalf of 1.4 billion Indians I invite you to visit India thank you thank you very much thank you thank you very much Beau okay thank you very much it was excellent H we'll do a few questions please please go ahead please go ahead yeah yeah blue shirt um thank you Mr President uh people in India will naturally welcome your decision to extra diet tabana to India back home in that context I would like to ask you a question about in last few years we have seen several groups in the US being raising anti-india voice calling about separation terrorism activities in India do you think that should continue here in the US as well you're going to have to go louder uh Mr President people India would be welcoming your decision to extradite tabur to I can't understand what are he saying may I sir may I may I sir go ahead back there Mr President thank you um first I want to ask question um you and the president you both spoke about combating Isis you you both sounded very exciting about this excited about this partnership um upcoming and I I was curious how much more confident are you with President Trump leading this country that there will be peace through strength and you will have a s successful partnership with the United States versus um with uh Biden's incompetence and weakness over the last four years that's your question but I'll answer it I agree with you yeah gross incompetence uh we're going to have a fantastic relationship and it has been look The Whole World's been set back over the last four years by the weakness of the United States the weak leadership of the United States but I think we've taken care of it in just three weeks it seems to me that even uh some of the media that we wouldn't prefer has been writing that this is a much different country right now that the world has a light over it not only our country but the whole world uh the Prime Minister told me that before too even over India the world has a light they need the United States to be strong and powerful but good and I think that's happened and I think it's happened in a very short period of time but I will tell you we're going to have a fantastic relationship and it'll make both countries much stronger yes go ahead please Okay g mun from India today sir I'll just take my colleague L ja's question forward because you can understand fine um the question is about um the fact that you've uh decided to extradite theana thank you so much India has been waiting to to have him back in India to bring him to justice but there are many other elements in uh the United States of America particularly khalistani separatists who've been working against Indian interests how is the United States of America going to cooperate on that front with India there are there have been allegations that have been leveled against Indian agencies by the Biden Administration are you going to relook that with uh Tulsi Gabbert as dni now well I don't think India had a very good relationship with the Biden Administration Biden they wouldn't sell them oil and gas which is rather hard to believe because you know it's a good thing to do and uh a lot of things happened that weren't very appropriate I thought between India and the administration the Biden Administration but uh as you said we're giving a very violent man it seems to me I mean I don't know that he's been convicted yet or will be but uh let's assume he's a pretty violent person we're giving him back to India immediately and uh there are more to follow because we have quite a few requests so we work with India on crime and we want to make it good for India and it's very important so that kind of a relationship is very important to us okay go ahead please um go ahead thank you uh Mr President you've repeatedly called India big abuser of trade and said it is really difficult to do business in India because of tariffs uh you announced reciprocal tariffs today uh I'm hoping you can speak about uh what kind of reciprocal tariffs India can expect are you willing to make any concessions uh and how can India head off uh these tariffs I also have one for the Prime Minister Well India has been uh to us just about the highest tariffed Nation anywhere in the world they've been very strong on tariffs and I don't blame them necessarily but it's a different way of doing business it's it's very hard to sell into India because they have trade barriers very strong tariffs we are right now a reciprocal Nation we are going to if it's India or if it's somebody else with low tariffs we're going to have the same we're going to have whatever India charges we're charging them whatever another country charges we're charging them so it's called re reciprocal which I think is a very fair way we didn't have that we uh I was going to do that in my other term and we had the greatest economy ever in the world we've never there's never been an economy like we had and then we got hit with Co we had a focus on that and I wasn't really in the mood to be putting it on Italy and Spain and France and India frankly and a lot of other countries because the world was very troubled until we got rid of that nightmare but we had the strongest economy anywhere in the world during that fairly long period of time during my first term as you know and uh we didn't do the tariffs uh we would have done the reciprocal tariffs but uh we decided and I decided I think on a human basis on a Humane basis not to do them because of the fact that there was such suffering all over the world the last thing we needed to talk about is trade problems but now we do we're doing uh we see a tremendous future for our country but we felt that now it's finally time after 45 or 50 years of abuse that we will do and this isn't India this is among a lot of Nations the European Union is very difficult for us very very difficult they they tax our companies at levels that nobody's ever seen before they take advantage of a lot of things so we're not happy about that China of course is terrible and uh we've never taken in 10 cents until I was President we've taken in hundreds of billions of dollars from China since I've been president in first term and now and uh we have to do that just as a mechanism of fairness and that's what I've done and so we are being reciprocal with India whatever India charges we charge them so frankly it no longer matters to us that much what they charge because whatever they charge uh I had discussions with India and the first term about the fact that their tariffs were very high and I was unable to get a concession so we're just going to do it the easy way and we're just going to say whatever you charge we charge and I think that's fair for the people of the United States and I think it's actually fair for India okay to make concession sir are you willing to make any concession sir any concession go ahead please ask to the prime question for the Prime Minister please ask to the Prime Minister please yes sorry uh Yosh Singh with press Trust of India prime minister thank you Mr President uh prime minister the US is uh giving a lot of push to curb illegal immigration and India has been cooperating on this issue uh how does India see this issue in the larger context thank you I don't think this is a question that is about India only but even globally you can talk about this issue and uh we are of the opinion that anybody who enters another country illegally they they have absolutely no right to be in that country and as far as India and the US is concerned we have always been of the same opinion and that is that any verified Indian who is in the US illegally we are fully prepared to take them back to India however it doesn't stop there these are children of very ordinary families and they are lured by Big Dreams and big promises a lot of them are brought in without them knowing about why they're going to a country and in fact they are connected with a human trafficking system and we have to make sure that we fight against this system as far as the US and India is concerned I think what we should do is make efforts to make sure that we uproot these uh from within the system so that we can reduce or remove uh human trafficking and basically the the the young vulnerable poor people of India are fooled into coming over as illegal immigrants and our bigger fight actually is against this ecosystem or this system that encourages such gangs to thrive and I can tell you that India will completely support your Endeavor in achieving this thank you thank you Mr President um the question for the Prime Minister Modi first if I may um I wanted to ask you um did you discuss any possible business deals with Elon Musk during your uh your meetings today uh Mr Prime Minister and Mr President I wanted to ask you um today you spoke about uh hoping to have um three-way talks with President Z and President Putin what would you say to um European leaders and other allies who may be concerned that you're um apparently more keen to speak to America's uh adversaries than to its allies thank you well maybe I'll just go and first on this one uh we had uh some talks and we uh told the European Union we told tell the NATO people largely they overlap uh you have to pay more money because it's unfair what we're doing we're doing a tremendous amount more with probably $200 billion do more going into uh Ukraine using for Ukraine to fight and Europe has not really carried its weight in terms of uh the money it's not Equitable and we want to see a counterbalance we want to have them put up more money they have to knew that at the same time we had a very good conversation with President Putin the other day yesterday and we also had a very good conversation I did both in both cases uh with president zalinski and uh I think we're going to be able to do something I think we're going to be able to make a deal and I hope so because it's a horrible War it's a very terrible bloody war with a million and a half soldiers at least already dead on the battlefield lying all over the fields like nobody's ever seen anything like it since certainly since the Second World War and uh so I think we're going to be able to do something we're working with uh president zalinski and with President Putin and my impression is that they I know that president zalinski wants to make a deal and I also feel that I know that President Putin wants to make a deal I wanted to know that before I began any detailed discussions but uh the meeting and the the conversation also the meeting with Steve witkoff and Moscow was a very successful one and my phone call with him was a very successful one please as uh you asked a question regarding Elon uh musk I have known him for a very long time I was not even a prime minister at the time when I first met him I was chief minister and uh today he came to meet me along with all his family with his children and uh so we had a nice discussion as far as deal eeve is concerned e are concerned the EV uh the word EV has a copyright uh and that is uh one person who has a copyright for the word Eevee and that is Trump thank you Mr President can I ask whether you discussed all today the case of gatam adani who's one of the wealthiest men in Asia and perceived as an ally of Prime Minister Modi Prime Minister Modi have you asked the president to take action on that case thank you firstly India is a democratic country and our culture and our thought philosophy isum which basically means that the entire world is a family every Indian is my own family member and when it comes to such personal matters two leaders of two countries will not get together on that topic and discuss anything on an individual matter go ahead please yeah please sir go ahead please yes thank you Mr President um thank you Mr Prime Minister I have a question for you as well but Mr President you have suggested with regards to the Russia Ukraine war you've suggested several things that Ukraine should give up the idea of NATO membership territory that was seized back in 2014 by Russia what should Russia give up uh Russia has gotten themselves into something that I think they wish they didn't if I were president it would not have happened absolutely would not have happened and it didn't happen for four years if you look at uh what has taken place under President Bush they lost a lot under uh President Obama they lost Crimea under Biden it looks like they could lose the whole thing under Trump they lost nothing Ukraine lost nothing they didn't give up anything and uh you take a look at the other three presidents surrounding me uh they gave up a lot uh I think that when you look at Ukraine and when you look at the mess that they're in uh it's got to be ended and it's got to be stopped now Russia's taken over a pretty big chunk of territory uh and they also uh have said from day one long before President Putin they've said they cannot have Ukraine be in NATO they said that very strongly I actually think that that was the thing that c caused the start of the war and uh Biden said it and zalinsky said it and I think that was one of the reasons one of the starts of the war but from long before Putin they said you cannot have uh you cannot have Ukraine going in in any way into NATO and I start from that standpoint I think everybody knew that now if a better deal can be NE negotiated if uh they are able to make a deal where they can do that that's fine with me I really don't care I want I want that Bloodshed to stop I don't want to see you know we have an ocean between us and the site we're talking about the s of death we're calling it the fields of death we have a big ocean in between us this is more important for Europe we shouldn't be in they have to equalize and they're going to have to do it fast but they have to equalize but as far as uh the negotiation it's too early to say what's going to happen uh maybe Russia will give up a lot maybe they won't and it's all dependent on what is going to happen the negotiation really hasn't started but I will say as far as NATO is concerned from many years before President Putin I will tell you that I've heard that Russia would never accept that and I think Ukraine knew that because Ukraine wasn't in and never requested to be until more recently so that's the way it is and I think that's the way it's going to have to be go ahead please all right go ahead please with a tie with a tie yeah Mr President uh yes go ahead pleas this s Shukla from News Mobile Mr President you spoke about Prime Minister Modi as a tough negotiator who was a tougher negotiator today and who has a better negotiating tactic when it comes to terorist oh he's a much tougher negotiator than me and he's a much better negotiator than me there's not even a contest okay yeah go ahead please go ahead go ahead Reena bwat from AI uh how do you see this relationship between in the India and the United States to counter China and uh what is your Vision when it comes to India uh you know brokering peace um in the Ukraine and Russia conflict well I think we going to have a very good relationship with China I got along with President Chief very well until Co that was a bridge too far but until then I got along with President CH very very well we were very close as Leaders go I don't want to be naive but uh as Leaders go I think we were very close and I think that China is a very important player in the world world I think they can help us get this war over with Ukraine and Russia and uh I look at India I do see the skirmishes on the border which are quite vicious and I guess they continue to go on uh if I could be of help I'd love to help because that should be stopped that's been going on for a long time and it's quite violent it's quite violent but uh I would hope that China and India and Russia and us and all of us can get along it's very important uh you know the power of Weaponry today is and not only nuclear but nuclear in particular the power of Weaponry is very important I said before that I had uh very constructive talks uh in my first term with President Putin about the denuclearization of the two countries and then we were going to go to China after we worked some kind of a deal and we had the confines of a deal we we were I thought we he really wanted to do it so did I didn't nuclearized and it's so it's such a beautiful term when you think about it in other words to bring it down because the power of those weapons is is too great and uh I did speak to president XI about that and I was getting also a very good response he's uh building a very strong nuclear power he's not very close to Russia or the United States right now but he will be soon I mean he'll he'll catch up over the period of four or five years they say uh but it would be a great thing if we could on a military basis we're going to spend this year 900 let's say $915 billion doll on Military uh Russia without the war was spending close to a 100 but with the War I can't tell you what they're spending but they're spending a lot and China is spending $ 4450 billion we're over $900 billion and I said you know it doesn't really make sense ases it we're spending the money against each other and we could spend that money for better purpose if we got along and I I'll tell you I think that uh something like that will happen first when I left as you know four years ago we didn't have Israel and the Middle East we didn't have October 7th a disaster the disaster nothing was happening Iran was not in going to do anything because Iran did not have much money at that point they were broke they were totally broke they didn't have money for Hamas or for Hezbollah and you didn't have Russia with Ukraine and that would never have happened but now I come back and I have the whole world is on fire so I have to put out the fires but after I put out the fires I'm going to meet with China and I'm going to meet with Russia and we're going to see if we can deescalate if we can bring it down military especially as it pertains to nuclear [Music] please mic please uh prime minister uh how do you see India's role you have had discussions with uh president Trump about deescalation uh the conflict in Russia and Ukraine as you know I have been in constant contact with both Russia and Ukraine I have also visited both countries and uh many peoples are mistaken and they feel that India is neutral I would like to clarify India is not neutral we have taken a side and we have taken the side of peace and it is uh based on this principle of ours that uh in the presence of uh President Putin I clearly said in front of the media that this is not the era of war and even today it is my conviction that Solutions cannot be found on the battlefield ultimately you have to come to the negotiating table and India has constantly made efforts that there are talks that take place where both parties are present it is only then that we will find a solution the efforts being made by President Trump I support them I welcome them and I would like that President Trump is successful as soon as possible so that the world is on the path to peace once again everybody thank you very much thank you very much and I very much appreciate the Prime Minister visiting our great country and I do really appreciate it we have so much in common and all all we want to do is have peace and we want to have strength and we want to have lots of different things together but uh the relationship with India and with the Prime Minister has never been better thank you very much thank you thank you"}, {"text": "president. Trump meeting with Indian Prime Minister Modi. Let's listen in to some of these comments here on live now. We kept the relationship. during the. 4 year, period. The period that was very interesting. Period Indeed I watched I got to see how not to do things. and uh, we've just started up again, and we have I think some very big things to talk about. Number 1 is uh, they're going to be and gas we have more oil and gas than any other country in the world by far. and, they needed. And we have it. and we, uh, we're going to talk about trade. We're going to talk about many things but uh, it's really an honor to see you and you have been my friend for a long time. and congratulations. on having done a great job. Thank you. thank you Love to say anything more. No, I'm okay. I'm delighted to see you back in the White House and to meet with you today in. this room. on behalf of 1.4 let me convey my heart is congratulations to you. on victory. This. Last year, the people of India. gave me the opportunity to serve them for the third consecutive time, and it has happened in the history of India in in the last 60 and uh, in this term, I will have an opportunity to work with you over the next 4 years. And it's a great great pleasure to see the 2 cohancy. Are mainly. How? I'm happy that. as soon as I entered this room, my friend reminded cricket stadium where we held the big rally and uh, uh, the events that we did the mega events that we did in Ahmedabad Namaste Trump, or the howdy Modi conveyed a very strong message of our friendship through those events and the resounding echo of those events can be heard even today in India. and the world. Arm. you made. immense personal contribution towards strengthening of our them more comprehensive. And in attaining unprecedented Heights in our relationship. And I firmly believe that in your second term, we will work had promised to the people of India, that in my third term, as the prime minister of India, we will work with trees to speed I firmly believe that with President Trump during the next 4 term, we will work with twice the speed that we did in the first time. Ras. I am. 1 thing that I deeply appreciate. And I learned from president. the national interest Supreme. and like him. I also keep the national interest of India at the top of everything else. And this has been my real fortune. Fortune. Great again. president, Donald Trump and make America great again are inseparable whenever we talk about President Trump, America great again. Similarly, that that Vision inspires everybody similarly in India, we have the resolve of 1.4 billion people of India that by the time India reaches the 100th anniversary of its independence. we will make our country a developed country by 2047 and this is getting new speed. And new, uh results. America. which 1 + 1 2. Us is the oldest democracy And India is the world's largest democracy. So when India and the US come together they make 1 plus 1 11 and not 2. and this is the power of 11 that is going to work for the welfare of the human Humanity. once again, thank my friend. president Trump And uh, we together resolve that we progress and towards prosperity for our Nations. Thank you. Thank you. Thank you very much. Great job in India. Everybody talks about it. He's doing a really fantastic job, a great leader. great leader. I thank you for your warm words. Mr. President, and I firmly believe that every person in India respects your sentiments. Thank you very much. Any questions please? You are you you know you are both very popular leaders in your sense. That you should expect. from the meeting. Well, I think more than anything else will be the unity We have great Unity. we have great friendship. He and I, and our countries. and I think it's only going to get closer but it's very important that we remain United as countries. We are uh, we're friends and we're going to stay that way. If you're going to be tough with India and trade, how are we going to beat China, then? A very good shape to beat anybody we want, but we're not looking to beat anybody. We're looking to do a really good job. where we've done a fantastic job for the American people. We had a great 4 years and we were interrupted by uh, terrible Administration. Absolutely terrible. They didn't know what they were doing and now we're putting it back together and I think it's going to end up being much stronger than it was before even. much stronger than it was before. Yeah. of all, congratulations for the fantastic. 24 days of your presidency. Historic and unprecedented decisions that you made transformational reforms. and put By. usaid and I would like, you to share with us. if you think usaid had a role in election. interference in the US in 2020 and Indian elections in 2024 so, it could have had a role. Now, there were a lot of bad things that happened in 2020. I think bad things happen in 2024, but it was too big to rig. We, we won by a tremendous. margin. and we won every swing state we won. The popular vote by millions of votes. So it was, it was too big to rig, but uh, yeah, I think They probably tried. We're looking to go to a system now much different. where 1 day voting voter ID and uh you just we have to do that and paper ballots. we want paper ballots. and when they do that, we're going toclean it up very, very well. But we had a great. 2016. We had a much better. 2020 election but bad things happen. and we had the best of all we had, they say the most consequential. in history. uh, 129 years. Most consequential. So it was a great election. and it gives me a chance to work again with the prime minister. And uh, Indianapolis. We're going to be we're going to have a great relationship. together. Biggest. you see? India playing a role in your plan to broker peace in Ukraine and if I can ask you about a development in your home town today, the US the doj's request to drop the case into her Adams. Did you personally request the justice department to drop that case? No, I did. know nothing about it. I did not. uh I think that uh just to answer your other question. Uh, we just going to get along. Well, we're going to get along with all countries. We're going to do very well. Uh, we're going to be doing, I think record business. record numbers. and we're going to work with India. Also, we have some very big trade very near future. President Biden. president Trump. and Mr. President what you would like to say about the Bangladesh issue because we saw and it is evident that How the Deep state of United States was involved regime change during the Biden Administration? and then Mohammed yulu made. Junior Soros. Also so what is your your point of view about the Bangladesh? and what is The role that beneath the created in the situation in Bangladesh? Well, there was no Royal for our deep state, it was uh, this is something that the prime Minister has been working on for a long time and has been worked on for hundreds of years, Frankly, I've been reading about it. but I will leave Bangladesh to the prime minister. No, sir, Ukraine. Neutral. Heart of neutral. Shanty. Media. Conviction. Ukraine conflict is concerned. I'm very happy that President Trump has peace and had telephones calls with the President Putin and president. zelinski. the world. Uh, had this thinking that India somehow is a neutral process. but this is not true. India has a side and that side is of peace. from the very first day, I have the uh, uh, talking about the importance of dialogue and diplomacy and a peaceful solution and when I met President Putin, in the presence of media, I had told him that this is not the era of war and I have firm conviction That problems cannot be resolved on the battlefield. the 2 sides negotiating table. I just want to add to that. We had a very good. phone call yesterday. with President hour and a half. it was excellent. And I think we went a long way toward getting a solution to the horrible War. where so many people are being killed. Especially soldiers on the battlefield. It's a million and a half. soldiers have been killed. uh, we've got a long way to I think we've got a long way to solving it. Uh, Tomorrow there's a meeting. in Munich. and then next week, There's a meeting in Saudi Arabia not with myself for President Putin but with top officials, and, Ukraine will be a part of it, too. And we're going to see if we can end that war. That war is a horrible War. It's a vicious, Bloody war. We want to end it. Uh to your other question that us attorney was actually fired. I don't know. He or she resigned, but uh, that us attorney was fired. Did you expect? us competition? with China? and in your broader vision? for peace in the Middle East? Well, I think we're doing very well in our competition with everybody I think you're going to see a nation that really is uh going forward. at a very rapid pace. Our economy is going to be fantastic. We're doing things to make it that way. We announced some very big. elements today of success. I success. reciprocal tariffs. So that uh, somebody charges us, we charge them the same amount. which is, uh never been done in our country before. We've always been taken advantage of by other countries that we allowed that to happen. foolishly. But we can and that we're not going to allow that. any longer. So I very well. We've been doing our last, uh, they say the last 3 weeks was among the best 3 weeks ever. for a start and a presidency. There's never been anything what we've been able to do in 3 weeks, people are really amazed. Even the prime minister mentioned it. I think other countries are looking at it. but uh I just want to thank everybody for being here. This is a terrific man. We're going to make some wonderful trade deals for"}]